adamkondraciuk/nrfx/mdk/nrf54lilium_network_bitfields.h
/* Register: CCM_TASKS_STOP */
/* Description: Stop encryption/decryption */

/* Bit 0 : Stop encryption/decryption */
#define CCM_TASKS_STOP_TASKS_STOP_Pos (0UL) /*!< Position of TASKS_STOP field. */
#define CCM_TASKS_STOP_TASKS_STOP_Msk (0x1UL << CCM_TASKS_STOP_TASKS_STOP_Pos) /*!< Bit mask of TASKS_STOP field. */
#define CCM_TASKS_STOP_TASKS_STOP_Trigger (1UL) /*!< Trigger task */

/* Register: CCM_TASKS_RATEOVERRIDE */
/* Description: Override DATARATE setting in MODE register with the contents of the RATEOVERRIDE register for any ongoing encryption/decryption */

/* Bit 0 : Override DATARATE setting in MODE register with the contents of the RATEOVERRIDE register for any ongoing encryption/decryption */
#define CCM_TASKS_RATEOVERRIDE_TASKS_RATEOVERRIDE_Pos (0UL) /*!< Position of TASKS_RATEOVERRIDE field. */
#define CCM_TASKS_RATEOVERRIDE_TASKS_RATEOVERRIDE_Msk (0x1UL << CCM_TASKS_RATEOVERRIDE_TASKS_RATEOVERRIDE_Pos) /*!< Bit mask of TASKS_RATEOVERRIDE field. */
#define CCM_TASKS_RATEOVERRIDE_TASKS_RATEOVERRIDE_Trigger (1UL) /*!< Trigger task */

/* Register: CCM_TASKS_PROCESS */
/* Description: Fetches and processes one byte from INPTR in manual data rate mode */

/* Bit 0 : Fetches and processes one byte from INPTR in manual data rate mode */
#define CCM_TASKS_PROCESS_TASKS_PROCESS_Pos (0UL) /*!< Position of TASKS_PROCESS field. */
#define CCM_TASKS_PROCESS_TASKS_PROCESS_Msk (0x1UL << CCM_TASKS_PROCESS_TASKS_PROCESS_Pos) /*!< Bit mask of TASKS_PROCESS field. */
#define CCM_TASKS_PROCESS_TASKS_PROCESS_Trigger (1UL) /*!< Trigger task */

/* Register: CCM_SUBSCRIBE_CONFIG */
/* Description: Subscribe configuration for task CONFIG */

/* Bit 31 :   */
#define CCM_SUBSCRIBE_CONFIG_EN_Pos (31UL) /*!< Position of EN field. */
#define CCM_SUBSCRIBE_CONFIG_EN_Msk (0x1UL << CCM_SUBSCRIBE_CONFIG_EN_Pos) /*!< Bit mask of EN field. */
#define CCM_SUBSCRIBE_CONFIG_EN_Disabled (0UL) /*!< Disable subscription */
#define CCM_SUBSCRIBE_CONFIG_EN_Enabled (1UL) /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task CONFIG will subscribe to */
#define CCM_SUBSCRIBE_CONFIG_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define CCM_SUBSCRIBE_CONFIG_CHIDX_Msk (0xFFUL << CCM_SUBSCRIBE_CONFIG_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: CCM_SUBSCRIBE_CRYPT */
/* Description: Subscribe configuration for task CRYPT */

/* Bit 31 :   */
#define CCM_SUBSCRIBE_CRYPT_EN_Pos (31UL) /*!< Position of EN field. */
#define CCM_SUBSCRIBE_CRYPT_EN_Msk (0x1UL << CCM_SUBSCRIBE_CRYPT_EN_Pos) /*!< Bit mask of EN field. */
#define CCM_SUBSCRIBE_CRYPT_EN_Disabled (0UL) /*!< Disable subscription */
#define CCM_SUBSCRIBE_CRYPT_EN_Enabled (1UL) /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task CRYPT will subscribe to */
#define CCM_SUBSCRIBE_CRYPT_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define CCM_SUBSCRIBE_CRYPT_CHIDX_Msk (0xFFUL << CCM_SUBSCRIBE_CRYPT_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: CCM_SUBSCRIBE_STOP */
/* Description: Subscribe configuration for task STOP */

/* Bit 31 :   */
#define CCM_SUBSCRIBE_STOP_EN_Pos (31UL) /*!< Position of EN field. */
#define CCM_SUBSCRIBE_STOP_EN_Msk (0x1UL << CCM_SUBSCRIBE_STOP_EN_Pos) /*!< Bit mask of EN field. */
#define CCM_SUBSCRIBE_STOP_EN_Disabled (0UL) /*!< Disable subscription */
#define CCM_SUBSCRIBE_STOP_EN_Enabled (1UL) /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task STOP will subscribe to */
#define CCM_SUBSCRIBE_STOP_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define CCM_SUBSCRIBE_STOP_CHIDX_Msk (0xFFUL << CCM_SUBSCRIBE_STOP_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: CCM_SUBSCRIBE_RATEOVERRIDE */
/* Description: Subscribe configuration for task RATEOVERRIDE */

/* Bit 31 :   */
#define CCM_SUBSCRIBE_RATEOVERRIDE_EN_Pos (31UL) /*!< Position of EN field. */
#define CCM_SUBSCRIBE_RATEOVERRIDE_EN_Msk (0x1UL << CCM_SUBSCRIBE_RATEOVERRIDE_EN_Pos) /*!< Bit mask of EN field. */
#define CCM_SUBSCRIBE_RATEOVERRIDE_EN_Disabled (0UL) /*!< Disable subscription */
#define CCM_SUBSCRIBE_RATEOVERRIDE_EN_Enabled (1UL) /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task RATEOVERRIDE will subscribe to */
#define CCM_SUBSCRIBE_RATEOVERRIDE_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define CCM_SUBSCRIBE_RATEOVERRIDE_CHIDX_Msk (0xFFUL << CCM_SUBSCRIBE_RATEOVERRIDE_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: CCM_SUBSCRIBE_PROCESS */
/* Description: Subscribe configuration for task PROCESS */

/* Bit 31 :   */
#define CCM_SUBSCRIBE_PROCESS_EN_Pos (31UL) /*!< Position of EN field. */
#define CCM_SUBSCRIBE_PROCESS_EN_Msk (0x1UL << CCM_SUBSCRIBE_PROCESS_EN_Pos) /*!< Bit mask of EN field. */
#define CCM_SUBSCRIBE_PROCESS_EN_Disabled (0UL) /*!< Disable subscription */
#define CCM_SUBSCRIBE_PROCESS_EN_Enabled (1UL) /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task PROCESS will subscribe to */
#define CCM_SUBSCRIBE_PROCESS_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define CCM_SUBSCRIBE_PROCESS_CHIDX_Msk (0xFFUL << CCM_SUBSCRIBE_PROCESS_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: CCM_EVENTS_ENDCONFIG */
/* Description: Configuration data has been loaded */

/* Bit 0 : Configuration data has been loaded */
#define CCM_EVENTS_ENDCONFIG_EVENTS_ENDCONFIG_Pos (0UL) /*!< Position of EVENTS_ENDCONFIG field. */
#define CCM_EVENTS_ENDCONFIG_EVENTS_ENDCONFIG_Msk (0x1UL << CCM_EVENTS_ENDCONFIG_EVENTS_ENDCONFIG_Pos) /*!< Bit mask of EVENTS_ENDCONFIG field. */
#define CCM_EVENTS_ENDCONFIG_EVENTS_ENDCONFIG_NotGenerated (0UL) /*!< Event not generated */
#define CCM_EVENTS_ENDCONFIG_EVENTS_ENDCONFIG_Generated (1UL) /*!< Event generated */

/* Register: CCM_EVENTS_ENDCRYPT */
/* Description: Encrypt/decrypt complete */

/* Bit 0 : Encrypt/decrypt complete */
#define CCM_EVENTS_ENDCRYPT_EVENTS_ENDCRYPT_Pos (0UL) /*!< Position of EVENTS_ENDCRYPT field. */
#define CCM_EVENTS_ENDCRYPT_EVENTS_ENDCRYPT_Msk (0x1UL << CCM_EVENTS_ENDCRYPT_EVENTS_ENDCRYPT_Pos) /*!< Bit mask of EVENTS_ENDCRYPT field. */
#define CCM_EVENTS_ENDCRYPT_EVENTS_ENDCRYPT_NotGenerated (0UL) /*!< Event not generated */
#define CCM_EVENTS_ENDCRYPT_EVENTS_ENDCRYPT_Generated (1UL) /*!< Event generated */

