adamkondraciuk/nrfx/mdk/nrf54lilium_network_bitfields.h
/* Bits 1..0 : Error status when the ERROR event is generated */
#define CCM_ERRORSTATUS_ERRORSTATUS_Pos (0UL) /*!< Position of ERRORSTATUS field. */
#define CCM_ERRORSTATUS_ERRORSTATUS_Msk (0x3UL << CCM_ERRORSTATUS_ERRORSTATUS_Pos) /*!< Bit mask of ERRORSTATUS field. */
#define CCM_ERRORSTATUS_ERRORSTATUS_NoError (0UL) /*!< No errors have occurred */
#define CCM_ERRORSTATUS_ERRORSTATUS_PrematureInptrEnd (1UL) /*!< End of INPTR job list before CCM data structure was read. */
#define CCM_ERRORSTATUS_ERRORSTATUS_PrematureOutptrEnd (2UL) /*!< End of OUTPTR job list before CCM data structure was read. */
#define CCM_ERRORSTATUS_ERRORSTATUS_EncryptionTooSlow (3UL) /*!< Encryption of the unencrypted CCM data structure did not complete in time. */

/* Register: CCM_ENABLE */
/* Description: Enable */

/* Bits 1..0 : Enable or disable CCM */
#define CCM_ENABLE_ENABLE_Pos (0UL) /*!< Position of ENABLE field. */
#define CCM_ENABLE_ENABLE_Msk (0x3UL << CCM_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field. */
#define CCM_ENABLE_ENABLE_Disabled (0UL) /*!< Disable */
#define CCM_ENABLE_ENABLE_Enabled (2UL) /*!< Enable */

/* Register: CCM_MODE */
/* Description: Operation mode */

/* Bits 26..24 : CCM MAC length (bytes) */
#define CCM_MODE_MACLEN_Pos (24UL) /*!< Position of MACLEN field. */
#define CCM_MODE_MACLEN_Msk (0x7UL << CCM_MODE_MACLEN_Pos) /*!< Bit mask of MACLEN field. */
#define CCM_MODE_MACLEN_M0 (0UL) /*!< M = 0 This is a special case for CCM* where encryption is required but not authentication */
#define CCM_MODE_MACLEN_M4 (1UL) /*!< M = 4 */
#define CCM_MODE_MACLEN_M6 (2UL) /*!< M = 6 */
#define CCM_MODE_MACLEN_M8 (3UL) /*!< M = 8 */
#define CCM_MODE_MACLEN_M10 (4UL) /*!< M = 10 */
#define CCM_MODE_MACLEN_M12 (5UL) /*!< M = 12 */
#define CCM_MODE_MACLEN_M14 (6UL) /*!< M = 14 */
#define CCM_MODE_MACLEN_M16 (7UL) /*!< M = 16 */

/* Bit 20 : When enabled, the INPTR data structure will process one byte each time the PROCESS task is triggered. This can be used to support various data rates for on-the-fly encryption/decryption modes. */
#define CCM_MODE_MANUALDATARATE_Pos (20UL) /*!< Position of MANUALDATARATE field. */
#define CCM_MODE_MANUALDATARATE_Msk (0x1UL << CCM_MODE_MANUALDATARATE_Pos) /*!< Bit mask of MANUALDATARATE field. */
#define CCM_MODE_MANUALDATARATE_Disable (0UL) /*!< Disable manual data rate */
#define CCM_MODE_MANUALDATARATE_Enable (1UL) /*!< Enable manual data rate */

/* Bits 18..16 : Radio data rate that the CCM shall run synchronous with */
#define CCM_MODE_DATARATE_Pos (16UL) /*!< Position of DATARATE field. */
#define CCM_MODE_DATARATE_Msk (0x7UL << CCM_MODE_DATARATE_Pos) /*!< Bit mask of DATARATE field. */
#define CCM_MODE_DATARATE_125Kbit (0UL) /*!< 125 Kbps */
#define CCM_MODE_DATARATE_250Kbit (1UL) /*!< 250 Kbps */
#define CCM_MODE_DATARATE_500Kbps (2UL) /*!< 500 Kbps */
#define CCM_MODE_DATARATE_1Mbps (3UL) /*!< 1 Mbps */
#define CCM_MODE_DATARATE_2Mbit (4UL) /*!< 2 Mbps */
#define CCM_MODE_DATARATE_4Mbit (5UL) /*!< 4 Mbps */

/* Bits 9..8 : Protocols that uses Crypto IP Due to the differences in BLE and 802.15.4 packets, HW needs to have a separation between them. */
#define CCM_MODE_PROTOCOL_Pos (8UL) /*!< Position of PROTOCOL field. */
#define CCM_MODE_PROTOCOL_Msk (0x3UL << CCM_MODE_PROTOCOL_Pos) /*!< Bit mask of PROTOCOL field. */
#define CCM_MODE_PROTOCOL_CCM_BLE (0UL) /*!< BLE packet format */
#define CCM_MODE_PROTOCOL_CCM_154 (1UL) /*!< 802.15.4 packet format */

/* Bits 1..0 : The mode of operation to be used. The settings in this register apply when the CRYPT task is triggered. */
#define CCM_MODE_MODE_Pos (0UL) /*!< Position of MODE field. */
#define CCM_MODE_MODE_Msk (0x3UL << CCM_MODE_MODE_Pos) /*!< Bit mask of MODE field. */
#define CCM_MODE_MODE_Encryption (0UL) /*!< AES CCM packet encryption mode */
#define CCM_MODE_MODE_Decryption (1UL) /*!< AES CCM packet decryption mode */
#define CCM_MODE_MODE_FastDecryption (2UL) /*!< AES fast decrypt mode. This mode will run CCM decryption as fast as possible, i.e. not locked to a radio data rate. This can be used when a packet has been completely received. */

/* Register: CCM_KEY_VALUE */
/* Description: Description collection: 128-bit AES key */

/* Bits 31..0 : AES 128-bit key value, bits (32*(i+1))-1 : (32*i) */
#define CCM_KEY_VALUE_VALUE_Pos (0UL) /*!< Position of VALUE field. */
#define CCM_KEY_VALUE_VALUE_Msk (0xFFFFFFFFUL << CCM_KEY_VALUE_VALUE_Pos) /*!< Bit mask of VALUE field. */

/* Register: CCM_NONCE_VALUE */
/* Description: Description collection: 13-byte NONCE vector Only the lower 13 bytes are used */

/* Bits 31..0 : NONCE value, bits (32*(i+1))-1 : (32*i) */
#define CCM_NONCE_VALUE_VALUE_Pos (0UL) /*!< Position of VALUE field. */
#define CCM_NONCE_VALUE_VALUE_Msk (0xFFFFFFFFUL << CCM_NONCE_VALUE_VALUE_Pos) /*!< Bit mask of VALUE field. */

/* Register: CCM_INPTR */
/* Description: Input pointer Points to a job list containing unencrypted CCM data structure in Encryption mode Points to a job list containing encrypted CCM data structure in Decryption mode */

/* Bits 31..0 : Input pointer */
#define CCM_INPTR_INPTR_Pos (0UL) /*!< Position of INPTR field. */
#define CCM_INPTR_INPTR_Msk (0xFFFFFFFFUL << CCM_INPTR_INPTR_Pos) /*!< Bit mask of INPTR field. */

/* Register: CCM_INAMOUNT */
/* Description: Number of bytes read from the input data, not including the job list structure */

/* Bits 31..0 : Number of bytes read from the input data */
#define CCM_INAMOUNT_INAMOUNT_Pos (0UL) /*!< Position of INAMOUNT field. */
#define CCM_INAMOUNT_INAMOUNT_Msk (0xFFFFFFFFUL << CCM_INAMOUNT_INAMOUNT_Pos) /*!< Bit mask of INAMOUNT field. */

/* Register: CCM_OUTPTR */
/* Description: Output pointer Points to a job list containing encrypted CCM data structure in Encryption mode Points to a job list containing decrypted CCM data structure in Decryption mode */

/* Bits 31..0 : Output pointer */
#define CCM_OUTPTR_OUTPTR_Pos (0UL) /*!< Position of OUTPTR field. */
#define CCM_OUTPTR_OUTPTR_Msk (0xFFFFFFFFUL << CCM_OUTPTR_OUTPTR_Pos) /*!< Bit mask of OUTPTR field. */

