adamkondraciuk/nrfx/mdk/nrf54lilium_network_bitfields.h
/* Register: COMP_BGREADY */
/* Description: COMP module is ready */

/* Bit 0 : Result of last compare. Decision point SAMPLE task. */
#define COMP_BGREADY_STATE_Pos (0UL) /*!< Position of STATE field. */
#define COMP_BGREADY_STATE_Msk (0x1UL << COMP_BGREADY_STATE_Pos) /*!< Bit mask of STATE field. */
#define COMP_BGREADY_STATE_NotReady (0UL) /*!< Module is not ready */
#define COMP_BGREADY_STATE_Ready (1UL) /*!< Module is ready */

/* Register: COMP_ENABLE */
/* Description: COMP enable */

/* Bits 1..0 : Enable or disable COMP */
#define COMP_ENABLE_ENABLE_Pos (0UL) /*!< Position of ENABLE field. */
#define COMP_ENABLE_ENABLE_Msk (0x3UL << COMP_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field. */
#define COMP_ENABLE_ENABLE_Disabled (0UL) /*!< Disable */
#define COMP_ENABLE_ENABLE_Enabled (2UL) /*!< Enable */

/* Register: COMP_PSEL */
/* Description: Pin select */

/* Bits 2..0 : Analog pin select */
#define COMP_PSEL_PSEL_Pos (0UL) /*!< Position of PSEL field. */
#define COMP_PSEL_PSEL_Msk (0x7UL << COMP_PSEL_PSEL_Pos) /*!< Bit mask of PSEL field. */
#define COMP_PSEL_PSEL_AnalogInput0 (0UL) /*!< AIN0 selected as analog input */
#define COMP_PSEL_PSEL_AnalogInput1 (1UL) /*!< AIN1 selected as analog input */
#define COMP_PSEL_PSEL_AnalogInput2 (2UL) /*!< AIN2 selected as analog input */
#define COMP_PSEL_PSEL_AnalogInput3 (3UL) /*!< AIN3 selected as analog input */
#define COMP_PSEL_PSEL_AnalogInput4 (4UL) /*!< AIN4 selected as analog input */
#define COMP_PSEL_PSEL_AnalogInput5 (5UL) /*!< AIN5 selected as analog input */
#define COMP_PSEL_PSEL_AnalogInput6 (6UL) /*!< AIN6 selected as analog input */
#define COMP_PSEL_PSEL_AnalogInput7 (7UL) /*!< AIN7 selected as analog input */

/* Register: COMP_REFSEL */
/* Description: Reference source select for single-ended mode */

/* Bits 2..0 : Reference select */
#define COMP_REFSEL_REFSEL_Pos (0UL) /*!< Position of REFSEL field. */
#define COMP_REFSEL_REFSEL_Msk (0x7UL << COMP_REFSEL_REFSEL_Pos) /*!< Bit mask of REFSEL field. */
#define COMP_REFSEL_REFSEL_Int1V2 (0UL) /*!< VREF = internal 1.2 V reference (AVDD_AO_1V8 &gt;= 1.7 V) */
#define COMP_REFSEL_REFSEL_Int1V8 (1UL) /*!< VREF = internal 1.8 V reference (VDD &gt;= VREF + 0.2 V) */
#define COMP_REFSEL_REFSEL_Int2V4 (2UL) /*!< VREF = internal 2.4 V reference (VDD &gt;= VREF + 0.2 V) */
#define COMP_REFSEL_REFSEL_AVDD_AO_1V8 (4UL) /*!< VREF = AVDD_AO_1V8 */
#define COMP_REFSEL_REFSEL_ARef (5UL) /*!< VREF = AREF */
#define COMP_REFSEL_REFSEL_Diff (7UL) /*!< VREF=Differential mode (power down built-in reference and disconnect resistor ladder) */

/* Register: COMP_EXTREFSEL */
/* Description: External reference select */

/* Bits 2..0 : External analog reference select */
#define COMP_EXTREFSEL_EXTREFSEL_Pos (0UL) /*!< Position of EXTREFSEL field. */
#define COMP_EXTREFSEL_EXTREFSEL_Msk (0x7UL << COMP_EXTREFSEL_EXTREFSEL_Pos) /*!< Bit mask of EXTREFSEL field. */
#define COMP_EXTREFSEL_EXTREFSEL_AnalogReference0 (0UL) /*!< Use AIN0 as external analog reference */
#define COMP_EXTREFSEL_EXTREFSEL_AnalogReference1 (1UL) /*!< Use AIN1 as external analog reference */
#define COMP_EXTREFSEL_EXTREFSEL_AnalogReference2 (2UL) /*!< Use AIN2 as external analog reference */
#define COMP_EXTREFSEL_EXTREFSEL_AnalogReference3 (3UL) /*!< Use AIN3 as external analog reference */
#define COMP_EXTREFSEL_EXTREFSEL_AnalogReference4 (4UL) /*!< Use AIN4 as external analog reference */
#define COMP_EXTREFSEL_EXTREFSEL_AnalogReference5 (5UL) /*!< Use AIN5 as external analog reference */
#define COMP_EXTREFSEL_EXTREFSEL_AnalogReference6 (6UL) /*!< Use AIN6 as external analog reference */
#define COMP_EXTREFSEL_EXTREFSEL_AnalogReference7 (7UL) /*!< Use AIN7 as external analog reference */

/* Register: COMP_REFTEMPC */
/* Description: Trim for temperature coefficient */

/* Bits 3..0 : Trim for temperature coefficient in 2's complement. Used to compensate between simulation and measurement */
#define COMP_REFTEMPC_REFTEMPC_Pos (0UL) /*!< Position of REFTEMPC field. */
#define COMP_REFTEMPC_REFTEMPC_Msk (0xFUL << COMP_REFTEMPC_REFTEMPC_Pos) /*!< Bit mask of REFTEMPC field. */

/* Register: COMP_BUFFER */
/* Description: Enable unity gain buffer */

/* Bit 0 : Enable unity gain buffer */
#define COMP_BUFFER_BUFFER_Pos (0UL) /*!< Position of BUFFER field. */
#define COMP_BUFFER_BUFFER_Msk (0x1UL << COMP_BUFFER_BUFFER_Pos) /*!< Bit mask of BUFFER field. */
#define COMP_BUFFER_BUFFER_Disable (0UL) /*!< VOUT is high impedance */
#define COMP_BUFFER_BUFFER_Enable (1UL) /*!< VOUT equals VIN */

/* Register: COMP_CTRL */
/* Description: Spare signals */

/* Bits 1..0 : Spare signals */
#define COMP_CTRL_CTRL_Pos (0UL) /*!< Position of CTRL field. */
#define COMP_CTRL_CTRL_Msk (0x3UL << COMP_CTRL_CTRL_Pos) /*!< Bit mask of CTRL field. */

/* Register: COMP_MUTESEL */
/* Description: Disconnect PSEL/EXTREFSEL */

/* Bit 1 : Disconnect EXTREFSEL even when COMP is powered */
#define COMP_MUTESEL_MUTEEXTREFSEL_Pos (1UL) /*!< Position of MUTEEXTREFSEL field. */
#define COMP_MUTESEL_MUTEEXTREFSEL_Msk (0x1UL << COMP_MUTESEL_MUTEEXTREFSEL_Pos) /*!< Bit mask of MUTEEXTREFSEL field. */
#define COMP_MUTESEL_MUTEEXTREFSEL_Default (0UL) /*!< EXTREFSEL is connected */
#define COMP_MUTESEL_MUTEEXTREFSEL_Disconnect (1UL) /*!< Disconnect EXTREFSEL */

/* Bit 0 : Disconnect PSEL even when COMP is powered */
#define COMP_MUTESEL_MUTEPSEL_Pos (0UL) /*!< Position of MUTEPSEL field. */
#define COMP_MUTESEL_MUTEPSEL_Msk (0x1UL << COMP_MUTESEL_MUTEPSEL_Pos) /*!< Bit mask of MUTEPSEL field. */
#define COMP_MUTESEL_MUTEPSEL_Default (0UL) /*!< PSEL is connected */
#define COMP_MUTESEL_MUTEPSEL_Disconnect (1UL) /*!< Disconnect PSEL */

/* Register: COMP_RETAIN */
/* Description: Retain signal */

/* Bit 0 : Retain signal */
#define COMP_RETAIN_RETAIN_Pos (0UL) /*!< Position of RETAIN field. */
#define COMP_RETAIN_RETAIN_Msk (0x1UL << COMP_RETAIN_RETAIN_Pos) /*!< Bit mask of RETAIN field. */
#define COMP_RETAIN_RETAIN_Disable (0UL) /*!< No retain */
#define COMP_RETAIN_RETAIN_Enable (1UL) /*!< Retain is active */

