adamkondraciuk/nrfx/mdk/nrf54lilium_network_bitfields.h
/* Register: ECB_EVENTS_ERRORECB */
/* Description: ECB block encrypt aborted because of a STOPECB task or due to an error */

/* Bit 0 : ECB block encrypt aborted because of a STOPECB task or due to an error */
#define ECB_EVENTS_ERRORECB_EVENTS_ERRORECB_Pos (0UL) /*!< Position of EVENTS_ERRORECB field. */
#define ECB_EVENTS_ERRORECB_EVENTS_ERRORECB_Msk (0x1UL << ECB_EVENTS_ERRORECB_EVENTS_ERRORECB_Pos) /*!< Bit mask of EVENTS_ERRORECB field. */
#define ECB_EVENTS_ERRORECB_EVENTS_ERRORECB_NotGenerated (0UL) /*!< Event not generated */
#define ECB_EVENTS_ERRORECB_EVENTS_ERRORECB_Generated (1UL) /*!< Event generated */

/* Register: ECB_PUBLISH_ENDCONFIG */
/* Description: Publish configuration for event ENDCONFIG */

/* Bit 31 :   */
#define ECB_PUBLISH_ENDCONFIG_EN_Pos (31UL) /*!< Position of EN field. */
#define ECB_PUBLISH_ENDCONFIG_EN_Msk (0x1UL << ECB_PUBLISH_ENDCONFIG_EN_Pos) /*!< Bit mask of EN field. */
#define ECB_PUBLISH_ENDCONFIG_EN_Disabled (0UL) /*!< Disable publishing */
#define ECB_PUBLISH_ENDCONFIG_EN_Enabled (1UL) /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event ENDCONFIG will publish to. */
#define ECB_PUBLISH_ENDCONFIG_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define ECB_PUBLISH_ENDCONFIG_CHIDX_Msk (0xFFUL << ECB_PUBLISH_ENDCONFIG_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: ECB_PUBLISH_ENDECB */
/* Description: Publish configuration for event ENDECB */

/* Bit 31 :   */
#define ECB_PUBLISH_ENDECB_EN_Pos (31UL) /*!< Position of EN field. */
#define ECB_PUBLISH_ENDECB_EN_Msk (0x1UL << ECB_PUBLISH_ENDECB_EN_Pos) /*!< Bit mask of EN field. */
#define ECB_PUBLISH_ENDECB_EN_Disabled (0UL) /*!< Disable publishing */
#define ECB_PUBLISH_ENDECB_EN_Enabled (1UL) /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event ENDECB will publish to. */
#define ECB_PUBLISH_ENDECB_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define ECB_PUBLISH_ENDECB_CHIDX_Msk (0xFFUL << ECB_PUBLISH_ENDECB_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: ECB_PUBLISH_ERRORECB */
/* Description: Publish configuration for event ERRORECB */

/* Bit 31 :   */
#define ECB_PUBLISH_ERRORECB_EN_Pos (31UL) /*!< Position of EN field. */
#define ECB_PUBLISH_ERRORECB_EN_Msk (0x1UL << ECB_PUBLISH_ERRORECB_EN_Pos) /*!< Bit mask of EN field. */
#define ECB_PUBLISH_ERRORECB_EN_Disabled (0UL) /*!< Disable publishing */
#define ECB_PUBLISH_ERRORECB_EN_Enabled (1UL) /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event ERRORECB will publish to. */
#define ECB_PUBLISH_ERRORECB_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define ECB_PUBLISH_ERRORECB_CHIDX_Msk (0xFFUL << ECB_PUBLISH_ERRORECB_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: ECB_INTENSET */
/* Description: Enable interrupt */

/* Bit 2 : Write '1' to enable interrupt for event ERRORECB */
#define ECB_INTENSET_ERRORECB_Pos (2UL) /*!< Position of ERRORECB field. */
#define ECB_INTENSET_ERRORECB_Msk (0x1UL << ECB_INTENSET_ERRORECB_Pos) /*!< Bit mask of ERRORECB field. */
#define ECB_INTENSET_ERRORECB_Disabled (0UL) /*!< Read: Disabled */
#define ECB_INTENSET_ERRORECB_Enabled (1UL) /*!< Read: Enabled */
#define ECB_INTENSET_ERRORECB_Set (1UL) /*!< Enable */

/* Bit 1 : Write '1' to enable interrupt for event ENDECB */
#define ECB_INTENSET_ENDECB_Pos (1UL) /*!< Position of ENDECB field. */
#define ECB_INTENSET_ENDECB_Msk (0x1UL << ECB_INTENSET_ENDECB_Pos) /*!< Bit mask of ENDECB field. */
#define ECB_INTENSET_ENDECB_Disabled (0UL) /*!< Read: Disabled */
#define ECB_INTENSET_ENDECB_Enabled (1UL) /*!< Read: Enabled */
#define ECB_INTENSET_ENDECB_Set (1UL) /*!< Enable */

/* Bit 0 : Write '1' to enable interrupt for event ENDCONFIG */
#define ECB_INTENSET_ENDCONFIG_Pos (0UL) /*!< Position of ENDCONFIG field. */
#define ECB_INTENSET_ENDCONFIG_Msk (0x1UL << ECB_INTENSET_ENDCONFIG_Pos) /*!< Bit mask of ENDCONFIG field. */
#define ECB_INTENSET_ENDCONFIG_Disabled (0UL) /*!< Read: Disabled */
#define ECB_INTENSET_ENDCONFIG_Enabled (1UL) /*!< Read: Enabled */
#define ECB_INTENSET_ENDCONFIG_Set (1UL) /*!< Enable */

/* Register: ECB_INTENCLR */
/* Description: Disable interrupt */

/* Bit 2 : Write '1' to disable interrupt for event ERRORECB */
#define ECB_INTENCLR_ERRORECB_Pos (2UL) /*!< Position of ERRORECB field. */
#define ECB_INTENCLR_ERRORECB_Msk (0x1UL << ECB_INTENCLR_ERRORECB_Pos) /*!< Bit mask of ERRORECB field. */
#define ECB_INTENCLR_ERRORECB_Disabled (0UL) /*!< Read: Disabled */
#define ECB_INTENCLR_ERRORECB_Enabled (1UL) /*!< Read: Enabled */
#define ECB_INTENCLR_ERRORECB_Clear (1UL) /*!< Disable */

/* Bit 1 : Write '1' to disable interrupt for event ENDECB */
#define ECB_INTENCLR_ENDECB_Pos (1UL) /*!< Position of ENDECB field. */
#define ECB_INTENCLR_ENDECB_Msk (0x1UL << ECB_INTENCLR_ENDECB_Pos) /*!< Bit mask of ENDECB field. */
#define ECB_INTENCLR_ENDECB_Disabled (0UL) /*!< Read: Disabled */
#define ECB_INTENCLR_ENDECB_Enabled (1UL) /*!< Read: Enabled */
#define ECB_INTENCLR_ENDECB_Clear (1UL) /*!< Disable */

/* Bit 0 : Write '1' to disable interrupt for event ENDCONFIG */
#define ECB_INTENCLR_ENDCONFIG_Pos (0UL) /*!< Position of ENDCONFIG field. */
#define ECB_INTENCLR_ENDCONFIG_Msk (0x1UL << ECB_INTENCLR_ENDCONFIG_Pos) /*!< Bit mask of ENDCONFIG field. */
#define ECB_INTENCLR_ENDCONFIG_Disabled (0UL) /*!< Read: Disabled */
#define ECB_INTENCLR_ENDCONFIG_Enabled (1UL) /*!< Read: Enabled */
#define ECB_INTENCLR_ENDCONFIG_Clear (1UL) /*!< Disable */

/* Register: ECB_KEY_VALUE */
/* Description: Description collection: 128-bit AES key */

/* Bits 31..0 : AES 128-bit key value, bits (32*(i+1))-1 : (32*i) */
#define ECB_KEY_VALUE_VALUE_Pos (0UL) /*!< Position of VALUE field. */
#define ECB_KEY_VALUE_VALUE_Msk (0xFFFFFFFFUL << ECB_KEY_VALUE_VALUE_Pos) /*!< Bit mask of VALUE field. */

/* Register: ECB_INPTR */
/* Description: ECB input pointer */

/* Bits 31..0 : Points to a job list containing unencrypted ECB data structure */
#define ECB_INPTR_INPTR_Pos (0UL) /*!< Position of INPTR field. */
#define ECB_INPTR_INPTR_Msk (0xFFFFFFFFUL << ECB_INPTR_INPTR_Pos) /*!< Bit mask of INPTR field. */

