adamkondraciuk/nrfx/mdk/nrf54lilium_network_bitfields.h
/* Register: ECB_INPTRAMOUNT */
/* Description: Number of bytes read from the input data, not including the job list structure */

/* Bits 31..0 : Number of bytes read from the input data */
#define ECB_INPTRAMOUNT_INPTRAMOUNT_Pos (0UL) /*!< Position of INPTRAMOUNT field. */
#define ECB_INPTRAMOUNT_INPTRAMOUNT_Msk (0xFFFFFFFFUL << ECB_INPTRAMOUNT_INPTRAMOUNT_Pos) /*!< Bit mask of INPTRAMOUNT field. */

/* Register: ECB_OUTPTR */
/* Description: Output pointer Points to a job list containing encrypted ECB data structure */

/* Bits 31..0 : Output pointer */
#define ECB_OUTPTR_OUTPTR_Pos (0UL) /*!< Position of OUTPTR field. */
#define ECB_OUTPTR_OUTPTR_Msk (0xFFFFFFFFUL << ECB_OUTPTR_OUTPTR_Pos) /*!< Bit mask of OUTPTR field. */

/* Register: ECB_OUTPTRAMOUNT */
/* Description: Number of bytes available in the output data, not including the job list structure */

/* Bits 31..0 : Number of bytes available in the output data */
#define ECB_OUTPTRAMOUNT_OUTPTRAMOUNT_Pos (0UL) /*!< Position of OUTPTRAMOUNT field. */
#define ECB_OUTPTRAMOUNT_OUTPTRAMOUNT_Msk (0xFFFFFFFFUL << ECB_OUTPTRAMOUNT_OUTPTRAMOUNT_Pos) /*!< Bit mask of OUTPTRAMOUNT field. */


/* Peripheral: GPIOSTATIC */
/* Description: GPIO Static */

/* Register: GPIOSTATIC_LATCHCLRWAITCNT */
/* Description: Select the number of wait cycles inserted on the bus when a LATCH register is cleared. Note: this register is only accessible from secure code. */

/* Bits 1..0 : Select the number of wait cycles inserted on the bus when a LATCH register is cleared. */
#define GPIOSTATIC_LATCHCLRWAITCNT_LATCHCLRWAITCNT_Pos (0UL) /*!< Position of LATCHCLRWAITCNT field. */
#define GPIOSTATIC_LATCHCLRWAITCNT_LATCHCLRWAITCNT_Msk (0x3UL << GPIOSTATIC_LATCHCLRWAITCNT_LATCHCLRWAITCNT_Pos) /*!< Bit mask of LATCHCLRWAITCNT field. */

/* Register: GPIOSTATIC_FORCELDETECTLOWCNT */
/* Description: Select the number of cycles that LDETECT is forced low after clearing a LATCH register. Note: this register is only accessible from secure code. */

/* Bits 3..0 : Select the number of cycles that LDETECT is forced low after clearing a LATCH register. */
#define GPIOSTATIC_FORCELDETECTLOWCNT_FORCELDETECTLOWCNT_Pos (0UL) /*!< Position of FORCELDETECTLOWCNT field. */
#define GPIOSTATIC_FORCELDETECTLOWCNT_FORCELDETECTLOWCNT_Msk (0xFUL << GPIOSTATIC_FORCELDETECTLOWCNT_FORCELDETECTLOWCNT_Pos) /*!< Bit mask of FORCELDETECTLOWCNT field. */

/* Register: GPIOSTATIC_RESET */
/* Description: Reset all GPIO registers. Note: this register is only accessible from secure code. */

/* Bit 0 : Reset all GPIO registers. */
#define GPIOSTATIC_RESET_RESET_Pos (0UL) /*!< Position of RESET field. */
#define GPIOSTATIC_RESET_RESET_Msk (0x1UL << GPIOSTATIC_RESET_RESET_Pos) /*!< Bit mask of RESET field. */
#define GPIOSTATIC_RESET_RESET_NA (0x0UL) /*!< No effect */
#define GPIOSTATIC_RESET_RESET_RESET (0x1UL) /*!< Trigger reset */

/* Register: GPIOSTATIC_SENSECONFIGCHANGECNT */
/* Description: Selects the number of cycles before the SENSE configuration takes effect when it is changed. Setting this register lower than the reset value can lead to unwanted LATCH set
        when SENSE and INPUT fields (PIN_CNF) are changed simultaneously. Note: this register is only accessible from secure code. */

/* Bits 2..0 : Selects the number of cycles before the SENSE configuration takes effect when it is changed. */
#define GPIOSTATIC_SENSECONFIGCHANGECNT_SENSECONFIGCHANGECNT_Pos (0UL) /*!< Position of SENSECONFIGCHANGECNT field. */
#define GPIOSTATIC_SENSECONFIGCHANGECNT_SENSECONFIGCHANGECNT_Msk (0x7UL << GPIOSTATIC_SENSECONFIGCHANGECNT_SENSECONFIGCHANGECNT_Pos) /*!< Bit mask of SENSECONFIGCHANGECNT field. */


/* Peripheral: GPIO */
/* Description: GPIO Port */

/* Register: GPIO_OUT */
/* Description: Write GPIO port */

/* Bit 31 : Pin 31 */
#define GPIO_OUT_PIN31_Pos (31UL) /*!< Position of PIN31 field. */
#define GPIO_OUT_PIN31_Msk (0x1UL << GPIO_OUT_PIN31_Pos) /*!< Bit mask of PIN31 field. */
#define GPIO_OUT_PIN31_Low (0UL) /*!< Pin driver is low */
#define GPIO_OUT_PIN31_High (1UL) /*!< Pin driver is high */

/* Bit 30 : Pin 30 */
#define GPIO_OUT_PIN30_Pos (30UL) /*!< Position of PIN30 field. */
#define GPIO_OUT_PIN30_Msk (0x1UL << GPIO_OUT_PIN30_Pos) /*!< Bit mask of PIN30 field. */
#define GPIO_OUT_PIN30_Low (0UL) /*!< Pin driver is low */
#define GPIO_OUT_PIN30_High (1UL) /*!< Pin driver is high */

/* Bit 29 : Pin 29 */
#define GPIO_OUT_PIN29_Pos (29UL) /*!< Position of PIN29 field. */
#define GPIO_OUT_PIN29_Msk (0x1UL << GPIO_OUT_PIN29_Pos) /*!< Bit mask of PIN29 field. */
#define GPIO_OUT_PIN29_Low (0UL) /*!< Pin driver is low */
#define GPIO_OUT_PIN29_High (1UL) /*!< Pin driver is high */

/* Bit 28 : Pin 28 */
#define GPIO_OUT_PIN28_Pos (28UL) /*!< Position of PIN28 field. */
#define GPIO_OUT_PIN28_Msk (0x1UL << GPIO_OUT_PIN28_Pos) /*!< Bit mask of PIN28 field. */
#define GPIO_OUT_PIN28_Low (0UL) /*!< Pin driver is low */
#define GPIO_OUT_PIN28_High (1UL) /*!< Pin driver is high */

/* Bit 27 : Pin 27 */
#define GPIO_OUT_PIN27_Pos (27UL) /*!< Position of PIN27 field. */
#define GPIO_OUT_PIN27_Msk (0x1UL << GPIO_OUT_PIN27_Pos) /*!< Bit mask of PIN27 field. */
#define GPIO_OUT_PIN27_Low (0UL) /*!< Pin driver is low */
#define GPIO_OUT_PIN27_High (1UL) /*!< Pin driver is high */

/* Bit 26 : Pin 26 */
#define GPIO_OUT_PIN26_Pos (26UL) /*!< Position of PIN26 field. */
#define GPIO_OUT_PIN26_Msk (0x1UL << GPIO_OUT_PIN26_Pos) /*!< Bit mask of PIN26 field. */
#define GPIO_OUT_PIN26_Low (0UL) /*!< Pin driver is low */
#define GPIO_OUT_PIN26_High (1UL) /*!< Pin driver is high */

/* Bit 25 : Pin 25 */
#define GPIO_OUT_PIN25_Pos (25UL) /*!< Position of PIN25 field. */
#define GPIO_OUT_PIN25_Msk (0x1UL << GPIO_OUT_PIN25_Pos) /*!< Bit mask of PIN25 field. */
#define GPIO_OUT_PIN25_Low (0UL) /*!< Pin driver is low */
#define GPIO_OUT_PIN25_High (1UL) /*!< Pin driver is high */

/* Bit 24 : Pin 24 */
#define GPIO_OUT_PIN24_Pos (24UL) /*!< Position of PIN24 field. */
#define GPIO_OUT_PIN24_Msk (0x1UL << GPIO_OUT_PIN24_Pos) /*!< Bit mask of PIN24 field. */
#define GPIO_OUT_PIN24_Low (0UL) /*!< Pin driver is low */
#define GPIO_OUT_PIN24_High (1UL) /*!< Pin driver is high */

