adamkondraciuk/nrfx/mdk/nrf54lilium_network_bitfields.h
/* Register: RADIO_TASKS_ACQINJ0DMASTART */
/* Description: Start DMA transaction */

/* Bit 0 : Start DMA transaction */
#define RADIO_TASKS_ACQINJ0DMASTART_TASKS_ACQINJ0DMASTART_Pos (0UL) /*!< Position of TASKS_ACQINJ0DMASTART field. */
#define RADIO_TASKS_ACQINJ0DMASTART_TASKS_ACQINJ0DMASTART_Msk (0x1UL << RADIO_TASKS_ACQINJ0DMASTART_TASKS_ACQINJ0DMASTART_Pos) /*!< Bit mask of TASKS_ACQINJ0DMASTART field. */
#define RADIO_TASKS_ACQINJ0DMASTART_TASKS_ACQINJ0DMASTART_Trigger (1UL) /*!< Trigger task */

/* Register: RADIO_TASKS_ACQINJ0DMASTOP */
/* Description: Stop ongoing DMA transaction */

/* Bit 0 : Stop ongoing DMA transaction */
#define RADIO_TASKS_ACQINJ0DMASTOP_TASKS_ACQINJ0DMASTOP_Pos (0UL) /*!< Position of TASKS_ACQINJ0DMASTOP field. */
#define RADIO_TASKS_ACQINJ0DMASTOP_TASKS_ACQINJ0DMASTOP_Msk (0x1UL << RADIO_TASKS_ACQINJ0DMASTOP_TASKS_ACQINJ0DMASTOP_Pos) /*!< Bit mask of TASKS_ACQINJ0DMASTOP field. */
#define RADIO_TASKS_ACQINJ0DMASTOP_TASKS_ACQINJ0DMASTOP_Trigger (1UL) /*!< Trigger task */

/* Register: RADIO_TASKS_ACQINJ1DMASTART */
/* Description: Start DMA transaction */

/* Bit 0 : Start DMA transaction */
#define RADIO_TASKS_ACQINJ1DMASTART_TASKS_ACQINJ1DMASTART_Pos (0UL) /*!< Position of TASKS_ACQINJ1DMASTART field. */
#define RADIO_TASKS_ACQINJ1DMASTART_TASKS_ACQINJ1DMASTART_Msk (0x1UL << RADIO_TASKS_ACQINJ1DMASTART_TASKS_ACQINJ1DMASTART_Pos) /*!< Bit mask of TASKS_ACQINJ1DMASTART field. */
#define RADIO_TASKS_ACQINJ1DMASTART_TASKS_ACQINJ1DMASTART_Trigger (1UL) /*!< Trigger task */

/* Register: RADIO_TASKS_ACQINJ1DMASTOP */
/* Description: Stop ongoing DMA transaction */

/* Bit 0 : Stop ongoing DMA transaction */
#define RADIO_TASKS_ACQINJ1DMASTOP_TASKS_ACQINJ1DMASTOP_Pos (0UL) /*!< Position of TASKS_ACQINJ1DMASTOP field. */
#define RADIO_TASKS_ACQINJ1DMASTOP_TASKS_ACQINJ1DMASTOP_Msk (0x1UL << RADIO_TASKS_ACQINJ1DMASTOP_TASKS_ACQINJ1DMASTOP_Pos) /*!< Bit mask of TASKS_ACQINJ1DMASTOP field. */
#define RADIO_TASKS_ACQINJ1DMASTOP_TASKS_ACQINJ1DMASTOP_Trigger (1UL) /*!< Trigger task */

/* Register: RADIO_TASKS_CNTPSTART */
/* Description: Start packet counter */

/* Bit 0 : Start packet counter */
#define RADIO_TASKS_CNTPSTART_TASKS_CNTPSTART_Pos (0UL) /*!< Position of TASKS_CNTPSTART field. */
#define RADIO_TASKS_CNTPSTART_TASKS_CNTPSTART_Msk (0x1UL << RADIO_TASKS_CNTPSTART_TASKS_CNTPSTART_Pos) /*!< Bit mask of TASKS_CNTPSTART field. */
#define RADIO_TASKS_CNTPSTART_TASKS_CNTPSTART_Trigger (1UL) /*!< Trigger task */

/* Register: RADIO_TASKS_CNTPSTOP */
/* Description: Stop packet counter */

/* Bit 0 : Stop packet counter */
#define RADIO_TASKS_CNTPSTOP_TASKS_CNTPSTOP_Pos (0UL) /*!< Position of TASKS_CNTPSTOP field. */
#define RADIO_TASKS_CNTPSTOP_TASKS_CNTPSTOP_Msk (0x1UL << RADIO_TASKS_CNTPSTOP_TASKS_CNTPSTOP_Pos) /*!< Bit mask of TASKS_CNTPSTOP field. */
#define RADIO_TASKS_CNTPSTOP_TASKS_CNTPSTOP_Trigger (1UL) /*!< Trigger task */

/* Register: RADIO_TASKS_CNTPCLEAR */
/* Description: Clear packet counter */

/* Bit 0 : Clear packet counter */
#define RADIO_TASKS_CNTPCLEAR_TASKS_CNTPCLEAR_Pos (0UL) /*!< Position of TASKS_CNTPCLEAR field. */
#define RADIO_TASKS_CNTPCLEAR_TASKS_CNTPCLEAR_Msk (0x1UL << RADIO_TASKS_CNTPCLEAR_TASKS_CNTPCLEAR_Pos) /*!< Bit mask of TASKS_CNTPCLEAR field. */
#define RADIO_TASKS_CNTPCLEAR_TASKS_CNTPCLEAR_Trigger (1UL) /*!< Trigger task */

/* Register: RADIO_TASKS_LOOPBACKEN */
/* Description: Enable RADIO in LOOPBACK mode */

/* Bit 0 : Enable RADIO in LOOPBACK mode */
#define RADIO_TASKS_LOOPBACKEN_TASKS_LOOPBACKEN_Pos (0UL) /*!< Position of TASKS_LOOPBACKEN field. */
#define RADIO_TASKS_LOOPBACKEN_TASKS_LOOPBACKEN_Msk (0x1UL << RADIO_TASKS_LOOPBACKEN_TASKS_LOOPBACKEN_Pos) /*!< Bit mask of TASKS_LOOPBACKEN field. */
#define RADIO_TASKS_LOOPBACKEN_TASKS_LOOPBACKEN_Trigger (1UL) /*!< Trigger task */

/* Register: RADIO_TASKS_CALSTART */
/* Description: Start calibration */

/* Bit 0 : Start calibration */
#define RADIO_TASKS_CALSTART_TASKS_CALSTART_Pos (0UL) /*!< Position of TASKS_CALSTART field. */
#define RADIO_TASKS_CALSTART_TASKS_CALSTART_Msk (0x1UL << RADIO_TASKS_CALSTART_TASKS_CALSTART_Pos) /*!< Bit mask of TASKS_CALSTART field. */
#define RADIO_TASKS_CALSTART_TASKS_CALSTART_Trigger (1UL) /*!< Trigger task */

/* Register: RADIO_TASKS_CALSTOP */
/* Description: Stop calibration */

/* Bit 0 : Stop calibration */
#define RADIO_TASKS_CALSTOP_TASKS_CALSTOP_Pos (0UL) /*!< Position of TASKS_CALSTOP field. */
#define RADIO_TASKS_CALSTOP_TASKS_CALSTOP_Msk (0x1UL << RADIO_TASKS_CALSTOP_TASKS_CALSTOP_Pos) /*!< Bit mask of TASKS_CALSTOP field. */
#define RADIO_TASKS_CALSTOP_TASKS_CALSTOP_Trigger (1UL) /*!< Trigger task */

/* Register: RADIO_TASKS_PATESTSTART */
/* Description: Start PA test */

/* Bit 0 : Start PA test */
#define RADIO_TASKS_PATESTSTART_TASKS_PATESTSTART_Pos (0UL) /*!< Position of TASKS_PATESTSTART field. */
#define RADIO_TASKS_PATESTSTART_TASKS_PATESTSTART_Msk (0x1UL << RADIO_TASKS_PATESTSTART_TASKS_PATESTSTART_Pos) /*!< Bit mask of TASKS_PATESTSTART field. */
#define RADIO_TASKS_PATESTSTART_TASKS_PATESTSTART_Trigger (1UL) /*!< Trigger task */

/* Register: RADIO_TASKS_PATESTSTOP */
/* Description: Stop PA test */

/* Bit 0 : Stop PA test */
#define RADIO_TASKS_PATESTSTOP_TASKS_PATESTSTOP_Pos (0UL) /*!< Position of TASKS_PATESTSTOP field. */
#define RADIO_TASKS_PATESTSTOP_TASKS_PATESTSTOP_Msk (0x1UL << RADIO_TASKS_PATESTSTOP_TASKS_PATESTSTOP_Pos) /*!< Bit mask of TASKS_PATESTSTOP field. */
#define RADIO_TASKS_PATESTSTOP_TASKS_PATESTSTOP_Trigger (1UL) /*!< Trigger task */

/* Register: RADIO_TASKS_CHNOINCR */
/* Description: Update RADIO channel based on the current channel and increment it according to chNoIncrStep */

/* Bit 0 : Update RADIO channel based on the current channel and increment it according to chNoIncrStep */
#define RADIO_TASKS_CHNOINCR_TASKS_CHNOINCR_Pos (0UL) /*!< Position of TASKS_CHNOINCR field. */
#define RADIO_TASKS_CHNOINCR_TASKS_CHNOINCR_Msk (0x1UL << RADIO_TASKS_CHNOINCR_TASKS_CHNOINCR_Pos) /*!< Bit mask of TASKS_CHNOINCR field. */
#define RADIO_TASKS_CHNOINCR_TASKS_CHNOINCR_Trigger (1UL) /*!< Trigger task */

