adamkondraciuk/nrfx/mdk/nrf54lilium_network_bitfields.h
/* Register: RADIO_TASKS_DMASTART */
/* Description: Start RADIO DMA transaction */

/* Bit 0 : Start RADIO DMA transaction */
#define RADIO_TASKS_DMASTART_TASKS_DMASTART_Pos (0UL) /*!< Position of TASKS_DMASTART field. */
#define RADIO_TASKS_DMASTART_TASKS_DMASTART_Msk (0x1UL << RADIO_TASKS_DMASTART_TASKS_DMASTART_Pos) /*!< Bit mask of TASKS_DMASTART field. */
#define RADIO_TASKS_DMASTART_TASKS_DMASTART_Trigger (1UL) /*!< Trigger task */

/* Register: RADIO_TASKS_DMASTOP */
/* Description: Stop ongoing RADIO DMA transaction */

/* Bit 0 : Stop ongoing RADIO DMA transaction */
#define RADIO_TASKS_DMASTOP_TASKS_DMASTOP_Pos (0UL) /*!< Position of TASKS_DMASTOP field. */
#define RADIO_TASKS_DMASTOP_TASKS_DMASTOP_Msk (0x1UL << RADIO_TASKS_DMASTOP_TASKS_DMASTOP_Pos) /*!< Bit mask of TASKS_DMASTOP field. */
#define RADIO_TASKS_DMASTOP_TASKS_DMASTOP_Trigger (1UL) /*!< Trigger task */

/* Register: RADIO_TASKS_DFEDMASTART */
/* Description: Start DFE DMA transaction */

/* Bit 0 : Start DFE DMA transaction */
#define RADIO_TASKS_DFEDMASTART_TASKS_DFEDMASTART_Pos (0UL) /*!< Position of TASKS_DFEDMASTART field. */
#define RADIO_TASKS_DFEDMASTART_TASKS_DFEDMASTART_Msk (0x1UL << RADIO_TASKS_DFEDMASTART_TASKS_DFEDMASTART_Pos) /*!< Bit mask of TASKS_DFEDMASTART field. */
#define RADIO_TASKS_DFEDMASTART_TASKS_DFEDMASTART_Trigger (1UL) /*!< Trigger task */

/* Register: RADIO_TASKS_DFEDMASTOP */
/* Description: Stop ongoing DFE DMA transaction */

/* Bit 0 : Stop ongoing DFE DMA transaction */
#define RADIO_TASKS_DFEDMASTOP_TASKS_DFEDMASTOP_Pos (0UL) /*!< Position of TASKS_DFEDMASTOP field. */
#define RADIO_TASKS_DFEDMASTOP_TASKS_DFEDMASTOP_Msk (0x1UL << RADIO_TASKS_DFEDMASTOP_TASKS_DFEDMASTOP_Pos) /*!< Bit mask of TASKS_DFEDMASTOP field. */
#define RADIO_TASKS_DFEDMASTOP_TASKS_DFEDMASTOP_Trigger (1UL) /*!< Trigger task */

/* Register: RADIO_TASKS_RESERVED_31 */
/* Description: UNUSED_31 */

/* Bit 0 : UNUSED_31 */
#define RADIO_TASKS_RESERVED_31_TASKS_RESERVED_31_Pos (0UL) /*!< Position of TASKS_RESERVED_31 field. */
#define RADIO_TASKS_RESERVED_31_TASKS_RESERVED_31_Msk (0x1UL << RADIO_TASKS_RESERVED_31_TASKS_RESERVED_31_Pos) /*!< Bit mask of TASKS_RESERVED_31 field. */
#define RADIO_TASKS_RESERVED_31_TASKS_RESERVED_31_Trigger (1UL) /*!< Trigger task */

/* Register: RADIO_TASKS_GETNEXTDETECT */
/* Description: Pull the last item out of the detect FIFO */

/* Bit 0 : Pull the last item out of the detect FIFO */
#define RADIO_TASKS_GETNEXTDETECT_TASKS_GETNEXTDETECT_Pos (0UL) /*!< Position of TASKS_GETNEXTDETECT field. */
#define RADIO_TASKS_GETNEXTDETECT_TASKS_GETNEXTDETECT_Msk (0x1UL << RADIO_TASKS_GETNEXTDETECT_TASKS_GETNEXTDETECT_Pos) /*!< Bit mask of TASKS_GETNEXTDETECT field. */
#define RADIO_TASKS_GETNEXTDETECT_TASKS_GETNEXTDETECT_Trigger (1UL) /*!< Trigger task */

/* Register: RADIO_TASKS_CLEARDETECTFIFO */
/* Description: Clear the detect FIFO */

/* Bit 0 : Clear the detect FIFO */
#define RADIO_TASKS_CLEARDETECTFIFO_TASKS_CLEARDETECTFIFO_Pos (0UL) /*!< Position of TASKS_CLEARDETECTFIFO field. */
#define RADIO_TASKS_CLEARDETECTFIFO_TASKS_CLEARDETECTFIFO_Msk (0x1UL << RADIO_TASKS_CLEARDETECTFIFO_TASKS_CLEARDETECTFIFO_Pos) /*!< Bit mask of TASKS_CLEARDETECTFIFO field. */
#define RADIO_TASKS_CLEARDETECTFIFO_TASKS_CLEARDETECTFIFO_Trigger (1UL) /*!< Trigger task */

/* Register: RADIO_TASKS_RESETDEMODCTRL */
/* Description: Sets all things back to original state in RxDemodCtrl */

/* Bit 0 : Sets all things back to original state in RxDemodCtrl */
#define RADIO_TASKS_RESETDEMODCTRL_TASKS_RESETDEMODCTRL_Pos (0UL) /*!< Position of TASKS_RESETDEMODCTRL field. */
#define RADIO_TASKS_RESETDEMODCTRL_TASKS_RESETDEMODCTRL_Msk (0x1UL << RADIO_TASKS_RESETDEMODCTRL_TASKS_RESETDEMODCTRL_Pos) /*!< Bit mask of TASKS_RESETDEMODCTRL field. */
#define RADIO_TASKS_RESETDEMODCTRL_TASKS_RESETDEMODCTRL_Trigger (1UL) /*!< Trigger task */

/* Register: RADIO_TASKS_DEMODCTRLSTARTTIMER */
/* Description: Start the built-in custom timer. When starting the timer, it always starts from 0 */

/* Bit 0 : Start the built-in custom timer. When starting the timer, it always starts from 0 */
#define RADIO_TASKS_DEMODCTRLSTARTTIMER_TASKS_DEMODCTRLSTARTTIMER_Pos (0UL) /*!< Position of TASKS_DEMODCTRLSTARTTIMER field. */
#define RADIO_TASKS_DEMODCTRLSTARTTIMER_TASKS_DEMODCTRLSTARTTIMER_Msk (0x1UL << RADIO_TASKS_DEMODCTRLSTARTTIMER_TASKS_DEMODCTRLSTARTTIMER_Pos) /*!< Bit mask of TASKS_DEMODCTRLSTARTTIMER field. */
#define RADIO_TASKS_DEMODCTRLSTARTTIMER_TASKS_DEMODCTRLSTARTTIMER_Trigger (1UL) /*!< Trigger task */

/* Register: RADIO_TASKS_DEMODCTRLSTOPTIMER */
/* Description: Stop the built-in custom timer. When stopping the timer, it is always cleared afterwards */

/* Bit 0 : Stop the built-in custom timer. When stopping the timer, it is always cleared afterwards */
#define RADIO_TASKS_DEMODCTRLSTOPTIMER_TASKS_DEMODCTRLSTOPTIMER_Pos (0UL) /*!< Position of TASKS_DEMODCTRLSTOPTIMER field. */
#define RADIO_TASKS_DEMODCTRLSTOPTIMER_TASKS_DEMODCTRLSTOPTIMER_Msk (0x1UL << RADIO_TASKS_DEMODCTRLSTOPTIMER_TASKS_DEMODCTRLSTOPTIMER_Pos) /*!< Bit mask of TASKS_DEMODCTRLSTOPTIMER field. */
#define RADIO_TASKS_DEMODCTRLSTOPTIMER_TASKS_DEMODCTRLSTOPTIMER_Trigger (1UL) /*!< Trigger task */

/* Register: RADIO_TASKS_DEMODCTRLCONDEN0 */
/* Description: Enable condition 0. After this task has been triggered, the condition will trigger exactly once */

/* Bit 0 : Enable condition 0. After this task has been triggered, the condition will trigger exactly once */
#define RADIO_TASKS_DEMODCTRLCONDEN0_TASKS_DEMODCTRLCONDEN0_Pos (0UL) /*!< Position of TASKS_DEMODCTRLCONDEN0 field. */
#define RADIO_TASKS_DEMODCTRLCONDEN0_TASKS_DEMODCTRLCONDEN0_Msk (0x1UL << RADIO_TASKS_DEMODCTRLCONDEN0_TASKS_DEMODCTRLCONDEN0_Pos) /*!< Bit mask of TASKS_DEMODCTRLCONDEN0 field. */
#define RADIO_TASKS_DEMODCTRLCONDEN0_TASKS_DEMODCTRLCONDEN0_Trigger (1UL) /*!< Trigger task */

/* Register: RADIO_TASKS_DEMODCTRLCONDEN1 */
/* Description: Enable condition 1. After this task has been triggered, the condition will trigger exactly once */

/* Bit 0 : Enable condition 1. After this task has been triggered, the condition will trigger exactly once */
#define RADIO_TASKS_DEMODCTRLCONDEN1_TASKS_DEMODCTRLCONDEN1_Pos (0UL) /*!< Position of TASKS_DEMODCTRLCONDEN1 field. */
#define RADIO_TASKS_DEMODCTRLCONDEN1_TASKS_DEMODCTRLCONDEN1_Msk (0x1UL << RADIO_TASKS_DEMODCTRLCONDEN1_TASKS_DEMODCTRLCONDEN1_Pos) /*!< Bit mask of TASKS_DEMODCTRLCONDEN1 field. */
#define RADIO_TASKS_DEMODCTRLCONDEN1_TASKS_DEMODCTRLCONDEN1_Trigger (1UL) /*!< Trigger task */

/* Register: RADIO_TASKS_DEMODCTRLCONDEN2 */
/* Description: Enable condition 2. After this task has been triggered, the condition will trigger exactly once */

/* Bit 0 : Enable condition 2. After this task has been triggered, the condition will trigger exactly once */
#define RADIO_TASKS_DEMODCTRLCONDEN2_TASKS_DEMODCTRLCONDEN2_Pos (0UL) /*!< Position of TASKS_DEMODCTRLCONDEN2 field. */
#define RADIO_TASKS_DEMODCTRLCONDEN2_TASKS_DEMODCTRLCONDEN2_Msk (0x1UL << RADIO_TASKS_DEMODCTRLCONDEN2_TASKS_DEMODCTRLCONDEN2_Pos) /*!< Bit mask of TASKS_DEMODCTRLCONDEN2 field. */
#define RADIO_TASKS_DEMODCTRLCONDEN2_TASKS_DEMODCTRLCONDEN2_Trigger (1UL) /*!< Trigger task */

/* Register: RADIO_EVENTS_READY */
/* Description: RADIO has ramped up and is ready to be started */

/* Bit 0 : RADIO has ramped up and is ready to be started */
#define RADIO_EVENTS_READY_EVENTS_READY_Pos (0UL) /*!< Position of EVENTS_READY field. */
#define RADIO_EVENTS_READY_EVENTS_READY_Msk (0x1UL << RADIO_EVENTS_READY_EVENTS_READY_Pos) /*!< Bit mask of EVENTS_READY field. */
#define RADIO_EVENTS_READY_EVENTS_READY_NotGenerated (0UL) /*!< Event not generated */
#define RADIO_EVENTS_READY_EVENTS_READY_Generated (1UL) /*!< Event generated */

