adamkondraciuk/nrfx/mdk/nrf54lilium_network_bitfields.h
/* Register: RADIO_EVENTS_CTEWARNING */
/* Description: CTEInfo byte received, but contain illegal CTETime or CTEType. */

/* Bit 0 : CTEInfo byte received, but contain illegal CTETime or CTEType. */
#define RADIO_EVENTS_CTEWARNING_EVENTS_CTEWARNING_Pos (0UL) /*!< Position of EVENTS_CTEWARNING field. */
#define RADIO_EVENTS_CTEWARNING_EVENTS_CTEWARNING_Msk (0x1UL << RADIO_EVENTS_CTEWARNING_EVENTS_CTEWARNING_Pos) /*!< Bit mask of EVENTS_CTEWARNING field. */
#define RADIO_EVENTS_CTEWARNING_EVENTS_CTEWARNING_NotGenerated (0UL) /*!< Event not generated */
#define RADIO_EVENTS_CTEWARNING_EVENTS_CTEWARNING_Generated (1UL) /*!< Event generated */

/* Register: RADIO_EVENTS_DFEEND */
/* Description: DFE operation has ended */

/* Bit 0 : DFE operation has ended */
#define RADIO_EVENTS_DFEEND_EVENTS_DFEEND_Pos (0UL) /*!< Position of EVENTS_DFEEND field. */
#define RADIO_EVENTS_DFEEND_EVENTS_DFEEND_Msk (0x1UL << RADIO_EVENTS_DFEEND_EVENTS_DFEEND_Pos) /*!< Bit mask of EVENTS_DFEEND field. */
#define RADIO_EVENTS_DFEEND_EVENTS_DFEEND_NotGenerated (0UL) /*!< Event not generated */
#define RADIO_EVENTS_DFEEND_EVENTS_DFEEND_Generated (1UL) /*!< Event generated */

/* Register: RADIO_EVENTS_MODEWRITTEN */
/* Description: Generated on write access to MODE register */

/* Bit 0 : Generated on write access to MODE register */
#define RADIO_EVENTS_MODEWRITTEN_EVENTS_MODEWRITTEN_Pos (0UL) /*!< Position of EVENTS_MODEWRITTEN field. */
#define RADIO_EVENTS_MODEWRITTEN_EVENTS_MODEWRITTEN_Msk (0x1UL << RADIO_EVENTS_MODEWRITTEN_EVENTS_MODEWRITTEN_Pos) /*!< Bit mask of EVENTS_MODEWRITTEN field. */
#define RADIO_EVENTS_MODEWRITTEN_EVENTS_MODEWRITTEN_NotGenerated (0UL) /*!< Event not generated */
#define RADIO_EVENTS_MODEWRITTEN_EVENTS_MODEWRITTEN_Generated (1UL) /*!< Event generated */

/* Register: RADIO_EVENTS_MODEREADY */
/* Description: Generated immediately on write access to MODE register when MODEPROGENABLE==0, otherwise only manually triggered (SELECT_EVENTS_TRIGGERS=1) */

/* Bit 0 : Generated immediately on write access to MODE register when MODEPROGENABLE==0, otherwise only manually triggered (SELECT_EVENTS_TRIGGERS=1) */
#define RADIO_EVENTS_MODEREADY_EVENTS_MODEREADY_Pos (0UL) /*!< Position of EVENTS_MODEREADY field. */
#define RADIO_EVENTS_MODEREADY_EVENTS_MODEREADY_Msk (0x1UL << RADIO_EVENTS_MODEREADY_EVENTS_MODEREADY_Pos) /*!< Bit mask of EVENTS_MODEREADY field. */
#define RADIO_EVENTS_MODEREADY_EVENTS_MODEREADY_NotGenerated (0UL) /*!< Event not generated */
#define RADIO_EVENTS_MODEREADY_EVENTS_MODEREADY_Generated (1UL) /*!< Event generated */

/* Register: RADIO_EVENTS_CTEEND */
/* Description: CTE end */

/* Bit 0 : CTE end */
#define RADIO_EVENTS_CTEEND_EVENTS_CTEEND_Pos (0UL) /*!< Position of EVENTS_CTEEND field. */
#define RADIO_EVENTS_CTEEND_EVENTS_CTEEND_Msk (0x1UL << RADIO_EVENTS_CTEEND_EVENTS_CTEEND_Pos) /*!< Bit mask of EVENTS_CTEEND field. */
#define RADIO_EVENTS_CTEEND_EVENTS_CTEEND_NotGenerated (0UL) /*!< Event not generated */
#define RADIO_EVENTS_CTEEND_EVENTS_CTEEND_Generated (1UL) /*!< Event generated */

/* Register: RADIO_EVENTS_LBREADY */
/* Description: RADIO is ready in loopback mode and is able to transmit and receive data */

/* Bit 0 : RADIO is ready in loopback mode and is able to transmit and receive data */
#define RADIO_EVENTS_LBREADY_EVENTS_LBREADY_Pos (0UL) /*!< Position of EVENTS_LBREADY field. */
#define RADIO_EVENTS_LBREADY_EVENTS_LBREADY_Msk (0x1UL << RADIO_EVENTS_LBREADY_EVENTS_LBREADY_Pos) /*!< Bit mask of EVENTS_LBREADY field. */
#define RADIO_EVENTS_LBREADY_EVENTS_LBREADY_NotGenerated (0UL) /*!< Event not generated */
#define RADIO_EVENTS_LBREADY_EVENTS_LBREADY_Generated (1UL) /*!< Event generated */

/* Register: RADIO_EVENTS_CALDONE */
/* Description: RADIO calibration is done */

/* Bit 0 : RADIO calibration is done */
#define RADIO_EVENTS_CALDONE_EVENTS_CALDONE_Pos (0UL) /*!< Position of EVENTS_CALDONE field. */
#define RADIO_EVENTS_CALDONE_EVENTS_CALDONE_Msk (0x1UL << RADIO_EVENTS_CALDONE_EVENTS_CALDONE_Pos) /*!< Bit mask of EVENTS_CALDONE field. */
#define RADIO_EVENTS_CALDONE_EVENTS_CALDONE_NotGenerated (0UL) /*!< Event not generated */
#define RADIO_EVENTS_CALDONE_EVENTS_CALDONE_Generated (1UL) /*!< Event generated */

/* Register: RADIO_EVENTS_CHNOUPDATED */
/* Description: RADIO channel no. is updated */

/* Bit 0 : RADIO channel no. is updated */
#define RADIO_EVENTS_CHNOUPDATED_EVENTS_CHNOUPDATED_Pos (0UL) /*!< Position of EVENTS_CHNOUPDATED field. */
#define RADIO_EVENTS_CHNOUPDATED_EVENTS_CHNOUPDATED_Msk (0x1UL << RADIO_EVENTS_CHNOUPDATED_EVENTS_CHNOUPDATED_Pos) /*!< Bit mask of EVENTS_CHNOUPDATED field. */
#define RADIO_EVENTS_CHNOUPDATED_EVENTS_CHNOUPDATED_NotGenerated (0UL) /*!< Event not generated */
#define RADIO_EVENTS_CHNOUPDATED_EVENTS_CHNOUPDATED_Generated (1UL) /*!< Event generated */

/* Register: RADIO_EVENTS_DBCTIMEOUT */
/* Description: DBC timeout to be able to resync */

/* Bit 0 : DBC timeout to be able to resync */
#define RADIO_EVENTS_DBCTIMEOUT_EVENTS_DBCTIMEOUT_Pos (0UL) /*!< Position of EVENTS_DBCTIMEOUT field. */
#define RADIO_EVENTS_DBCTIMEOUT_EVENTS_DBCTIMEOUT_Msk (0x1UL << RADIO_EVENTS_DBCTIMEOUT_EVENTS_DBCTIMEOUT_Pos) /*!< Bit mask of EVENTS_DBCTIMEOUT field. */
#define RADIO_EVENTS_DBCTIMEOUT_EVENTS_DBCTIMEOUT_NotGenerated (0UL) /*!< Event not generated */
#define RADIO_EVENTS_DBCTIMEOUT_EVENTS_DBCTIMEOUT_Generated (1UL) /*!< Event generated */

/* Register: RADIO_EVENTS_TXTIMERMATCH */
/* Description: Tx timer match */

/* Bit 0 : Tx timer match */
#define RADIO_EVENTS_TXTIMERMATCH_EVENTS_TXTIMERMATCH_Pos (0UL) /*!< Position of EVENTS_TXTIMERMATCH field. */
#define RADIO_EVENTS_TXTIMERMATCH_EVENTS_TXTIMERMATCH_Msk (0x1UL << RADIO_EVENTS_TXTIMERMATCH_EVENTS_TXTIMERMATCH_Pos) /*!< Bit mask of EVENTS_TXTIMERMATCH field. */
#define RADIO_EVENTS_TXTIMERMATCH_EVENTS_TXTIMERMATCH_NotGenerated (0UL) /*!< Event not generated */
#define RADIO_EVENTS_TXTIMERMATCH_EVENTS_TXTIMERMATCH_Generated (1UL) /*!< Event generated */

/* Register: RADIO_EVENTS_RXTIMERMATCH */
/* Description: Rx timer match */

/* Bit 0 : Rx timer match */
#define RADIO_EVENTS_RXTIMERMATCH_EVENTS_RXTIMERMATCH_Pos (0UL) /*!< Position of EVENTS_RXTIMERMATCH field. */
#define RADIO_EVENTS_RXTIMERMATCH_EVENTS_RXTIMERMATCH_Msk (0x1UL << RADIO_EVENTS_RXTIMERMATCH_EVENTS_RXTIMERMATCH_Pos) /*!< Bit mask of EVENTS_RXTIMERMATCH field. */
#define RADIO_EVENTS_RXTIMERMATCH_EVENTS_RXTIMERMATCH_NotGenerated (0UL) /*!< Event not generated */
#define RADIO_EVENTS_RXTIMERMATCH_EVENTS_RXTIMERMATCH_Generated (1UL) /*!< Event generated */

