adamkondraciuk/nrfx/mdk/nrf54lilium_network_bitfields.h
/* Register: RADIO_EVENTS_RESERVED_35 */
/* Description: UNUSED_35 */

/* Bit 0 : UNUSED_35 */
#define RADIO_EVENTS_RESERVED_35_EVENTS_RESERVED_35_Pos (0UL) /*!< Position of EVENTS_RESERVED_35 field. */
#define RADIO_EVENTS_RESERVED_35_EVENTS_RESERVED_35_Msk (0x1UL << RADIO_EVENTS_RESERVED_35_EVENTS_RESERVED_35_Pos) /*!< Bit mask of EVENTS_RESERVED_35 field. */
#define RADIO_EVENTS_RESERVED_35_EVENTS_RESERVED_35_NotGenerated (0UL) /*!< Event not generated */
#define RADIO_EVENTS_RESERVED_35_EVENTS_RESERVED_35_Generated (1UL) /*!< Event generated */

/* Register: RADIO_EVENTS_RXDIGEN */
/* Description: RXDIGEN was set high from the HW timing engine */

/* Bit 0 : RXDIGEN was set high from the HW timing engine */
#define RADIO_EVENTS_RXDIGEN_EVENTS_RXDIGEN_Pos (0UL) /*!< Position of EVENTS_RXDIGEN field. */
#define RADIO_EVENTS_RXDIGEN_EVENTS_RXDIGEN_Msk (0x1UL << RADIO_EVENTS_RXDIGEN_EVENTS_RXDIGEN_Pos) /*!< Bit mask of EVENTS_RXDIGEN field. */
#define RADIO_EVENTS_RXDIGEN_EVENTS_RXDIGEN_NotGenerated (0UL) /*!< Event not generated */
#define RADIO_EVENTS_RXDIGEN_EVENTS_RXDIGEN_Generated (1UL) /*!< Event generated */

/* Register: RADIO_EVENTS_RAWDETECT */
/* Description: The double correlator detected one peak */

/* Bit 0 : The double correlator detected one peak */
#define RADIO_EVENTS_RAWDETECT_EVENTS_RAWDETECT_Pos (0UL) /*!< Position of EVENTS_RAWDETECT field. */
#define RADIO_EVENTS_RAWDETECT_EVENTS_RAWDETECT_Msk (0x1UL << RADIO_EVENTS_RAWDETECT_EVENTS_RAWDETECT_Pos) /*!< Bit mask of EVENTS_RAWDETECT field. */
#define RADIO_EVENTS_RAWDETECT_EVENTS_RAWDETECT_NotGenerated (0UL) /*!< Event not generated */
#define RADIO_EVENTS_RAWDETECT_EVENTS_RAWDETECT_Generated (1UL) /*!< Event generated */

/* Register: RADIO_EVENTS_DETECTFIFOFULL */
/* Description: The detect FIFO is full. This should not happen if the FIFO is sized well enough */

/* Bit 0 : The detect FIFO is full. This should not happen if the FIFO is sized well enough */
#define RADIO_EVENTS_DETECTFIFOFULL_EVENTS_DETECTFIFOFULL_Pos (0UL) /*!< Position of EVENTS_DETECTFIFOFULL field. */
#define RADIO_EVENTS_DETECTFIFOFULL_EVENTS_DETECTFIFOFULL_Msk (0x1UL << RADIO_EVENTS_DETECTFIFOFULL_EVENTS_DETECTFIFOFULL_Pos) /*!< Bit mask of EVENTS_DETECTFIFOFULL field. */
#define RADIO_EVENTS_DETECTFIFOFULL_EVENTS_DETECTFIFOFULL_NotGenerated (0UL) /*!< Event not generated */
#define RADIO_EVENTS_DETECTFIFOFULL_EVENTS_DETECTFIFOFULL_Generated (1UL) /*!< Event generated */

/* Register: RADIO_EVENTS_TIMERWRAPS */
/* Description: Event triggering when the timer wraps around. This is useful if one wants to count longer than the HW timer allows */

/* Bit 0 : Event triggering when the timer wraps around. This is useful if one wants to count longer than the HW timer allows */
#define RADIO_EVENTS_TIMERWRAPS_EVENTS_TIMERWRAPS_Pos (0UL) /*!< Position of EVENTS_TIMERWRAPS field. */
#define RADIO_EVENTS_TIMERWRAPS_EVENTS_TIMERWRAPS_Msk (0x1UL << RADIO_EVENTS_TIMERWRAPS_EVENTS_TIMERWRAPS_Pos) /*!< Bit mask of EVENTS_TIMERWRAPS field. */
#define RADIO_EVENTS_TIMERWRAPS_EVENTS_TIMERWRAPS_NotGenerated (0UL) /*!< Event not generated */
#define RADIO_EVENTS_TIMERWRAPS_EVENTS_TIMERWRAPS_Generated (1UL) /*!< Event generated */

/* Register: RADIO_EVENTS_STROBETIMETRACKUPDATED */
/* Description: New information from the symbol time tracker. See STROBETIMESTATUS */

/* Bit 0 : New information from the symbol time tracker. See STROBETIMESTATUS */
#define RADIO_EVENTS_STROBETIMETRACKUPDATED_EVENTS_STROBETIMETRACKUPDATED_Pos (0UL) /*!< Position of EVENTS_STROBETIMETRACKUPDATED field. */
#define RADIO_EVENTS_STROBETIMETRACKUPDATED_EVENTS_STROBETIMETRACKUPDATED_Msk (0x1UL << RADIO_EVENTS_STROBETIMETRACKUPDATED_EVENTS_STROBETIMETRACKUPDATED_Pos) /*!< Bit mask of EVENTS_STROBETIMETRACKUPDATED field. */
#define RADIO_EVENTS_STROBETIMETRACKUPDATED_EVENTS_STROBETIMETRACKUPDATED_NotGenerated (0UL) /*!< Event not generated */
#define RADIO_EVENTS_STROBETIMETRACKUPDATED_EVENTS_STROBETIMETRACKUPDATED_Generated (1UL) /*!< Event generated */

/* Register: RADIO_EVENTS_DEMODCTRLCONDTRIGGERED0 */
/* Description: Condition 0 triggered and actions done */

/* Bit 0 : Condition 0 triggered and actions done */
#define RADIO_EVENTS_DEMODCTRLCONDTRIGGERED0_EVENTS_DEMODCTRLCONDTRIGGERED0_Pos (0UL) /*!< Position of EVENTS_DEMODCTRLCONDTRIGGERED0 field. */
#define RADIO_EVENTS_DEMODCTRLCONDTRIGGERED0_EVENTS_DEMODCTRLCONDTRIGGERED0_Msk (0x1UL << RADIO_EVENTS_DEMODCTRLCONDTRIGGERED0_EVENTS_DEMODCTRLCONDTRIGGERED0_Pos) /*!< Bit mask of EVENTS_DEMODCTRLCONDTRIGGERED0 field. */
#define RADIO_EVENTS_DEMODCTRLCONDTRIGGERED0_EVENTS_DEMODCTRLCONDTRIGGERED0_NotGenerated (0UL) /*!< Event not generated */
#define RADIO_EVENTS_DEMODCTRLCONDTRIGGERED0_EVENTS_DEMODCTRLCONDTRIGGERED0_Generated (1UL) /*!< Event generated */

/* Register: RADIO_EVENTS_DEMODCTRLCONDTRIGGERED1 */
/* Description: Condition 1 triggered and actions done */

/* Bit 0 : Condition 1 triggered and actions done */
#define RADIO_EVENTS_DEMODCTRLCONDTRIGGERED1_EVENTS_DEMODCTRLCONDTRIGGERED1_Pos (0UL) /*!< Position of EVENTS_DEMODCTRLCONDTRIGGERED1 field. */
#define RADIO_EVENTS_DEMODCTRLCONDTRIGGERED1_EVENTS_DEMODCTRLCONDTRIGGERED1_Msk (0x1UL << RADIO_EVENTS_DEMODCTRLCONDTRIGGERED1_EVENTS_DEMODCTRLCONDTRIGGERED1_Pos) /*!< Bit mask of EVENTS_DEMODCTRLCONDTRIGGERED1 field. */
#define RADIO_EVENTS_DEMODCTRLCONDTRIGGERED1_EVENTS_DEMODCTRLCONDTRIGGERED1_NotGenerated (0UL) /*!< Event not generated */
#define RADIO_EVENTS_DEMODCTRLCONDTRIGGERED1_EVENTS_DEMODCTRLCONDTRIGGERED1_Generated (1UL) /*!< Event generated */

/* Register: RADIO_EVENTS_DEMODCTRLCONDTRIGGERED2 */
/* Description: Condition 2 triggered and actions done */

/* Bit 0 : Condition 2 triggered and actions done */
#define RADIO_EVENTS_DEMODCTRLCONDTRIGGERED2_EVENTS_DEMODCTRLCONDTRIGGERED2_Pos (0UL) /*!< Position of EVENTS_DEMODCTRLCONDTRIGGERED2 field. */
#define RADIO_EVENTS_DEMODCTRLCONDTRIGGERED2_EVENTS_DEMODCTRLCONDTRIGGERED2_Msk (0x1UL << RADIO_EVENTS_DEMODCTRLCONDTRIGGERED2_EVENTS_DEMODCTRLCONDTRIGGERED2_Pos) /*!< Bit mask of EVENTS_DEMODCTRLCONDTRIGGERED2 field. */
#define RADIO_EVENTS_DEMODCTRLCONDTRIGGERED2_EVENTS_DEMODCTRLCONDTRIGGERED2_NotGenerated (0UL) /*!< Event not generated */
#define RADIO_EVENTS_DEMODCTRLCONDTRIGGERED2_EVENTS_DEMODCTRLCONDTRIGGERED2_Generated (1UL) /*!< Event generated */

/* Register: RADIO_EVENTS_RESERVED_44 */
/* Description: UNUSED_44 */

/* Bit 0 : UNUSED_44 */
#define RADIO_EVENTS_RESERVED_44_EVENTS_RESERVED_44_Pos (0UL) /*!< Position of EVENTS_RESERVED_44 field. */
#define RADIO_EVENTS_RESERVED_44_EVENTS_RESERVED_44_Msk (0x1UL << RADIO_EVENTS_RESERVED_44_EVENTS_RESERVED_44_Pos) /*!< Bit mask of EVENTS_RESERVED_44 field. */
#define RADIO_EVENTS_RESERVED_44_EVENTS_RESERVED_44_NotGenerated (0UL) /*!< Event not generated */
#define RADIO_EVENTS_RESERVED_44_EVENTS_RESERVED_44_Generated (1UL) /*!< Event generated */

