adamkondraciuk/nrfx/mdk/nrf54lilium_network_bitfields.h
/* Register: RADIO_EVENTS_RESERVED_45 */
/* Description: UNUSED_45 */

/* Bit 0 : UNUSED_45 */
#define RADIO_EVENTS_RESERVED_45_EVENTS_RESERVED_45_Pos (0UL) /*!< Position of EVENTS_RESERVED_45 field. */
#define RADIO_EVENTS_RESERVED_45_EVENTS_RESERVED_45_Msk (0x1UL << RADIO_EVENTS_RESERVED_45_EVENTS_RESERVED_45_Pos) /*!< Bit mask of EVENTS_RESERVED_45 field. */
#define RADIO_EVENTS_RESERVED_45_EVENTS_RESERVED_45_NotGenerated (0UL) /*!< Event not generated */
#define RADIO_EVENTS_RESERVED_45_EVENTS_RESERVED_45_Generated (1UL) /*!< Event generated */

/* Register: RADIO_EVENTS_RESERVED_46 */
/* Description: UNUSED_46 */

/* Bit 0 : UNUSED_46 */
#define RADIO_EVENTS_RESERVED_46_EVENTS_RESERVED_46_Pos (0UL) /*!< Position of EVENTS_RESERVED_46 field. */
#define RADIO_EVENTS_RESERVED_46_EVENTS_RESERVED_46_Msk (0x1UL << RADIO_EVENTS_RESERVED_46_EVENTS_RESERVED_46_Pos) /*!< Bit mask of EVENTS_RESERVED_46 field. */
#define RADIO_EVENTS_RESERVED_46_EVENTS_RESERVED_46_NotGenerated (0UL) /*!< Event not generated */
#define RADIO_EVENTS_RESERVED_46_EVENTS_RESERVED_46_Generated (1UL) /*!< Event generated */

/* Register: RADIO_EVENTS_RESERVED_47 */
/* Description: UNUSED_47 */

/* Bit 0 : UNUSED_47 */
#define RADIO_EVENTS_RESERVED_47_EVENTS_RESERVED_47_Pos (0UL) /*!< Position of EVENTS_RESERVED_47 field. */
#define RADIO_EVENTS_RESERVED_47_EVENTS_RESERVED_47_Msk (0x1UL << RADIO_EVENTS_RESERVED_47_EVENTS_RESERVED_47_Pos) /*!< Bit mask of EVENTS_RESERVED_47 field. */
#define RADIO_EVENTS_RESERVED_47_EVENTS_RESERVED_47_NotGenerated (0UL) /*!< Event not generated */
#define RADIO_EVENTS_RESERVED_47_EVENTS_RESERVED_47_Generated (1UL) /*!< Event generated */

/* Register: RADIO_EVENTS_ACQINJ0DMAEND */
/* Description: ACQ DMA end */

/* Bit 0 : ACQ DMA end */
#define RADIO_EVENTS_ACQINJ0DMAEND_EVENTS_ACQINJ0DMAEND_Pos (0UL) /*!< Position of EVENTS_ACQINJ0DMAEND field. */
#define RADIO_EVENTS_ACQINJ0DMAEND_EVENTS_ACQINJ0DMAEND_Msk (0x1UL << RADIO_EVENTS_ACQINJ0DMAEND_EVENTS_ACQINJ0DMAEND_Pos) /*!< Bit mask of EVENTS_ACQINJ0DMAEND field. */
#define RADIO_EVENTS_ACQINJ0DMAEND_EVENTS_ACQINJ0DMAEND_NotGenerated (0UL) /*!< Event not generated */
#define RADIO_EVENTS_ACQINJ0DMAEND_EVENTS_ACQINJ0DMAEND_Generated (1UL) /*!< Event generated */

/* Register: RADIO_EVENTS_ACQINJ1DMAEND */
/* Description: INJ DMA end */

/* Bit 0 : INJ DMA end */
#define RADIO_EVENTS_ACQINJ1DMAEND_EVENTS_ACQINJ1DMAEND_Pos (0UL) /*!< Position of EVENTS_ACQINJ1DMAEND field. */
#define RADIO_EVENTS_ACQINJ1DMAEND_EVENTS_ACQINJ1DMAEND_Msk (0x1UL << RADIO_EVENTS_ACQINJ1DMAEND_EVENTS_ACQINJ1DMAEND_Pos) /*!< Bit mask of EVENTS_ACQINJ1DMAEND field. */
#define RADIO_EVENTS_ACQINJ1DMAEND_EVENTS_ACQINJ1DMAEND_NotGenerated (0UL) /*!< Event not generated */
#define RADIO_EVENTS_ACQINJ1DMAEND_EVENTS_ACQINJ1DMAEND_Generated (1UL) /*!< Event generated */

/* Register: RADIO_SHORTS */
/* Description: Shortcuts between local events and tasks */

/* Bit 26 : Shortcut between event CHNOUPDATED and task LOOPBACKEN */
#define RADIO_SHORTS_CHNOUPDATED_LOOPBACKEN_Pos (26UL) /*!< Position of CHNOUPDATED_LOOPBACKEN field. */
#define RADIO_SHORTS_CHNOUPDATED_LOOPBACKEN_Msk (0x1UL << RADIO_SHORTS_CHNOUPDATED_LOOPBACKEN_Pos) /*!< Bit mask of CHNOUPDATED_LOOPBACKEN field. */
#define RADIO_SHORTS_CHNOUPDATED_LOOPBACKEN_Disabled (0UL) /*!< Disable shortcut */
#define RADIO_SHORTS_CHNOUPDATED_LOOPBACKEN_Enabled (1UL) /*!< Enable shortcut */

/* Bit 25 : Shortcut between event CHNOUPDATED and task RXEN */
#define RADIO_SHORTS_CHNOUPDATED_RXEN_Pos (25UL) /*!< Position of CHNOUPDATED_RXEN field. */
#define RADIO_SHORTS_CHNOUPDATED_RXEN_Msk (0x1UL << RADIO_SHORTS_CHNOUPDATED_RXEN_Pos) /*!< Bit mask of CHNOUPDATED_RXEN field. */
#define RADIO_SHORTS_CHNOUPDATED_RXEN_Disabled (0UL) /*!< Disable shortcut */
#define RADIO_SHORTS_CHNOUPDATED_RXEN_Enabled (1UL) /*!< Enable shortcut */

/* Bit 24 : Shortcut between event CHNOUPDATED and task TXEN */
#define RADIO_SHORTS_CHNOUPDATED_TXEN_Pos (24UL) /*!< Position of CHNOUPDATED_TXEN field. */
#define RADIO_SHORTS_CHNOUPDATED_TXEN_Msk (0x1UL << RADIO_SHORTS_CHNOUPDATED_TXEN_Pos) /*!< Bit mask of CHNOUPDATED_TXEN field. */
#define RADIO_SHORTS_CHNOUPDATED_TXEN_Disabled (0UL) /*!< Disable shortcut */
#define RADIO_SHORTS_CHNOUPDATED_TXEN_Enabled (1UL) /*!< Enable shortcut */

/* Bit 23 : Shortcut between event DISABLED and task CHNOINCR */
#define RADIO_SHORTS_DISABLED_CHNOINCR_Pos (23UL) /*!< Position of DISABLED_CHNOINCR field. */
#define RADIO_SHORTS_DISABLED_CHNOINCR_Msk (0x1UL << RADIO_SHORTS_DISABLED_CHNOINCR_Pos) /*!< Bit mask of DISABLED_CHNOINCR field. */
#define RADIO_SHORTS_DISABLED_CHNOINCR_Disabled (0UL) /*!< Disable shortcut */
#define RADIO_SHORTS_DISABLED_CHNOINCR_Enabled (1UL) /*!< Enable shortcut */

/* Bit 22 : Shortcut between event DISABLED and task LOOPBACKEN */
#define RADIO_SHORTS_DISABLED_LOOPBACKEN_Pos (22UL) /*!< Position of DISABLED_LOOPBACKEN field. */
#define RADIO_SHORTS_DISABLED_LOOPBACKEN_Msk (0x1UL << RADIO_SHORTS_DISABLED_LOOPBACKEN_Pos) /*!< Bit mask of DISABLED_LOOPBACKEN field. */
#define RADIO_SHORTS_DISABLED_LOOPBACKEN_Disabled (0UL) /*!< Disable shortcut */
#define RADIO_SHORTS_DISABLED_LOOPBACKEN_Enabled (1UL) /*!< Enable shortcut */

/* Bit 21 : Shortcut between event DFEEND and task STOP */
#define RADIO_SHORTS_DFEEND_STOP_Pos (21UL) /*!< Position of DFEEND_STOP field. */
#define RADIO_SHORTS_DFEEND_STOP_Msk (0x1UL << RADIO_SHORTS_DFEEND_STOP_Pos) /*!< Bit mask of DFEEND_STOP field. */
#define RADIO_SHORTS_DFEEND_STOP_Disabled (0UL) /*!< Disable shortcut */
#define RADIO_SHORTS_DFEEND_STOP_Enabled (1UL) /*!< Enable shortcut */

/* Bit 20 : Shortcut between event PHYEND and task START */
#define RADIO_SHORTS_PHYEND_START_Pos (20UL) /*!< Position of PHYEND_START field. */
#define RADIO_SHORTS_PHYEND_START_Msk (0x1UL << RADIO_SHORTS_PHYEND_START_Pos) /*!< Bit mask of PHYEND_START field. */
#define RADIO_SHORTS_PHYEND_START_Disabled (0UL) /*!< Disable shortcut */
#define RADIO_SHORTS_PHYEND_START_Enabled (1UL) /*!< Enable shortcut */

/* Bit 19 : Shortcut between event PHYEND and task DISABLE */
#define RADIO_SHORTS_PHYEND_DISABLE_Pos (19UL) /*!< Position of PHYEND_DISABLE field. */
#define RADIO_SHORTS_PHYEND_DISABLE_Msk (0x1UL << RADIO_SHORTS_PHYEND_DISABLE_Pos) /*!< Bit mask of PHYEND_DISABLE field. */
#define RADIO_SHORTS_PHYEND_DISABLE_Disabled (0UL) /*!< Disable shortcut */
#define RADIO_SHORTS_PHYEND_DISABLE_Enabled (1UL) /*!< Enable shortcut */

/* Bit 18 : Shortcut between event RXREADY and task START */
#define RADIO_SHORTS_RXREADY_START_Pos (18UL) /*!< Position of RXREADY_START field. */
#define RADIO_SHORTS_RXREADY_START_Msk (0x1UL << RADIO_SHORTS_RXREADY_START_Pos) /*!< Bit mask of RXREADY_START field. */
#define RADIO_SHORTS_RXREADY_START_Disabled (0UL) /*!< Disable shortcut */
#define RADIO_SHORTS_RXREADY_START_Enabled (1UL) /*!< Enable shortcut */

