adamkondraciuk/nrfx/mdk/nrf54lilium_network_bitfields.h
/* Bit 0 : Shortcut between event READY and task START */
#define RADIO_SHORTS_READY_START_Pos (0UL) /*!< Position of READY_START field. */
#define RADIO_SHORTS_READY_START_Msk (0x1UL << RADIO_SHORTS_READY_START_Pos) /*!< Bit mask of READY_START field. */
#define RADIO_SHORTS_READY_START_Disabled (0UL) /*!< Disable shortcut */
#define RADIO_SHORTS_READY_START_Enabled (1UL) /*!< Enable shortcut */

/* Register: RADIO_INTEN00 */
/* Description: Enable or disable interrupt */

/* Bits 31..0 :   */
#define RADIO_INTEN00_INTEN00_Pos (0UL) /*!< Position of INTEN00 field. */
#define RADIO_INTEN00_INTEN00_Msk (0xFFFFFFFFUL << RADIO_INTEN00_INTEN00_Pos) /*!< Bit mask of INTEN00 field. */

/* Register: RADIO_INTEN01 */
/* Description: Enable or disable interrupt */

/* Bits 17..0 :   */
#define RADIO_INTEN01_INTEN01_Pos (0UL) /*!< Position of INTEN01 field. */
#define RADIO_INTEN01_INTEN01_Msk (0x3FFFFUL << RADIO_INTEN01_INTEN01_Pos) /*!< Bit mask of INTEN01 field. */

/* Register: RADIO_INTENSET00 */
/* Description: Enable interrupt */

/* Bits 31..0 :   */
#define RADIO_INTENSET00_INTENSET00_Pos (0UL) /*!< Position of INTENSET00 field. */
#define RADIO_INTENSET00_INTENSET00_Msk (0xFFFFFFFFUL << RADIO_INTENSET00_INTENSET00_Pos) /*!< Bit mask of INTENSET00 field. */

/* Register: RADIO_INTENSET01 */
/* Description: Enable interrupt */

/* Bits 17..0 :   */
#define RADIO_INTENSET01_INTENSET01_Pos (0UL) /*!< Position of INTENSET01 field. */
#define RADIO_INTENSET01_INTENSET01_Msk (0x3FFFFUL << RADIO_INTENSET01_INTENSET01_Pos) /*!< Bit mask of INTENSET01 field. */

/* Register: RADIO_INTENCLR00 */
/* Description: Disable interrupt */

/* Bits 31..0 :   */
#define RADIO_INTENCLR00_INTENCLR00_Pos (0UL) /*!< Position of INTENCLR00 field. */
#define RADIO_INTENCLR00_INTENCLR00_Msk (0xFFFFFFFFUL << RADIO_INTENCLR00_INTENCLR00_Pos) /*!< Bit mask of INTENCLR00 field. */

/* Register: RADIO_INTENCLR01 */
/* Description: Disable interrupt */

/* Bits 17..0 :   */
#define RADIO_INTENCLR01_INTENCLR01_Pos (0UL) /*!< Position of INTENCLR01 field. */
#define RADIO_INTENCLR01_INTENCLR01_Msk (0x3FFFFUL << RADIO_INTENCLR01_INTENCLR01_Pos) /*!< Bit mask of INTENCLR01 field. */

/* Register: RADIO_INTPEND00 */
/* Description: Pending interrupts */

/* Bits 31..0 :   */
#define RADIO_INTPEND00_INTPEND00_Pos (0UL) /*!< Position of INTPEND00 field. */
#define RADIO_INTPEND00_INTPEND00_Msk (0xFFFFFFFFUL << RADIO_INTPEND00_INTPEND00_Pos) /*!< Bit mask of INTPEND00 field. */

/* Register: RADIO_INTPEND01 */
/* Description: Pending interrupts */

/* Bits 17..0 :   */
#define RADIO_INTPEND01_INTPEND01_Pos (0UL) /*!< Position of INTPEND01 field. */
#define RADIO_INTPEND01_INTPEND01_Msk (0x3FFFFUL << RADIO_INTPEND01_INTPEND01_Pos) /*!< Bit mask of INTPEND01 field. */

/* Register: RADIO_INTEN10 */
/* Description: Enable or disable interrupt */

/* Bits 31..0 :   */
#define RADIO_INTEN10_INTEN10_Pos (0UL) /*!< Position of INTEN10 field. */
#define RADIO_INTEN10_INTEN10_Msk (0xFFFFFFFFUL << RADIO_INTEN10_INTEN10_Pos) /*!< Bit mask of INTEN10 field. */

/* Register: RADIO_INTEN11 */
/* Description: Enable or disable interrupt */

/* Bits 17..0 :   */
#define RADIO_INTEN11_INTEN11_Pos (0UL) /*!< Position of INTEN11 field. */
#define RADIO_INTEN11_INTEN11_Msk (0x3FFFFUL << RADIO_INTEN11_INTEN11_Pos) /*!< Bit mask of INTEN11 field. */

/* Register: RADIO_INTENSET10 */
/* Description: Enable interrupt */

/* Bits 31..0 :   */
#define RADIO_INTENSET10_INTENSET10_Pos (0UL) /*!< Position of INTENSET10 field. */
#define RADIO_INTENSET10_INTENSET10_Msk (0xFFFFFFFFUL << RADIO_INTENSET10_INTENSET10_Pos) /*!< Bit mask of INTENSET10 field. */

/* Register: RADIO_INTENSET11 */
/* Description: Enable interrupt */

/* Bits 17..0 :   */
#define RADIO_INTENSET11_INTENSET11_Pos (0UL) /*!< Position of INTENSET11 field. */
#define RADIO_INTENSET11_INTENSET11_Msk (0x3FFFFUL << RADIO_INTENSET11_INTENSET11_Pos) /*!< Bit mask of INTENSET11 field. */

/* Register: RADIO_INTENCLR10 */
/* Description: Disable interrupt */

/* Bits 31..0 :   */
#define RADIO_INTENCLR10_INTENCLR10_Pos (0UL) /*!< Position of INTENCLR10 field. */
#define RADIO_INTENCLR10_INTENCLR10_Msk (0xFFFFFFFFUL << RADIO_INTENCLR10_INTENCLR10_Pos) /*!< Bit mask of INTENCLR10 field. */

/* Register: RADIO_INTENCLR11 */
/* Description: Disable interrupt */

/* Bits 17..0 :   */
#define RADIO_INTENCLR11_INTENCLR11_Pos (0UL) /*!< Position of INTENCLR11 field. */
#define RADIO_INTENCLR11_INTENCLR11_Msk (0x3FFFFUL << RADIO_INTENCLR11_INTENCLR11_Pos) /*!< Bit mask of INTENCLR11 field. */

/* Register: RADIO_INTPEND10 */
/* Description: Pending interrupts */

/* Bits 31..0 :   */
#define RADIO_INTPEND10_INTPEND10_Pos (0UL) /*!< Position of INTPEND10 field. */
#define RADIO_INTPEND10_INTPEND10_Msk (0xFFFFFFFFUL << RADIO_INTPEND10_INTPEND10_Pos) /*!< Bit mask of INTPEND10 field. */

/* Register: RADIO_INTPEND11 */
/* Description: Pending interrupts */

/* Bits 17..0 :   */
#define RADIO_INTPEND11_INTPEND11_Pos (0UL) /*!< Position of INTPEND11 field. */
#define RADIO_INTPEND11_INTPEND11_Msk (0x3FFFFUL << RADIO_INTPEND11_INTPEND11_Pos) /*!< Bit mask of INTPEND11 field. */

/* Register: RADIO_MODE */
/* Description: Data rate and modulation */

/* Bits 3..0 : Radio data rate and modulation setting. The radio supports frequency-shift keying (FSK) modulation. */
#define RADIO_MODE_MODE_Pos (0UL) /*!< Position of MODE field. */
#define RADIO_MODE_MODE_Msk (0xFUL << RADIO_MODE_MODE_Pos) /*!< Bit mask of MODE field. */
#define RADIO_MODE_MODE_Nrf_1Mbit (0UL) /*!< 1 Mbps Nordic proprietary radio mode */
#define RADIO_MODE_MODE_Nrf_2Mbit (1UL) /*!< 2 Mbps Nordic proprietary radio mode */
#define RADIO_MODE_MODE_Nrf_250Kbit (2UL) /*!< Deprecated enumerator -  250 kbps Nordic proprietary radio mode */
#define RADIO_MODE_MODE_Ble_1Mbit (3UL) /*!< 1 Mbps BLE */
#define RADIO_MODE_MODE_Ble_2Mbit (4UL) /*!< 2 Mbps BLE */
#define RADIO_MODE_MODE_Ble_LR125Kbit (5UL) /*!< Long range 125 kbps TX, 125 kbps and 500 kbps RX */
#define RADIO_MODE_MODE_Ble_LR500Kbit (6UL) /*!< Long range 500 kbps TX, 125 kbps and 500 kbps RX */
#define RADIO_MODE_MODE_Nrf_4Mbit0_5 (9UL) /*!< 4 Mbps Nordic proprietary radio mode (BT=0.5/h=0.5) */
#define RADIO_MODE_MODE_Nrf_4Mbit0_25 (10UL) /*!< 4 Mbps Nordic proprietary radio mode (BT=0.5/h=0.25) */
#define RADIO_MODE_MODE_Ieee802154_250Kbit (15UL) /*!< IEEE 802.15.4-2006 250 kbps */

