adamkondraciuk/nrfx/mdk/nrf54lilium_network_bitfields.h
/* Register: RADIO_MODEINTERNAL */
/* Description: Internal mode setting, active only when MODEPROGENABLE==1 */

/* Bits 3..0 : Radio data rate and modulation setting. Same definition as MODE. */
#define RADIO_MODEINTERNAL_MODEINTERNAL_Pos (0UL) /*!< Position of MODEINTERNAL field. */
#define RADIO_MODEINTERNAL_MODEINTERNAL_Msk (0xFUL << RADIO_MODEINTERNAL_MODEINTERNAL_Pos) /*!< Bit mask of MODEINTERNAL field. */

/* Register: RADIO_MODEPROGENABLE */
/* Description: Switch that enables programmable modes */

/* Bit 0 : Enable manual triggering of MODEREADY event and activate MODEINTERNAL register (ie. MODEINTERNAL overrides MODE register) */
#define RADIO_MODEPROGENABLE_MODEPROGENABLE_Pos (0UL) /*!< Position of MODEPROGENABLE field. */
#define RADIO_MODEPROGENABLE_MODEPROGENABLE_Msk (0x1UL << RADIO_MODEPROGENABLE_MODEPROGENABLE_Pos) /*!< Bit mask of MODEPROGENABLE field. */

/* Register: RADIO_MODE_DEPENDENT_XPB_TEST_REGISTER */
/* Description: Mode dependent XPB test register */

/* Bits 31..0 : 32 bits, only for testing mode dependency */
#define RADIO_MODE_DEPENDENT_XPB_TEST_REGISTER_VAL_Pos (0UL) /*!< Position of VAL field. */
#define RADIO_MODE_DEPENDENT_XPB_TEST_REGISTER_VAL_Msk (0xFFFFFFFFUL << RADIO_MODE_DEPENDENT_XPB_TEST_REGISTER_VAL_Pos) /*!< Bit mask of VAL field. */

/* Register: RADIO_MODECNF */
/* Description: Radio mode configuration register */

/* Bit 6 : IQ RAM select */
#define RADIO_MODECNF_IQRAMSEL_Pos (6UL) /*!< Position of IQRAMSEL field. */
#define RADIO_MODECNF_IQRAMSEL_Msk (0x1UL << RADIO_MODECNF_IQRAMSEL_Pos) /*!< Bit mask of IQRAMSEL field. */
#define RADIO_MODECNF_IQRAMSEL_off (0UL) /*!< IQ RAM select off */
#define RADIO_MODECNF_IQRAMSEL_on (1UL) /*!< IQ RAM select on */

/* Bit 5 : Loopback from IQ modulator (TODO: is it a good place?) */
#define RADIO_MODECNF_IQMODLOOPBACK_Pos (5UL) /*!< Position of IQMODLOOPBACK field. */
#define RADIO_MODECNF_IQMODLOOPBACK_Msk (0x1UL << RADIO_MODECNF_IQMODLOOPBACK_Pos) /*!< Bit mask of IQMODLOOPBACK field. */
#define RADIO_MODECNF_IQMODLOOPBACK_Off (0UL) /*!< Digital loopback off */
#define RADIO_MODECNF_IQMODLOOPBACK_On (1UL) /*!< Digital loopback on */

/* Bits 4..3 : Default TX value. Specifies what the RADIO will transmit when it is not started, i.e.
          between:
          RADIO.EVENTS_READY and RADIO.TASKS_START
          RADIO.EVENTS_END and RADIO.TASKS_START
          RADIO.EVENTS_END and RADIO.EVENTS_DISABLED) */
#define RADIO_MODECNF_DTX_Pos (3UL) /*!< Position of DTX field. */
#define RADIO_MODECNF_DTX_Msk (0x3UL << RADIO_MODECNF_DTX_Pos) /*!< Bit mask of DTX field. */
#define RADIO_MODECNF_DTX_B1 (0UL) /*!< Transmit '1' */
#define RADIO_MODECNF_DTX_B0 (1UL) /*!< Transmit '0' */
#define RADIO_MODECNF_DTX_Center (2UL) /*!< Transmit center frequency
          When tuning the crystal for centre frequency, the RADIO must
          be set in DTX = Center mode to be able to achieve the expected
          accuracy. This is only a valid setting for Nrf_1Mbit, Nrf_2Mbit,
          Nrf_250kbit, Ble_1Mbit and Ble_2Mbit. */

/* Bit 2 : Sideband select */
#define RADIO_MODECNF_SSEL_Pos (2UL) /*!< Position of SSEL field. */
#define RADIO_MODECNF_SSEL_Msk (0x1UL << RADIO_MODECNF_SSEL_Pos) /*!< Bit mask of SSEL field. */
#define RADIO_MODECNF_SSEL_Low (0UL) /*!< Low-side LO */
#define RADIO_MODECNF_SSEL_High (1UL) /*!< High-side LO */

/* Bit 1 : Zero-IF mode */
#define RADIO_MODECNF_ZEROIF_Pos (1UL) /*!< Position of ZEROIF field. */
#define RADIO_MODECNF_ZEROIF_Msk (0x1UL << RADIO_MODECNF_ZEROIF_Pos) /*!< Bit mask of ZEROIF field. */
#define RADIO_MODECNF_ZEROIF_Default (0UL) /*!< Default mode (heterodyne) */
#define RADIO_MODECNF_ZEROIF_ZeroIF (1UL) /*!< Zero-IF mode */

/* Bit 0 : Demodulator mode override value */
#define RADIO_MODECNF_DEMODN_Pos (0UL) /*!< Position of DEMODN field. */
#define RADIO_MODECNF_DEMODN_Msk (0x1UL << RADIO_MODECNF_DEMODN_Pos) /*!< Bit mask of DEMODN field. */
#define RADIO_MODECNF_DEMODN_Hyper (0UL) /*!< Hyper demodulator mode */
#define RADIO_MODECNF_DEMODN_Standard (1UL) /*!< Standard demodulator mode */

/* Register: RADIO_MISC */
/* Description: Misc configuration collection (to be renamed when more bits are defined) */

/* Bit 2 : Override AGC gain setting during CTE (from QOVERRIDE10) */
#define RADIO_MISC_AGCFREEZEGAINENABLE_Pos (2UL) /*!< Position of AGCFREEZEGAINENABLE field. */
#define RADIO_MISC_AGCFREEZEGAINENABLE_Msk (0x1UL << RADIO_MISC_AGCFREEZEGAINENABLE_Pos) /*!< Bit mask of AGCFREEZEGAINENABLE field. */
#define RADIO_MISC_AGCFREEZEGAINENABLE_Adjust (0UL) /*!< AGC gain settings will keep adjusting during CTE */
#define RADIO_MISC_AGCFREEZEGAINENABLE_Freeze (1UL) /*!< AGC gain settings will freeze (not keep adjusting) during CTE */

/* Bit 1 :   */
#define RADIO_MISC_AGCFREEZEAFTERREF_Pos (1UL) /*!< Position of AGCFREEZEAFTERREF field. */
#define RADIO_MISC_AGCFREEZEAFTERREF_Msk (0x1UL << RADIO_MISC_AGCFREEZEAFTERREF_Pos) /*!< Bit mask of AGCFREEZEAFTERREF field. */
#define RADIO_MISC_AGCFREEZEAFTERREF_EntireCTE (0UL) /*!< Gain freeze will apply to whole CTE, */
#define RADIO_MISC_AGCFREEZEAFTERREF_AfterRefPeriod (1UL) /*!< Gain freeze will apply to only after reference period of CTE. */

/* Bit 0 :   */
#define RADIO_MISC_DISABLEADDRWINDOW_Pos (0UL) /*!< Position of DISABLEADDRWINDOW field. */
#define RADIO_MISC_DISABLEADDRWINDOW_Msk (0x1UL << RADIO_MISC_DISABLEADDRWINDOW_Pos) /*!< Bit mask of DISABLEADDRWINDOW field. */
#define RADIO_MISC_DISABLEADDRWINDOW_Enabled (0UL) /*!< Enable */
#define RADIO_MISC_DISABLEADDRWINDOW_Disabled (1UL) /*!< Disable */

/* Register: RADIO_STATE */
/* Description: Current radio state */

/* Bits 3..0 : Current radio state */
#define RADIO_STATE_STATE_Pos (0UL) /*!< Position of STATE field. */
#define RADIO_STATE_STATE_Msk (0xFUL << RADIO_STATE_STATE_Pos) /*!< Bit mask of STATE field. */
#define RADIO_STATE_STATE_Disabled (0UL) /*!< RADIO is in the Disabled state */
#define RADIO_STATE_STATE_RxRu (1UL) /*!< RADIO is in the RXRU state */
#define RADIO_STATE_STATE_RxIdle (2UL) /*!< RADIO is in the RXIDLE state */
#define RADIO_STATE_STATE_Rx (3UL) /*!< RADIO is in the RX state */
#define RADIO_STATE_STATE_RxDisable (4UL) /*!< RADIO is in the RXDISABLED state */
#define RADIO_STATE_STATE_TxRu (9UL) /*!< RADIO is in the TXRU state */
#define RADIO_STATE_STATE_TxIdle (10UL) /*!< RADIO is in the TXIDLE state */
#define RADIO_STATE_STATE_Tx (11UL) /*!< RADIO is in the TX state */
#define RADIO_STATE_STATE_TxDisable (12UL) /*!< RADIO is in the TXDISABLED state */

/* Register: RADIO_EDCTRL */
/* Description: IEEE 802.15.4 energy detect control */

/* Bits 29..24 : IEEE 802.15.4 energy detect/cca period, 4us resolution */
#define RADIO_EDCTRL_EDPERIOD_Pos (24UL) /*!< Position of EDPERIOD field. */
#define RADIO_EDCTRL_EDPERIOD_Msk (0x3FUL << RADIO_EDCTRL_EDPERIOD_Pos) /*!< Bit mask of EDPERIOD field. */

