adamkondraciuk/nrfx/mdk/nrf54lilium_network_bitfields.h
/* Bits 20..0 : IEEE 802.15.4 energy detect loop count */
#define RADIO_EDCTRL_EDCNT_Pos (0UL) /*!< Position of EDCNT field. */
#define RADIO_EDCTRL_EDCNT_Msk (0x1FFFFFUL << RADIO_EDCTRL_EDCNT_Pos) /*!< Bit mask of EDCNT field. */

/* Register: RADIO_EDSAMPLE */
/* Description: IEEE 802.15.4 energy detect level */

/* Bits 7..0 : IEEE 802.15.4 energy detect level */
#define RADIO_EDSAMPLE_EDLVL_Pos (0UL) /*!< Position of EDLVL field. */
#define RADIO_EDSAMPLE_EDLVL_Msk (0xFFUL << RADIO_EDSAMPLE_EDLVL_Pos) /*!< Bit mask of EDLVL field. */

/* Register: RADIO_CCACTRL */
/* Description: IEEE 802.15.4 clear channel assessment control */

/* Bits 31..24 : Limit for occurances above CCACORRTHRES. When not equal to zero the corrolator based signal detect is enabled. */
#define RADIO_CCACTRL_CCACORRCNT_Pos (24UL) /*!< Position of CCACORRCNT field. */
#define RADIO_CCACTRL_CCACORRCNT_Msk (0xFFUL << RADIO_CCACTRL_CCACORRCNT_Pos) /*!< Bit mask of CCACORRCNT field. */

/* Bits 23..16 : CCA correlator busy threshold. Only relevant to CarrierMode, CarrierAndEdMode, and CarrierOrEdMode. */
#define RADIO_CCACTRL_CCACORRTHRES_Pos (16UL) /*!< Position of CCACORRTHRES field. */
#define RADIO_CCACTRL_CCACORRTHRES_Msk (0xFFUL << RADIO_CCACTRL_CCACORRTHRES_Pos) /*!< Bit mask of CCACORRTHRES field. */

/* Bits 15..8 : CCA energy busy threshold. Used in all the CCA modes except CarrierMode. */
#define RADIO_CCACTRL_CCAEDTHRES_Pos (8UL) /*!< Position of CCAEDTHRES field. */
#define RADIO_CCACTRL_CCAEDTHRES_Msk (0xFFUL << RADIO_CCACTRL_CCAEDTHRES_Pos) /*!< Bit mask of CCAEDTHRES field. */

/* Bits 2..0 : CCA mode of operation */
#define RADIO_CCACTRL_CCAMODE_Pos (0UL) /*!< Position of CCAMODE field. */
#define RADIO_CCACTRL_CCAMODE_Msk (0x7UL << RADIO_CCACTRL_CCAMODE_Pos) /*!< Bit mask of CCAMODE field. */
#define RADIO_CCACTRL_CCAMODE_EdMode (0UL) /*!< Energy above threshold */
#define RADIO_CCACTRL_CCAMODE_CarrierMode (1UL) /*!< Carrier seen */
#define RADIO_CCACTRL_CCAMODE_CarrierAndEdMode (2UL) /*!< Energy above threshold AND carrier seen */
#define RADIO_CCACTRL_CCAMODE_CarrierOrEdMode (3UL) /*!< Energy above threshold OR carrier seen */
#define RADIO_CCACTRL_CCAMODE_EdModeTest1 (4UL) /*!< Energy above threshold test mode that will abort when first ED measurement over threshold is seen. No averaging. */

/* Register: RADIO_DATAWHITEIV */
/* Description: Data whitening initial value */

/* Bits 5..0 :   */
#define RADIO_DATAWHITEIV_DATAWHITEIV_Pos (0UL) /*!< Position of DATAWHITEIV field. */
#define RADIO_DATAWHITEIV_DATAWHITEIV_Msk (0x3FUL << RADIO_DATAWHITEIV_DATAWHITEIV_Pos) /*!< Bit mask of DATAWHITEIV field. */

/* Register: RADIO_ACQINJCNF0 */
/* Description: Data acquisition capture mode */

/* Bit 31 : Data acquisition or injection */
#define RADIO_ACQINJCNF0_DIR_Pos (31UL) /*!< Position of DIR field. */
#define RADIO_ACQINJCNF0_DIR_Msk (0x1UL << RADIO_ACQINJCNF0_DIR_Pos) /*!< Bit mask of DIR field. */
#define RADIO_ACQINJCNF0_DIR_ACQ (0UL) /*!< Peripheral to memory */
#define RADIO_ACQINJCNF0_DIR_INJ (1UL) /*!< Memory to peripheral */

/* Bits 10..8 : Data hijack mode (Do not select the same SRC for one than more DMAs. otherwise higher index takes over control.) */
#define RADIO_ACQINJCNF0_INJMODE_Pos (8UL) /*!< Position of INJMODE field. */
#define RADIO_ACQINJCNF0_INJMODE_Msk (0x7UL << RADIO_ACQINJCNF0_INJMODE_Pos) /*!< Bit mask of INJMODE field. */
#define RADIO_ACQINJCNF0_INJMODE_FFSRC (0UL) /*!< Pick up IQ samples from RAM as FrontEnd input (hijack ADC output) */
#define RADIO_ACQINJCNF0_INJMODE_BBSRC (1UL) /*!< Pick up IQ samples from RAM as Radio BaseBand input */
#define RADIO_ACQINJCNF0_INJMODE_TXSRC (2UL) /*!< Pick up Tx bits from RAM (skipping packet assembler as modulator input */
#define RADIO_ACQINJCNF0_INJMODE_ADPLLMODSRC (6UL) /*!< Pick up arbitrary wave from RAM to ADPLL */

/* Bits 3..0 : Data acquisition capture mode */
#define RADIO_ACQINJCNF0_ACQMODE_Pos (0UL) /*!< Position of ACQMODE field. */
#define RADIO_ACQINJCNF0_ACQMODE_Msk (0xFUL << RADIO_ACQINJCNF0_ACQMODE_Pos) /*!< Bit mask of ACQMODE field. */
#define RADIO_ACQINJCNF0_ACQMODE_ADCIQ (0UL) /*!< Logging ADCI and ADCQ */
#define RADIO_ACQINJCNF0_ACQMODE_ADCIQANDAGCGAIN (2UL) /*!< Logging ADCI, ADCQ and AGC gain settings */
#define RADIO_ACQINJCNF0_ACQMODE_AGCGAINANDPKD (3UL) /*!< Logging AGC gain settings and peak detector outputs */
#define RADIO_ACQINJCNF0_ACQMODE_FEIQ (4UL) /*!< Logging FrontEnd sampleI and sampleQ */
#define RADIO_ACQINJCNF0_ACQMODE_BBIQ (5UL) /*!< Logging BaseBand I and Q */
#define RADIO_ACQINJCNF0_ACQMODE_BBSTDOUT (6UL) /*!< Logging BaseBand std demodulator outputs (original ones, not the delayed version) */
#define RADIO_ACQINJCNF0_ACQMODE_BBHYPOUT (7UL) /*!< Logging BaseBand hyp demodulator outputs */
#define RADIO_ACQINJCNF0_ACQMODE_BBSTDHYPMUXOUT (8UL) /*!< Logging muxed demodulator outputs and flags */
#define RADIO_ACQINJCNF0_ACQMODE_ADPLLTRACE (12UL) /*!< ADPLL tracing */

/* Register: RADIO_ACQINJCNF1 */
/* Description: Data acquisition capture mode */

/* Bit 31 : Data acquisition or injection */
#define RADIO_ACQINJCNF1_DIR_Pos (31UL) /*!< Position of DIR field. */
#define RADIO_ACQINJCNF1_DIR_Msk (0x1UL << RADIO_ACQINJCNF1_DIR_Pos) /*!< Bit mask of DIR field. */
#define RADIO_ACQINJCNF1_DIR_ACQ (0UL) /*!< Peripheral to memory */
#define RADIO_ACQINJCNF1_DIR_INJ (1UL) /*!< Memory to peripheral */

/* Bits 10..8 : Data hijack mode (Do not select the same SRC for one than more DMAs. otherwise higher index takes over control.) */
#define RADIO_ACQINJCNF1_INJMODE_Pos (8UL) /*!< Position of INJMODE field. */
#define RADIO_ACQINJCNF1_INJMODE_Msk (0x7UL << RADIO_ACQINJCNF1_INJMODE_Pos) /*!< Bit mask of INJMODE field. */
#define RADIO_ACQINJCNF1_INJMODE_FFSRC (0UL) /*!< Pick up IQ samples from RAM as FrontEnd input (hijack ADC output) */
#define RADIO_ACQINJCNF1_INJMODE_BBSRC (1UL) /*!< Pick up IQ samples from RAM as Radio BaseBand input */
#define RADIO_ACQINJCNF1_INJMODE_TXSRC (2UL) /*!< Pick up Tx bits from RAM (skipping packet assembler as modulator input */
#define RADIO_ACQINJCNF1_INJMODE_ADPLLMODSRC (6UL) /*!< Pick up arbitrary wave from RAM to ADPLL */

/* Bits 3..0 : Data acquisition capture mode */
#define RADIO_ACQINJCNF1_ACQMODE_Pos (0UL) /*!< Position of ACQMODE field. */
#define RADIO_ACQINJCNF1_ACQMODE_Msk (0xFUL << RADIO_ACQINJCNF1_ACQMODE_Pos) /*!< Bit mask of ACQMODE field. */
#define RADIO_ACQINJCNF1_ACQMODE_ADCIQ (0UL) /*!< Logging ADCI and ADCQ */
#define RADIO_ACQINJCNF1_ACQMODE_ADCIQANDAGCGAIN (2UL) /*!< Logging ADCI, ADCQ and AGC gain settings */
#define RADIO_ACQINJCNF1_ACQMODE_AGCGAINANDPKD (3UL) /*!< Logging AGC gain settings and peak detector outputs */
#define RADIO_ACQINJCNF1_ACQMODE_FEIQ (4UL) /*!< Logging FrontEnd sampleI and sampleQ */
#define RADIO_ACQINJCNF1_ACQMODE_BBIQ (5UL) /*!< Logging BaseBand I and Q */
#define RADIO_ACQINJCNF1_ACQMODE_BBSTDOUT (6UL) /*!< Logging BaseBand std demodulator outputs (original ones, not the delayed version) */
#define RADIO_ACQINJCNF1_ACQMODE_BBHYPOUT (7UL) /*!< Logging BaseBand hyp demodulator outputs */
#define RADIO_ACQINJCNF1_ACQMODE_BBSTDHYPMUXOUT (8UL) /*!< Logging muxed demodulator outputs and flags */
#define RADIO_ACQINJCNF1_ACQMODE_ADPLLTRACE (12UL) /*!< ADPLL tracing */

/* Register: RADIO_ACQINJDMA0_ENABLE */
/* Description: Enable or disable data acquisition */

/* Bit 0 : Enable or disable data acquisition */
#define RADIO_ACQINJDMA0_ENABLE_ACQINJDMA0_ENABLE_Pos (0UL) /*!< Position of ACQINJDMA0_ENABLE field. */
#define RADIO_ACQINJDMA0_ENABLE_ACQINJDMA0_ENABLE_Msk (0x1UL << RADIO_ACQINJDMA0_ENABLE_ACQINJDMA0_ENABLE_Pos) /*!< Bit mask of ACQINJDMA0_ENABLE field. */
#define RADIO_ACQINJDMA0_ENABLE_ACQINJDMA0_ENABLE_Disabled (0UL) /*!< Data acquisition is disabled */
#define RADIO_ACQINJDMA0_ENABLE_ACQINJDMA0_ENABLE_Enabled (1UL) /*!< Data acquisition is enabled */

/* Register: RADIO_ACQINJDMA0_PTR */
/* Description: ACQ DMA pointer */

