adamkondraciuk/nrfx/mdk/nrf54lilium_network_bitfields.h
/* Bit 29 :   */
#define RADIO_ACQINJDMA0_PTR_BASE_Pos (29UL) /*!< Position of BASE field. */
#define RADIO_ACQINJDMA0_PTR_BASE_Msk (0x1UL << RADIO_ACQINJDMA0_PTR_BASE_Pos) /*!< Bit mask of BASE field. */

/* Bits 15..0 :   */
#define RADIO_ACQINJDMA0_PTR_OFFSET_Pos (0UL) /*!< Position of OFFSET field. */
#define RADIO_ACQINJDMA0_PTR_OFFSET_Msk (0xFFFFUL << RADIO_ACQINJDMA0_PTR_OFFSET_Pos) /*!< Bit mask of OFFSET field. */

/* Register: RADIO_ACQINJDMA0_MAXCNT */
/* Description: Maximum number of 32-bit words to transfer */

/* Bits 13..0 : Maximum number of 32-bit words to transfer */
#define RADIO_ACQINJDMA0_MAXCNT_ACQINJDMA0_MAXCNT_Pos (0UL) /*!< Position of ACQINJDMA0_MAXCNT field. */
#define RADIO_ACQINJDMA0_MAXCNT_ACQINJDMA0_MAXCNT_Msk (0x3FFFUL << RADIO_ACQINJDMA0_MAXCNT_ACQINJDMA0_MAXCNT_Pos) /*!< Bit mask of ACQINJDMA0_MAXCNT field. */

/* Register: RADIO_ACQINJDMA0_AMOUNT */
/* Description: Number of 32-bit words transferred in the last transaction */

/* Bits 13..0 : Number of 32-bit words transferred in the last transaction */
#define RADIO_ACQINJDMA0_AMOUNT_ACQINJDMA0_AMOUNT_Pos (0UL) /*!< Position of ACQINJDMA0_AMOUNT field. */
#define RADIO_ACQINJDMA0_AMOUNT_ACQINJDMA0_AMOUNT_Msk (0x3FFFUL << RADIO_ACQINJDMA0_AMOUNT_ACQINJDMA0_AMOUNT_Pos) /*!< Bit mask of ACQINJDMA0_AMOUNT field. */

/* Register: RADIO_ACQINJDMA1_ENABLE */
/* Description: Enable or disable data store */

/* Bit 0 :   */
#define RADIO_ACQINJDMA1_ENABLE_ACQINJDMA1_ENABLE_Pos (0UL) /*!< Position of ACQINJDMA1_ENABLE field. */
#define RADIO_ACQINJDMA1_ENABLE_ACQINJDMA1_ENABLE_Msk (0x1UL << RADIO_ACQINJDMA1_ENABLE_ACQINJDMA1_ENABLE_Pos) /*!< Bit mask of ACQINJDMA1_ENABLE field. */
#define RADIO_ACQINJDMA1_ENABLE_ACQINJDMA1_ENABLE_Disabled (0UL) /*!< Data store is disabled */
#define RADIO_ACQINJDMA1_ENABLE_ACQINJDMA1_ENABLE_Enabled (1UL) /*!< Data store is enabled */

/* Register: RADIO_ACQINJDMA1_PTR */
/* Description: ACQ DMA pointer */

/* Bit 29 :   */
#define RADIO_ACQINJDMA1_PTR_BASE_Pos (29UL) /*!< Position of BASE field. */
#define RADIO_ACQINJDMA1_PTR_BASE_Msk (0x1UL << RADIO_ACQINJDMA1_PTR_BASE_Pos) /*!< Bit mask of BASE field. */

/* Bits 15..0 :   */
#define RADIO_ACQINJDMA1_PTR_OFFSET_Pos (0UL) /*!< Position of OFFSET field. */
#define RADIO_ACQINJDMA1_PTR_OFFSET_Msk (0xFFFFUL << RADIO_ACQINJDMA1_PTR_OFFSET_Pos) /*!< Bit mask of OFFSET field. */

/* Register: RADIO_ACQINJDMA1_MAXCNT */
/* Description: Maximum number of 32-bit words to transfer */

/* Bits 13..0 :   */
#define RADIO_ACQINJDMA1_MAXCNT_MAXCNT_Pos (0UL) /*!< Position of MAXCNT field. */
#define RADIO_ACQINJDMA1_MAXCNT_MAXCNT_Msk (0x3FFFUL << RADIO_ACQINJDMA1_MAXCNT_MAXCNT_Pos) /*!< Bit mask of MAXCNT field. */

/* Register: RADIO_ACQINJDMA1_AMOUNT */
/* Description: Number of 32-bit words transferred in the last transaction */

/* Bits 13..0 :   */
#define RADIO_ACQINJDMA1_AMOUNT_AMOUNT_Pos (0UL) /*!< Position of AMOUNT field. */
#define RADIO_ACQINJDMA1_AMOUNT_AMOUNT_Msk (0x3FFFUL << RADIO_ACQINJDMA1_AMOUNT_AMOUNT_Pos) /*!< Bit mask of AMOUNT field. */

/* Register: RADIO_DEBUGPSEL_CLOCK */
/* Description: Pin select for RADIO clock (direct mode, base band debug. txCk and ckDataIn signals) */

/* Bit 31 : Connection */
#define RADIO_DEBUGPSEL_CLOCK_CONNECT_Pos (31UL) /*!< Position of CONNECT field. */
#define RADIO_DEBUGPSEL_CLOCK_CONNECT_Msk (0x1UL << RADIO_DEBUGPSEL_CLOCK_CONNECT_Pos) /*!< Bit mask of CONNECT field. */
#define RADIO_DEBUGPSEL_CLOCK_CONNECT_Connected (0UL) /*!< Connect */
#define RADIO_DEBUGPSEL_CLOCK_CONNECT_Disconnected (1UL) /*!< Disconnect */

/* Bits 9..8 : Port number */
#define RADIO_DEBUGPSEL_CLOCK_PORT_Pos (8UL) /*!< Position of PORT field. */
#define RADIO_DEBUGPSEL_CLOCK_PORT_Msk (0x3UL << RADIO_DEBUGPSEL_CLOCK_PORT_Pos) /*!< Bit mask of PORT field. */

/* Bits 5..0 : Pin number */
#define RADIO_DEBUGPSEL_CLOCK_PIN_Pos (0UL) /*!< Position of PIN field. */
#define RADIO_DEBUGPSEL_CLOCK_PIN_Msk (0x3FUL << RADIO_DEBUGPSEL_CLOCK_PIN_Pos) /*!< Bit mask of PIN field. */

/* Register: RADIO_DEBUGPSEL_DATA */
/* Description: Pin select for RADIO data (direct mode, base band debug. txRadioData and dataIn signals) */

/* Bit 31 : Connection */
#define RADIO_DEBUGPSEL_DATA_CONNECT_Pos (31UL) /*!< Position of CONNECT field. */
#define RADIO_DEBUGPSEL_DATA_CONNECT_Msk (0x1UL << RADIO_DEBUGPSEL_DATA_CONNECT_Pos) /*!< Bit mask of CONNECT field. */
#define RADIO_DEBUGPSEL_DATA_CONNECT_Connected (0UL) /*!< Connect */
#define RADIO_DEBUGPSEL_DATA_CONNECT_Disconnected (1UL) /*!< Disconnect */

/* Bits 9..8 : Port number */
#define RADIO_DEBUGPSEL_DATA_PORT_Pos (8UL) /*!< Position of PORT field. */
#define RADIO_DEBUGPSEL_DATA_PORT_Msk (0x3UL << RADIO_DEBUGPSEL_DATA_PORT_Pos) /*!< Bit mask of PORT field. */

/* Bits 5..0 : Pin number */
#define RADIO_DEBUGPSEL_DATA_PIN_Pos (0UL) /*!< Position of PIN field. */
#define RADIO_DEBUGPSEL_DATA_PIN_Msk (0x3FUL << RADIO_DEBUGPSEL_DATA_PIN_Pos) /*!< Bit mask of PIN field. */

/* Register: RADIO_EXTPSEL_LNACTRL */
/* Description: Pin select for external LNA control */

/* Bit 31 : Connection */
#define RADIO_EXTPSEL_LNACTRL_CONNECT_Pos (31UL) /*!< Position of CONNECT field. */
#define RADIO_EXTPSEL_LNACTRL_CONNECT_Msk (0x1UL << RADIO_EXTPSEL_LNACTRL_CONNECT_Pos) /*!< Bit mask of CONNECT field. */
#define RADIO_EXTPSEL_LNACTRL_CONNECT_Connected (0UL) /*!< Connect */
#define RADIO_EXTPSEL_LNACTRL_CONNECT_Disconnected (1UL) /*!< Disconnect */

/* Bits 9..8 : Port number */
#define RADIO_EXTPSEL_LNACTRL_PORT_Pos (8UL) /*!< Position of PORT field. */
#define RADIO_EXTPSEL_LNACTRL_PORT_Msk (0x3UL << RADIO_EXTPSEL_LNACTRL_PORT_Pos) /*!< Bit mask of PORT field. */

/* Bits 5..0 : Pin number */
#define RADIO_EXTPSEL_LNACTRL_PIN_Pos (0UL) /*!< Position of PIN field. */
#define RADIO_EXTPSEL_LNACTRL_PIN_Msk (0x3FUL << RADIO_EXTPSEL_LNACTRL_PIN_Pos) /*!< Bit mask of PIN field. */

/* Register: RADIO_EXTPSEL_PACTRL */
/* Description: Pin select for external PA control */

/* Bit 31 : Connection */
#define RADIO_EXTPSEL_PACTRL_CONNECT_Pos (31UL) /*!< Position of CONNECT field. */
#define RADIO_EXTPSEL_PACTRL_CONNECT_Msk (0x1UL << RADIO_EXTPSEL_PACTRL_CONNECT_Pos) /*!< Bit mask of CONNECT field. */
#define RADIO_EXTPSEL_PACTRL_CONNECT_Connected (0UL) /*!< Connect */
#define RADIO_EXTPSEL_PACTRL_CONNECT_Disconnected (1UL) /*!< Disconnect */

/* Bits 9..8 : Port number */
#define RADIO_EXTPSEL_PACTRL_PORT_Pos (8UL) /*!< Position of PORT field. */
#define RADIO_EXTPSEL_PACTRL_PORT_Msk (0x3UL << RADIO_EXTPSEL_PACTRL_PORT_Pos) /*!< Bit mask of PORT field. */

/* Bits 5..0 : Pin number */
#define RADIO_EXTPSEL_PACTRL_PIN_Pos (0UL) /*!< Position of PIN field. */
#define RADIO_EXTPSEL_PACTRL_PIN_Msk (0x3FUL << RADIO_EXTPSEL_PACTRL_PIN_Pos) /*!< Bit mask of PIN field. */

/* Register: RADIO_GAIN_OUT */
/* Description: Gain readout (LNA_OUT_SPI for nrf52/53) */

/* Bits 15..12 :   */
#define RADIO_GAIN_OUT_AAF_GAIN_Pos (12UL) /*!< Position of AAF_GAIN field. */
#define RADIO_GAIN_OUT_AAF_GAIN_Msk (0xFUL << RADIO_GAIN_OUT_AAF_GAIN_Pos) /*!< Bit mask of AAF_GAIN field. */

/* Bit 8 :   */
#define RADIO_GAIN_OUT_MIXFILTBYPASS_Pos (8UL) /*!< Position of MIXFILTBYPASS field. */
#define RADIO_GAIN_OUT_MIXFILTBYPASS_Msk (0x1UL << RADIO_GAIN_OUT_MIXFILTBYPASS_Pos) /*!< Bit mask of MIXFILTBYPASS field. */

/* Bits 2..0 :   */
#define RADIO_GAIN_OUT_LNA_GAIN_Pos (0UL) /*!< Position of LNA_GAIN field. */
#define RADIO_GAIN_OUT_LNA_GAIN_Msk (0x7UL << RADIO_GAIN_OUT_LNA_GAIN_Pos) /*!< Bit mask of LNA_GAIN field. */

