adamkondraciuk/nrfx/mdk/nrf54lilium_network_bitfields.h
/* Register: RADIO_SHORTCUT_INTERNAL */
/* Description: TODO */

/* Bit 15 : Internal shortcut */
#define RADIO_SHORTCUT_INTERNAL_DmaEndRadioDisable_Pos (15UL) /*!< Position of DmaEndRadioDisable field. */
#define RADIO_SHORTCUT_INTERNAL_DmaEndRadioDisable_Msk (0x1UL << RADIO_SHORTCUT_INTERNAL_DmaEndRadioDisable_Pos) /*!< Bit mask of DmaEndRadioDisable field. */

/* Bit 14 : Internal shortcut */
#define RADIO_SHORTCUT_INTERNAL_RadioCalDoneDmaStart_Pos (14UL) /*!< Position of RadioCalDoneDmaStart field. */
#define RADIO_SHORTCUT_INTERNAL_RadioCalDoneDmaStart_Msk (0x1UL << RADIO_SHORTCUT_INTERNAL_RadioCalDoneDmaStart_Pos) /*!< Bit mask of RadioCalDoneDmaStart field. */

/* Bit 13 : Internal shortcut */
#define RADIO_SHORTCUT_INTERNAL_RadioCalDoneRadioPaTestStart_Pos (13UL) /*!< Position of RadioCalDoneRadioPaTestStart field. */
#define RADIO_SHORTCUT_INTERNAL_RadioCalDoneRadioPaTestStart_Msk (0x1UL << RADIO_SHORTCUT_INTERNAL_RadioCalDoneRadioPaTestStart_Pos) /*!< Bit mask of RadioCalDoneRadioPaTestStart field. */

/* Bit 12 : Internal shortcut */
#define RADIO_SHORTCUT_INTERNAL_RadioCalDoneRadioDisable_Pos (12UL) /*!< Position of RadioCalDoneRadioDisable field. */
#define RADIO_SHORTCUT_INTERNAL_RadioCalDoneRadioDisable_Msk (0x1UL << RADIO_SHORTCUT_INTERNAL_RadioCalDoneRadioDisable_Pos) /*!< Bit mask of RadioCalDoneRadioDisable field. */

/* Bit 11 : Internal shortcut */
#define RADIO_SHORTCUT_INTERNAL_RadioChNoUpdatedRadioLbEn_Pos (11UL) /*!< Position of RadioChNoUpdatedRadioLbEn field. */
#define RADIO_SHORTCUT_INTERNAL_RadioChNoUpdatedRadioLbEn_Msk (0x1UL << RADIO_SHORTCUT_INTERNAL_RadioChNoUpdatedRadioLbEn_Pos) /*!< Bit mask of RadioChNoUpdatedRadioLbEn field. */

/* Bit 10 : Internal shortcut */
#define RADIO_SHORTCUT_INTERNAL_RadioChNoUpdatedRadioRxEn_Pos (10UL) /*!< Position of RadioChNoUpdatedRadioRxEn field. */
#define RADIO_SHORTCUT_INTERNAL_RadioChNoUpdatedRadioRxEn_Msk (0x1UL << RADIO_SHORTCUT_INTERNAL_RadioChNoUpdatedRadioRxEn_Pos) /*!< Bit mask of RadioChNoUpdatedRadioRxEn field. */

/* Bit 9 : Internal shortcut */
#define RADIO_SHORTCUT_INTERNAL_RadioChNoUpdatedRadioTxEn_Pos (9UL) /*!< Position of RadioChNoUpdatedRadioTxEn field. */
#define RADIO_SHORTCUT_INTERNAL_RadioChNoUpdatedRadioTxEn_Msk (0x1UL << RADIO_SHORTCUT_INTERNAL_RadioChNoUpdatedRadioTxEn_Pos) /*!< Bit mask of RadioChNoUpdatedRadioTxEn field. */

/* Bit 8 : Internal shortcut */
#define RADIO_SHORTCUT_INTERNAL_RadioDisabledRadioChNoIncr_Pos (8UL) /*!< Position of RadioDisabledRadioChNoIncr field. */
#define RADIO_SHORTCUT_INTERNAL_RadioDisabledRadioChNoIncr_Msk (0x1UL << RADIO_SHORTCUT_INTERNAL_RadioDisabledRadioChNoIncr_Pos) /*!< Bit mask of RadioDisabledRadioChNoIncr field. */

/* Bit 7 : Internal shortcut */
#define RADIO_SHORTCUT_INTERNAL_RadioDisabledRadioLbEn_Pos (7UL) /*!< Position of RadioDisabledRadioLbEn field. */
#define RADIO_SHORTCUT_INTERNAL_RadioDisabledRadioLbEn_Msk (0x1UL << RADIO_SHORTCUT_INTERNAL_RadioDisabledRadioLbEn_Pos) /*!< Bit mask of RadioDisabledRadioLbEn field. */

/* Bit 6 : Internal shortcut */
#define RADIO_SHORTCUT_INTERNAL_RadioDisabledRadioRxEn_Pos (6UL) /*!< Position of RadioDisabledRadioRxEn field. */
#define RADIO_SHORTCUT_INTERNAL_RadioDisabledRadioRxEn_Msk (0x1UL << RADIO_SHORTCUT_INTERNAL_RadioDisabledRadioRxEn_Pos) /*!< Bit mask of RadioDisabledRadioRxEn field. */

/* Bit 5 : Internal shortcut */
#define RADIO_SHORTCUT_INTERNAL_RadioDisabledRadioTxEn_Pos (5UL) /*!< Position of RadioDisabledRadioTxEn field. */
#define RADIO_SHORTCUT_INTERNAL_RadioDisabledRadioTxEn_Msk (0x1UL << RADIO_SHORTCUT_INTERNAL_RadioDisabledRadioTxEn_Pos) /*!< Bit mask of RadioDisabledRadioTxEn field. */

/* Bit 4 : Internal shortcut */
#define RADIO_SHORTCUT_INTERNAL_RadioLbReadyDmaStart_Pos (4UL) /*!< Position of RadioLbReadyDmaStart field. */
#define RADIO_SHORTCUT_INTERNAL_RadioLbReadyDmaStart_Msk (0x1UL << RADIO_SHORTCUT_INTERNAL_RadioLbReadyDmaStart_Pos) /*!< Bit mask of RadioLbReadyDmaStart field. */

/* Bit 3 : Internal shortcut */
#define RADIO_SHORTCUT_INTERNAL_RadioRxReadyDmaStart_Pos (3UL) /*!< Position of RadioRxReadyDmaStart field. */
#define RADIO_SHORTCUT_INTERNAL_RadioRxReadyDmaStart_Msk (0x1UL << RADIO_SHORTCUT_INTERNAL_RadioRxReadyDmaStart_Pos) /*!< Bit mask of RadioRxReadyDmaStart field. */

/* Bit 2 : Internal shortcut */
#define RADIO_SHORTCUT_INTERNAL_RadioLbReadyRadioCalStart_Pos (2UL) /*!< Position of RadioLbReadyRadioCalStart field. */
#define RADIO_SHORTCUT_INTERNAL_RadioLbReadyRadioCalStart_Msk (0x1UL << RADIO_SHORTCUT_INTERNAL_RadioLbReadyRadioCalStart_Pos) /*!< Bit mask of RadioLbReadyRadioCalStart field. */

/* Bit 1 : Internal shortcut */
#define RADIO_SHORTCUT_INTERNAL_RadioRxReadyRadioCalStart_Pos (1UL) /*!< Position of RadioRxReadyRadioCalStart field. */
#define RADIO_SHORTCUT_INTERNAL_RadioRxReadyRadioCalStart_Msk (0x1UL << RADIO_SHORTCUT_INTERNAL_RadioRxReadyRadioCalStart_Pos) /*!< Bit mask of RadioRxReadyRadioCalStart field. */

/* Bit 0 : Internal shortcut */
#define RADIO_SHORTCUT_INTERNAL_RadioTxReadyRadioCalStart_Pos (0UL) /*!< Position of RadioTxReadyRadioCalStart field. */
#define RADIO_SHORTCUT_INTERNAL_RadioTxReadyRadioCalStart_Msk (0x1UL << RADIO_SHORTCUT_INTERNAL_RadioTxReadyRadioCalStart_Pos) /*!< Bit mask of RadioTxReadyRadioCalStart field. */

/* Register: RADIO_MODE_STAND_ALONE */
/* Description: TODO */

/* Bit 31 : 0: use radioMode/radioModeUpdate from port (controlled from top), 1: use radioMode/radioModeUpdate from registers in this IP */
#define RADIO_MODE_STAND_ALONE_UseRadioModeInt_Pos (31UL) /*!< Position of UseRadioModeInt field. */
#define RADIO_MODE_STAND_ALONE_UseRadioModeInt_Msk (0x1UL << RADIO_MODE_STAND_ALONE_UseRadioModeInt_Pos) /*!< Bit mask of UseRadioModeInt field. */

/* Bit 8 : 0: Default ramp-up time, compatible with 180nm radio. 1: Fast ramp-up. */
#define RADIO_MODE_STAND_ALONE_TimingMode_Pos (8UL) /*!< Position of TimingMode field. */
#define RADIO_MODE_STAND_ALONE_TimingMode_Msk (0x1UL << RADIO_MODE_STAND_ALONE_TimingMode_Pos) /*!< Bit mask of TimingMode field. */

/* Bits 7..0 : Internal radio mode consists of sSel, zeroIf, deModN and mode[3:0] */
#define RADIO_MODE_STAND_ALONE_RadioModeInt_Pos (0UL) /*!< Position of RadioModeInt field. */
#define RADIO_MODE_STAND_ALONE_RadioModeInt_Msk (0xFFUL << RADIO_MODE_STAND_ALONE_RadioModeInt_Pos) /*!< Bit mask of RadioModeInt field. */

