adamkondraciuk/nrfx/mdk/nrf54lilium_network_bitfields.h
/* Register: RADIO_FREQUENCY */
/* Description: Frequency */

/* Bit 8 : Channel map selection. 0: Channel map between 2400 MHZ .. 2500 MHz, Frequency = 2400 + FREQUENCY (MHz). 1: Channel map between 2400 MHZ .. 2500 MHz, Frequency = 2360 + FREQUENCY (MHz). */
#define RADIO_FREQUENCY_MAP_Pos (8UL) /*!< Position of MAP field. */
#define RADIO_FREQUENCY_MAP_Msk (0x1UL << RADIO_FREQUENCY_MAP_Pos) /*!< Bit mask of MAP field. */

/* Bits 6..0 : Radio channel frequency. Frequency = 2400 + FREQUENCY (MHz). */
#define RADIO_FREQUENCY_FREQUENCY_Pos (0UL) /*!< Position of FREQUENCY field. */
#define RADIO_FREQUENCY_FREQUENCY_Msk (0x7FUL << RADIO_FREQUENCY_FREQUENCY_Pos) /*!< Bit mask of FREQUENCY field. */

/* Register: RADIO_FREQUENCY_CONFIG */
/* Description: TODO */

/* Bit 31 : Set to high to buffer FREQUENCY register so that sub-modules in the MMI will only update next frequency config at TX_EN, RX_EN and LB_EN. Set to low if special test is needed for FS test. */
#define RADIO_FREQUENCY_CONFIG_BufferedFsCh_Pos (31UL) /*!< Position of BufferedFsCh field. */
#define RADIO_FREQUENCY_CONFIG_BufferedFsCh_Msk (0x1UL << RADIO_FREQUENCY_CONFIG_BufferedFsCh_Pos) /*!< Bit mask of BufferedFsCh field. */

/* Bits 5..0 : Radio channel incremental step unit. */
#define RADIO_FREQUENCY_CONFIG_FsChNoIncrStep_Pos (0UL) /*!< Position of FsChNoIncrStep field. */
#define RADIO_FREQUENCY_CONFIG_FsChNoIncrStep_Msk (0x3FUL << RADIO_FREQUENCY_CONFIG_FsChNoIncrStep_Pos) /*!< Bit mask of FsChNoIncrStep field. */

/* Register: RADIO_TXPOWER */
/* Description: Output power */

/* Bits 7..0 : RADIO output power */
#define RADIO_TXPOWER_TXPOWER_Pos (0UL) /*!< Position of TXPOWER field. */
#define RADIO_TXPOWER_TXPOWER_Msk (0xFFUL << RADIO_TXPOWER_TXPOWER_Pos) /*!< Bit mask of TXPOWER field. */
#define RADIO_TXPOWER_TXPOWER_0dBm (0x00UL) /*!< 0 dBm */
#define RADIO_TXPOWER_TXPOWER_Pos1dBm (0x01UL) /*!< +1 dBm */
#define RADIO_TXPOWER_TXPOWER_Pos2dBm (0x02UL) /*!< +2 dBm */
#define RADIO_TXPOWER_TXPOWER_Pos3dBm (0x03UL) /*!< +3 dBm */
#define RADIO_TXPOWER_TXPOWER_Pos4dBm (0x04UL) /*!< +4 dBm */
#define RADIO_TXPOWER_TXPOWER_Pos5dBm (0x05UL) /*!< +5 dBm */
#define RADIO_TXPOWER_TXPOWER_Pos6dBm (0x06UL) /*!< +6 dBm */
#define RADIO_TXPOWER_TXPOWER_Pos7dBm (0x07UL) /*!< +7 dBm */
#define RADIO_TXPOWER_TXPOWER_Pos8dBm (0x08UL) /*!< +8 dBm */
#define RADIO_TXPOWER_TXPOWER_Pos9dBm (0x09UL) /*!< +9 dBm */
#define RADIO_TXPOWER_TXPOWER_Pos10dBm (0x0AUL) /*!< +10 dBm */
#define RADIO_TXPOWER_TXPOWER_Pos10dBm_2 (0x0BUL) /*!< +10 dBm */
#define RADIO_TXPOWER_TXPOWER_Neg70dBm (0xBAUL) /*!< -70 dBm */
#define RADIO_TXPOWER_TXPOWER_Neg40dBm (0xD8UL) /*!< -40 dBm */
#define RADIO_TXPOWER_TXPOWER_Neg30dBm (0xE2UL) /*!< -30 dBm */
#define RADIO_TXPOWER_TXPOWER_Neg20dBm (0xECUL) /*!< -20 dBm */
#define RADIO_TXPOWER_TXPOWER_Neg16dBm (0xF0UL) /*!< -16 dBm */
#define RADIO_TXPOWER_TXPOWER_Neg12dBm (0xF4UL) /*!< -12 dBm */
#define RADIO_TXPOWER_TXPOWER_Neg8dBm (0xF8UL) /*!< -8 dBm */
#define RADIO_TXPOWER_TXPOWER_Neg4dBm (0xFCUL) /*!< -4 dBm */
#define RADIO_TXPOWER_TXPOWER_Neg2dBm (0xFEUL) /*!< -2 dBm */
#define RADIO_TXPOWER_TXPOWER_Neg1dBm (0xFFUL) /*!< -1 dBm */

/* Register: RADIO_TIFS */
/* Description: Interframe spacing in us */

/* Bits 9..0 : Interframe spacing in us. Interframe space is the time interval between two consecutive packets. It is defined as the time, in microseconds, from the end of the last bit of the previous packet to the start of the first bit of the subsequent packet. */
#define RADIO_TIFS_TIFS_Pos (0UL) /*!< Position of TIFS field. */
#define RADIO_TIFS_TIFS_Msk (0x3FFUL << RADIO_TIFS_TIFS_Pos) /*!< Bit mask of TIFS field. */

/* Register: RADIO_SPHYNXSUPPORTEVENTS */
/* Description: TODO */

/* Bits 21..17 : Transition time from TXDISABLE state to DISABLED state. (unit: 1us) */
#define RADIO_SPHYNXSUPPORTEVENTS_TRxDisable_Pos (17UL) /*!< Position of TRxDisable field. */
#define RADIO_SPHYNXSUPPORTEVENTS_TRxDisable_Msk (0x1FUL << RADIO_SPHYNXSUPPORTEVENTS_TRxDisable_Pos) /*!< Bit mask of TRxDisable field. */

/* Bits 16..12 : Transition time from RXDISABLE state to DISABLED state. (unit: 1us) */
#define RADIO_SPHYNXSUPPORTEVENTS_TTxDisable_Pos (12UL) /*!< Position of TTxDisable field. */
#define RADIO_SPHYNXSUPPORTEVENTS_TTxDisable_Msk (0x1FUL << RADIO_SPHYNXSUPPORTEVENTS_TTxDisable_Pos) /*!< Bit mask of TTxDisable field. */

/* Register: RADIO_CALIBRATION_TARGET */
/* Description: TODO */

/* Bits 2..0 : Calibration target selection for calibration engine. 0: DC_CAL, 1: RC_CAL */
#define RADIO_CALIBRATION_TARGET_CalTarget_Pos (0UL) /*!< Position of CalTarget field. */
#define RADIO_CALIBRATION_TARGET_CalTarget_Msk (0x7UL << RADIO_CALIBRATION_TARGET_CalTarget_Pos) /*!< Bit mask of CalTarget field. */

/* Register: RADIO_CALIBRATION_CONFIG */
/* Description: TODO */

/* Bit 31 : 0: use hard-coded calibration timing, 1: use manual calibration timing above */
#define RADIO_CALIBRATION_CONFIG_CalManual_Pos (31UL) /*!< Position of CalManual field. */
#define RADIO_CALIBRATION_CONFIG_CalManual_Msk (0x1UL << RADIO_CALIBRATION_CONFIG_CalManual_Pos) /*!< Bit mask of CalManual field. */

/* Bit 29 : 1: invert calCmp2 before it goes into calibration engine #2 */
#define RADIO_CALIBRATION_CONFIG_CalInvertCmp2_Pos (29UL) /*!< Position of CalInvertCmp2 field. */
#define RADIO_CALIBRATION_CONFIG_CalInvertCmp2_Msk (0x1UL << RADIO_CALIBRATION_CONFIG_CalInvertCmp2_Pos) /*!< Bit mask of CalInvertCmp2 field. */

/* Bit 28 : 1: invert calCmp1 before it goes into calibration engine #1 */
#define RADIO_CALIBRATION_CONFIG_CalInvertCmp1_Pos (28UL) /*!< Position of CalInvertCmp1 field. */
#define RADIO_CALIBRATION_CONFIG_CalInvertCmp1_Msk (0x1UL << RADIO_CALIBRATION_CONFIG_CalInvertCmp1_Pos) /*!< Bit mask of CalInvertCmp1 field. */

/* Bits 26..24 : Number of valid bits to be calibrated */
#define RADIO_CALIBRATION_CONFIG_CalBits_Pos (24UL) /*!< Position of CalBits field. */
#define RADIO_CALIBRATION_CONFIG_CalBits_Msk (0x7UL << RADIO_CALIBRATION_CONFIG_CalBits_Pos) /*!< Bit mask of CalBits field. */

/* Bits 23..16 : Compare wait time */
#define RADIO_CALIBRATION_CONFIG_CalTcompare_Pos (16UL) /*!< Position of CalTcompare field. */
#define RADIO_CALIBRATION_CONFIG_CalTcompare_Msk (0xFFUL << RADIO_CALIBRATION_CONFIG_CalTcompare_Pos) /*!< Bit mask of CalTcompare field. */

/* Bits 15..8 : Settle wait time */
#define RADIO_CALIBRATION_CONFIG_CalTsettle_Pos (8UL) /*!< Position of CalTsettle field. */
#define RADIO_CALIBRATION_CONFIG_CalTsettle_Msk (0xFFUL << RADIO_CALIBRATION_CONFIG_CalTsettle_Pos) /*!< Bit mask of CalTsettle field. */

