adamkondraciuk/nrfx/mdk/nrf54lilium_network_bitfields.h
/* Bits 7..0 : Startup wait time */
#define RADIO_CALIBRATION_CONFIG_CalTstart_Pos (0UL) /*!< Position of CalTstart field. */
#define RADIO_CALIBRATION_CONFIG_CalTstart_Msk (0xFFUL << RADIO_CALIBRATION_CONFIG_CalTstart_Pos) /*!< Bit mask of CalTstart field. */

/* Register: RADIO_CALIBRATION_RESULT */
/* Description: TODO */

/* Bits 17..11 : Calibration result from DC offset calibration on channel Q */
#define RADIO_CALIBRATION_RESULT_RfMixDcCalQ_Pos (11UL) /*!< Position of RfMixDcCalQ field. */
#define RADIO_CALIBRATION_RESULT_RfMixDcCalQ_Msk (0x7FUL << RADIO_CALIBRATION_RESULT_RfMixDcCalQ_Pos) /*!< Bit mask of RfMixDcCalQ field. */

/* Bits 10..4 : Calibration result from DC offset calibration on channel I */
#define RADIO_CALIBRATION_RESULT_RfMixDcCalI_Pos (4UL) /*!< Position of RfMixDcCalI field. */
#define RADIO_CALIBRATION_RESULT_RfMixDcCalI_Msk (0x7FUL << RADIO_CALIBRATION_RESULT_RfMixDcCalI_Pos) /*!< Bit mask of RfMixDcCalI field. */

/* Bits 3..0 : Calibration result from RC calibration */
#define RADIO_CALIBRATION_RESULT_RcCalCode_Pos (0UL) /*!< Position of RcCalCode field. */
#define RADIO_CALIBRATION_RESULT_RcCalCode_Msk (0xFUL << RADIO_CALIBRATION_RESULT_RcCalCode_Pos) /*!< Bit mask of RcCalCode field. */

/* Register: RADIO_SPHYNXANA_TEST */
/* Description: TODO */

/* Bits 27..26 : Digital test enable for digital logic in analog macro */
#define RADIO_SPHYNXANA_TEST_SphynxDteFs_Pos (26UL) /*!< Position of SphynxDteFs field. */
#define RADIO_SPHYNXANA_TEST_SphynxDteFs_Msk (0x3UL << RADIO_SPHYNXANA_TEST_SphynxDteFs_Pos) /*!< Bit mask of SphynxDteFs field. */

/* Bits 25..24 : Analog test enable for TX PWRCTRL */
#define RADIO_SPHYNXANA_TEST_SphynxAteTxPwrctrl_Pos (24UL) /*!< Position of SphynxAteTxPwrctrl field. */
#define RADIO_SPHYNXANA_TEST_SphynxAteTxPwrctrl_Msk (0x3UL << RADIO_SPHYNXANA_TEST_SphynxAteTxPwrctrl_Pos) /*!< Bit mask of SphynxAteTxPwrctrl field. */

/* Bits 23..19 : Analog test enable for RX TX */
#define RADIO_SPHYNXANA_TEST_SphynxAteRxTx_Pos (19UL) /*!< Position of SphynxAteRxTx field. */
#define RADIO_SPHYNXANA_TEST_SphynxAteRxTx_Msk (0x1FUL << RADIO_SPHYNXANA_TEST_SphynxAteRxTx_Pos) /*!< Bit mask of SphynxAteRxTx field. */

/* Bits 18..13 : Analog test enable for RX AAF */
#define RADIO_SPHYNXANA_TEST_SphynxAteRxAaf_Pos (13UL) /*!< Position of SphynxAteRxAaf field. */
#define RADIO_SPHYNXANA_TEST_SphynxAteRxAaf_Msk (0x3FUL << RADIO_SPHYNXANA_TEST_SphynxAteRxAaf_Pos) /*!< Bit mask of SphynxAteRxAaf field. */

/* Bits 12..11 : Analog test enable for RX MIX */
#define RADIO_SPHYNXANA_TEST_SphynxAteRxmix_Pos (11UL) /*!< Position of SphynxAteRxmix field. */
#define RADIO_SPHYNXANA_TEST_SphynxAteRxmix_Msk (0x3UL << RADIO_SPHYNXANA_TEST_SphynxAteRxmix_Pos) /*!< Bit mask of SphynxAteRxmix field. */

/* Bits 10..4 : Analog test enable for FS */
#define RADIO_SPHYNXANA_TEST_SphynxAteFs_Pos (4UL) /*!< Position of SphynxAteFs field. */
#define RADIO_SPHYNXANA_TEST_SphynxAteFs_Msk (0x7FUL << RADIO_SPHYNXANA_TEST_SphynxAteFs_Pos) /*!< Bit mask of SphynxAteFs field. */

/* Bits 3..0 : Analog test enable for BIAS_FS */
#define RADIO_SPHYNXANA_TEST_SphynxAteBiasfs_Pos (0UL) /*!< Position of SphynxAteBiasfs field. */
#define RADIO_SPHYNXANA_TEST_SphynxAteBiasfs_Msk (0xFUL << RADIO_SPHYNXANA_TEST_SphynxAteBiasfs_Pos) /*!< Bit mask of SphynxAteBiasfs field. */

/* Register: RADIO_SPHYNXANA_FS_CTRL_0 */
/* Description: TODO */

/* Bit 29 : Resync at flip flop inside DTC */
#define RADIO_SPHYNXANA_FS_CTRL_0_SphynxFsDtcEdgeAlign_Pos (29UL) /*!< Position of SphynxFsDtcEdgeAlign field. */
#define RADIO_SPHYNXANA_FS_CTRL_0_SphynxFsDtcEdgeAlign_Msk (0x1UL << RADIO_SPHYNXANA_FS_CTRL_0_SphynxFsDtcEdgeAlign_Pos) /*!< Bit mask of SphynxFsDtcEdgeAlign field. */

/* Bits 28..27 : 0: controls bleed current from supply, 1: bypasses DTC to send XO out directly */
#define RADIO_SPHYNXANA_FS_CTRL_0_SphynxFsDtcCtrl_Pos (27UL) /*!< Position of SphynxFsDtcCtrl field. */
#define RADIO_SPHYNXANA_FS_CTRL_0_SphynxFsDtcCtrl_Msk (0x3UL << RADIO_SPHYNXANA_FS_CTRL_0_SphynxFsDtcCtrl_Pos) /*!< Bit mask of SphynxFsDtcCtrl field. */

/* Bits 26..22 : Change back bias of NMOS in ROSC inside DIV2 */
#define RADIO_SPHYNXANA_FS_CTRL_0_SphynxFsDiv2Osc_Pos (22UL) /*!< Position of SphynxFsDiv2Osc field. */
#define RADIO_SPHYNXANA_FS_CTRL_0_SphynxFsDiv2Osc_Msk (0x1FUL << RADIO_SPHYNXANA_FS_CTRL_0_SphynxFsDiv2Osc_Pos) /*!< Bit mask of SphynxFsDiv2Osc field. */

/* Bits 21..19 : Spare, not used */
#define RADIO_SPHYNXANA_FS_CTRL_0_SphynxFsDiv2Ctrl_Pos (19UL) /*!< Position of SphynxFsDiv2Ctrl field. */
#define RADIO_SPHYNXANA_FS_CTRL_0_SphynxFsDiv2Ctrl_Msk (0x7UL << RADIO_SPHYNXANA_FS_CTRL_0_SphynxFsDiv2Ctrl_Pos) /*!< Bit mask of SphynxFsDiv2Ctrl field. */

/* Bits 18..15 : Set common mode for DIV2 */
#define RADIO_SPHYNXANA_FS_CTRL_0_SphynxFsDiv2Cm_Pos (15UL) /*!< Position of SphynxFsDiv2Cm field. */
#define RADIO_SPHYNXANA_FS_CTRL_0_SphynxFsDiv2Cm_Msk (0xFUL << RADIO_SPHYNXANA_FS_CTRL_0_SphynxFsDiv2Cm_Pos) /*!< Bit mask of SphynxFsDiv2Cm field. */

/* Bits 12..10 : FS swing calibration */
#define RADIO_SPHYNXANA_FS_CTRL_0_SphynxFsvcoSwRef_Pos (10UL) /*!< Position of SphynxFsvcoSwRef field. */
#define RADIO_SPHYNXANA_FS_CTRL_0_SphynxFsvcoSwRef_Msk (0x7UL << RADIO_SPHYNXANA_FS_CTRL_0_SphynxFsvcoSwRef_Pos) /*!< Bit mask of SphynxFsvcoSwRef field. */

/* Bits 9..6 : Spare, not used */
#define RADIO_SPHYNXANA_FS_CTRL_0_SphynxFsvcoCtrl_Pos (6UL) /*!< Position of SphynxFsvcoCtrl field. */
#define RADIO_SPHYNXANA_FS_CTRL_0_SphynxFsvcoCtrl_Msk (0xFUL << RADIO_SPHYNXANA_FS_CTRL_0_SphynxFsvcoCtrl_Pos) /*!< Bit mask of SphynxFsvcoCtrl field. */

/* Bits 5..0 : Bypass FS LDOs */
#define RADIO_SPHYNXANA_FS_CTRL_0_SphynxFsldoBypass_Pos (0UL) /*!< Position of SphynxFsldoBypass field. */
#define RADIO_SPHYNXANA_FS_CTRL_0_SphynxFsldoBypass_Msk (0x3FUL << RADIO_SPHYNXANA_FS_CTRL_0_SphynxFsldoBypass_Pos) /*!< Bit mask of SphynxFsldoBypass field. */

/* Register: RADIO_SPHYNXANA_FS_CTRL_1 */
/* Description: TODO */

/* Bits 20..18 : Spare, not used */
#define RADIO_SPHYNXANA_FS_CTRL_1_SphynxFsTdcCtrl_Pos (18UL) /*!< Position of SphynxFsTdcCtrl field. */
#define RADIO_SPHYNXANA_FS_CTRL_1_SphynxFsTdcCtrl_Msk (0x7UL << RADIO_SPHYNXANA_FS_CTRL_1_SphynxFsTdcCtrl_Pos) /*!< Bit mask of SphynxFsTdcCtrl field. */

/* Bits 13..9 : DFT control/scan-in to AdPll. [4]: arstScan, [3]: scanTest, [2]: scanCk, [1]: scanEn, [0]: scanIn */
#define RADIO_SPHYNXANA_FS_CTRL_1_SphynxFsScanbusIn_Pos (9UL) /*!< Position of SphynxFsScanbusIn field. */
#define RADIO_SPHYNXANA_FS_CTRL_1_SphynxFsScanbusIn_Msk (0x1FUL << RADIO_SPHYNXANA_FS_CTRL_1_SphynxFsScanbusIn_Pos) /*!< Bit mask of SphynxFsScanbusIn field. */

/* Bits 8..5 : For voltage tuning of reference */
#define RADIO_SPHYNXANA_FS_CTRL_1_SphynxFsRefVttrim_Pos (5UL) /*!< Position of SphynxFsRefVttrim field. */
#define RADIO_SPHYNXANA_FS_CTRL_1_SphynxFsRefVttrim_Msk (0xFUL << RADIO_SPHYNXANA_FS_CTRL_1_SphynxFsRefVttrim_Pos) /*!< Bit mask of SphynxFsRefVttrim field. */

