adamkondraciuk/nrfx/mdk/nrf54lilium_network_bitfields.h
/* Bits 4..0 : For current calibration */
#define RADIO_SPHYNXANA_FS_CTRL_1_SphynxFsRefIpptrim_Pos (0UL) /*!< Position of SphynxFsRefIpptrim field. */
#define RADIO_SPHYNXANA_FS_CTRL_1_SphynxFsRefIpptrim_Msk (0x1FUL << RADIO_SPHYNXANA_FS_CTRL_1_SphynxFsRefIpptrim_Pos) /*!< Bit mask of SphynxFsRefIpptrim field. */

/* Register: RADIO_SPHYNXANA_FS_CTRL_2 */
/* Description: TODO */

/* Bits 4..0 : SWAT_TRIM_0V8[2:0] for SWAT_VREF trimming (default is 3b'000) and SWAT_TRIM_0V8[4:3] (default is 2b'00) for IBPSR trimming */
#define RADIO_SPHYNXANA_FS_CTRL_2_SphynxSwatTrim_Pos (0UL) /*!< Position of SphynxSwatTrim field. */
#define RADIO_SPHYNXANA_FS_CTRL_2_SphynxSwatTrim_Msk (0x1FUL << RADIO_SPHYNXANA_FS_CTRL_2_SphynxSwatTrim_Pos) /*!< Bit mask of SphynxSwatTrim field. */

/* Register: RADIO_SPHYNXANA_RX_CTRL */
/* Description: TODO */

/* Bit 20 : TODO */
#define RADIO_SPHYNXANA_RX_CTRL_SphynxAdcTimingCalc_Pos (20UL) /*!< Position of SphynxAdcTimingCalc field. */
#define RADIO_SPHYNXANA_RX_CTRL_SphynxAdcTimingCalc_Msk (0x1UL << RADIO_SPHYNXANA_RX_CTRL_SphynxAdcTimingCalc_Pos) /*!< Bit mask of SphynxAdcTimingCalc field. */

/* Bit 19 : TODO */
#define RADIO_SPHYNXANA_RX_CTRL_SphynxAdcOffsetCalc_Pos (19UL) /*!< Position of SphynxAdcOffsetCalc field. */
#define RADIO_SPHYNXANA_RX_CTRL_SphynxAdcOffsetCalc_Msk (0x1UL << RADIO_SPHYNXANA_RX_CTRL_SphynxAdcOffsetCalc_Pos) /*!< Bit mask of SphynxAdcOffsetCalc field. */

/* Bit 18 : TODO */
#define RADIO_SPHYNXANA_RX_CTRL_SphynxAdcVbulkTrim_Pos (18UL) /*!< Position of SphynxAdcVbulkTrim field. */
#define RADIO_SPHYNXANA_RX_CTRL_SphynxAdcVbulkTrim_Msk (0x1UL << RADIO_SPHYNXANA_RX_CTRL_SphynxAdcVbulkTrim_Pos) /*!< Bit mask of SphynxAdcVbulkTrim field. */

/* Bits 17..15 : TODO */
#define RADIO_SPHYNXANA_RX_CTRL_SphynxLnaCurr_Pos (15UL) /*!< Position of SphynxLnaCurr field. */
#define RADIO_SPHYNXANA_RX_CTRL_SphynxLnaCurr_Msk (0x7UL << RADIO_SPHYNXANA_RX_CTRL_SphynxLnaCurr_Pos) /*!< Bit mask of SphynxLnaCurr field. */

/* Bits 14..11 : TODO */
#define RADIO_SPHYNXANA_RX_CTRL_SphynxLnaCfreq_Pos (11UL) /*!< Position of SphynxLnaCfreq field. */
#define RADIO_SPHYNXANA_RX_CTRL_SphynxLnaCfreq_Msk (0xFUL << RADIO_SPHYNXANA_RX_CTRL_SphynxLnaCfreq_Pos) /*!< Bit mask of SphynxLnaCfreq field. */

/* Bits 10..8 : TODO */
#define RADIO_SPHYNXANA_RX_CTRL_SphynxRxAafVcmTrim_Pos (8UL) /*!< Position of SphynxRxAafVcmTrim field. */
#define RADIO_SPHYNXANA_RX_CTRL_SphynxRxAafVcmTrim_Msk (0x7UL << RADIO_SPHYNXANA_RX_CTRL_SphynxRxAafVcmTrim_Pos) /*!< Bit mask of SphynxRxAafVcmTrim field. */

/* Bits 7..4 : RC trim values for RX_AAF generated by RC_CAL */
#define RADIO_SPHYNXANA_RX_CTRL_SphynxRxAafRctrimm_Pos (4UL) /*!< Position of SphynxRxAafRctrimm field. */
#define RADIO_SPHYNXANA_RX_CTRL_SphynxRxAafRctrimm_Msk (0xFUL << RADIO_SPHYNXANA_RX_CTRL_SphynxRxAafRctrimm_Pos) /*!< Bit mask of SphynxRxAafRctrimm field. */

/* Bit 3 : 1: output from MIX_AMP is Q leading I, 0 output from MIX_AMP is I leading Q. */
#define RADIO_SPHYNXANA_RX_CTRL_SphynxRxmixQleadsi_Pos (3UL) /*!< Position of SphynxRxmixQleadsi field. */
#define RADIO_SPHYNXANA_RX_CTRL_SphynxRxmixQleadsi_Msk (0x1UL << RADIO_SPHYNXANA_RX_CTRL_SphynxRxmixQleadsi_Pos) /*!< Bit mask of SphynxRxmixQleadsi field. */

/* Bits 2..0 : Bypass Rx LDOs. */
#define RADIO_SPHYNXANA_RX_CTRL_SphynxBypassLdoRx_Pos (0UL) /*!< Position of SphynxBypassLdoRx field. */
#define RADIO_SPHYNXANA_RX_CTRL_SphynxBypassLdoRx_Msk (0x7UL << RADIO_SPHYNXANA_RX_CTRL_SphynxBypassLdoRx_Pos) /*!< Bit mask of SphynxBypassLdoRx field. */

/* Register: RADIO_SPHYNXANA_TX_CTRL */
/* Description: TODO */

/* Bits 14..12 : Radio Tx output power fine tune. */
#define RADIO_SPHYNXANA_TX_CTRL_SphynxTxPwrFine_Pos (12UL) /*!< Position of SphynxTxPwrFine field. */
#define RADIO_SPHYNXANA_TX_CTRL_SphynxTxPwrFine_Msk (0x7UL << RADIO_SPHYNXANA_TX_CTRL_SphynxTxPwrFine_Pos) /*!< Bit mask of SphynxTxPwrFine field. */

/* Bits 11..6 : TODO */
#define RADIO_SPHYNXANA_TX_CTRL_SphynxTxPwrctrlTune_Pos (6UL) /*!< Position of SphynxTxPwrctrlTune field. */
#define RADIO_SPHYNXANA_TX_CTRL_SphynxTxPwrctrlTune_Msk (0x3FUL << RADIO_SPHYNXANA_TX_CTRL_SphynxTxPwrctrlTune_Pos) /*!< Bit mask of SphynxTxPwrctrlTune field. */

/* Bits 5..3 : TX PA ramp up/down control. */
#define RADIO_SPHYNXANA_TX_CTRL_SphynxTxPaSramp_Pos (3UL) /*!< Position of SphynxTxPaSramp field. */
#define RADIO_SPHYNXANA_TX_CTRL_SphynxTxPaSramp_Msk (0x7UL << RADIO_SPHYNXANA_TX_CTRL_SphynxTxPaSramp_Pos) /*!< Bit mask of SphynxTxPaSramp field. */

/* Bits 2..0 : Bypass Tx LDOs. */
#define RADIO_SPHYNXANA_TX_CTRL_SphynxBypassLdoTx_Pos (0UL) /*!< Position of SphynxBypassLdoTx field. */
#define RADIO_SPHYNXANA_TX_CTRL_SphynxBypassLdoTx_Msk (0x7UL << RADIO_SPHYNXANA_TX_CTRL_SphynxBypassLdoTx_Pos) /*!< Bit mask of SphynxBypassLdoTx field. */

/* Register: RADIO_SPHYNXANA_MODE_DEPENDENT */
/* Description: TODO */

/* Bit 0 : Select Rx IF frequency. 0: 1Mbps, 1: 2Mbps(4Mbps) */
#define RADIO_SPHYNXANA_MODE_DEPENDENT_SphynxRxAafFreq_Pos (0UL) /*!< Position of SphynxRxAafFreq field. */
#define RADIO_SPHYNXANA_MODE_DEPENDENT_SphynxRxAafFreq_Msk (0x1UL << RADIO_SPHYNXANA_MODE_DEPENDENT_SphynxRxAafFreq_Pos) /*!< Bit mask of SphynxRxAafFreq field. */

/* Register: RADIO_SPHYNXANA_RX_TRIM_CODE */
/* Description: TODO */

/* Bit 23 : For RXMIX_DCCAL_Q_0V8, 0: controlled by CalibrationEngine, 1: overridden by register */
#define RADIO_SPHYNXANA_RX_TRIM_CODE_OvrEnRfMixDcCalQ_Pos (23UL) /*!< Position of OvrEnRfMixDcCalQ field. */
#define RADIO_SPHYNXANA_RX_TRIM_CODE_OvrEnRfMixDcCalQ_Msk (0x1UL << RADIO_SPHYNXANA_RX_TRIM_CODE_OvrEnRfMixDcCalQ_Pos) /*!< Bit mask of OvrEnRfMixDcCalQ field. */

/* Bits 22..16 : Override values on RXMIX_DCCAL_Q_0V8 */
#define RADIO_SPHYNXANA_RX_TRIM_CODE_OvrValRfMixDcCalQ_Pos (16UL) /*!< Position of OvrValRfMixDcCalQ field. */
#define RADIO_SPHYNXANA_RX_TRIM_CODE_OvrValRfMixDcCalQ_Msk (0x7FUL << RADIO_SPHYNXANA_RX_TRIM_CODE_OvrValRfMixDcCalQ_Pos) /*!< Bit mask of OvrValRfMixDcCalQ field. */

/* Bit 15 : For RXMIX_DCCAL_I_0V8, 0: controlled by CalibrationEngine, 1: overridden by register */
#define RADIO_SPHYNXANA_RX_TRIM_CODE_OvrEnRfMixDcCalI_Pos (15UL) /*!< Position of OvrEnRfMixDcCalI field. */
#define RADIO_SPHYNXANA_RX_TRIM_CODE_OvrEnRfMixDcCalI_Msk (0x1UL << RADIO_SPHYNXANA_RX_TRIM_CODE_OvrEnRfMixDcCalI_Pos) /*!< Bit mask of OvrEnRfMixDcCalI field. */

