adamkondraciuk/nrfx/mdk/nrf54lilium_network_bitfields.h
/* Bits 14..8 : Override values on RXMIX_DCCAL_I_0V8 */
#define RADIO_SPHYNXANA_RX_TRIM_CODE_OvrValRfMixDcCalI_Pos (8UL) /*!< Position of OvrValRfMixDcCalI field. */
#define RADIO_SPHYNXANA_RX_TRIM_CODE_OvrValRfMixDcCalI_Msk (0x7FUL << RADIO_SPHYNXANA_RX_TRIM_CODE_OvrValRfMixDcCalI_Pos) /*!< Bit mask of OvrValRfMixDcCalI field. */

/* Bit 7 : For RCCAL_CODE_0V8, 0: controlled by CalibrationEngine, 1: overridden by register */
#define RADIO_SPHYNXANA_RX_TRIM_CODE_OvrEnRcCalCode_Pos (7UL) /*!< Position of OvrEnRcCalCode field. */
#define RADIO_SPHYNXANA_RX_TRIM_CODE_OvrEnRcCalCode_Msk (0x1UL << RADIO_SPHYNXANA_RX_TRIM_CODE_OvrEnRcCalCode_Pos) /*!< Bit mask of OvrEnRcCalCode field. */

/* Bits 3..0 : Override values on RCCAL_CODE_0V8 */
#define RADIO_SPHYNXANA_RX_TRIM_CODE_OvrValRcCalCode_Pos (0UL) /*!< Position of OvrValRcCalCode field. */
#define RADIO_SPHYNXANA_RX_TRIM_CODE_OvrValRcCalCode_Msk (0xFUL << RADIO_SPHYNXANA_RX_TRIM_CODE_OvrValRcCalCode_Pos) /*!< Bit mask of OvrValRcCalCode field. */

/* Register: RADIO_SPHYNXANA_STATUS */
/* Description: TODO */

/* Bit 31 : DFT Scan-out from AdPll */
#define RADIO_SPHYNXANA_STATUS_SphynxFsScanOutAo_Pos (31UL) /*!< Position of SphynxFsScanOutAo field. */
#define RADIO_SPHYNXANA_STATUS_SphynxFsScanOutAo_Msk (0x1UL << RADIO_SPHYNXANA_STATUS_SphynxFsScanOutAo_Pos) /*!< Bit mask of SphynxFsScanOutAo field. */

/* Bits 26..25 : Raw peak detector output from RX_PKDET */
#define RADIO_SPHYNXANA_STATUS_SphynxRxPkdetAo_Pos (25UL) /*!< Position of SphynxRxPkdetAo field. */
#define RADIO_SPHYNXANA_STATUS_SphynxRxPkdetAo_Msk (0x3UL << RADIO_SPHYNXANA_STATUS_SphynxRxPkdetAo_Pos) /*!< Bit mask of SphynxRxPkdetAo field. */

/* Bit 24 : Raw comparator output of DC calibration from RX_AAF Q channel */
#define RADIO_SPHYNXANA_STATUS_SphynxAafDccalQAo_Pos (24UL) /*!< Position of SphynxAafDccalQAo field. */
#define RADIO_SPHYNXANA_STATUS_SphynxAafDccalQAo_Msk (0x1UL << RADIO_SPHYNXANA_STATUS_SphynxAafDccalQAo_Pos) /*!< Bit mask of SphynxAafDccalQAo field. */

/* Bit 23 : Raw comparator output of DC calibration from RX_AAF I channel */
#define RADIO_SPHYNXANA_STATUS_SphynxAafDccalIAo_Pos (23UL) /*!< Position of SphynxAafDccalIAo field. */
#define RADIO_SPHYNXANA_STATUS_SphynxAafDccalIAo_Msk (0x1UL << RADIO_SPHYNXANA_STATUS_SphynxAafDccalIAo_Pos) /*!< Bit mask of SphynxAafDccalIAo field. */

/* Bit 22 : Raw comparator output of RC calibration from RC_CAL */
#define RADIO_SPHYNXANA_STATUS_SphynxCalCmpRccalAo_Pos (22UL) /*!< Position of SphynxCalCmpRccalAo field. */
#define RADIO_SPHYNXANA_STATUS_SphynxCalCmpRccalAo_Msk (0x1UL << RADIO_SPHYNXANA_STATUS_SphynxCalCmpRccalAo_Pos) /*!< Bit mask of SphynxCalCmpRccalAo field. */

/* Bits 21..11 : Raw ADC Q channel output from RX_SAR2 */
#define RADIO_SPHYNXANA_STATUS_SphynxAdcBqAo_Pos (11UL) /*!< Position of SphynxAdcBqAo field. */
#define RADIO_SPHYNXANA_STATUS_SphynxAdcBqAo_Msk (0x7FFUL << RADIO_SPHYNXANA_STATUS_SphynxAdcBqAo_Pos) /*!< Bit mask of SphynxAdcBqAo field. */

/* Bits 10..0 : Raw ADC I channel output from RX_SAR2 */
#define RADIO_SPHYNXANA_STATUS_SphynxAdcBiAo_Pos (0UL) /*!< Position of SphynxAdcBiAo field. */
#define RADIO_SPHYNXANA_STATUS_SphynxAdcBiAo_Msk (0x7FFUL << RADIO_SPHYNXANA_STATUS_SphynxAdcBiAo_Pos) /*!< Bit mask of SphynxAdcBiAo field. */

/* Register: RADIO_TIMINGENGINE_GROUP_ALL_0 */
/* Description: TODO */

/* Bits 31..24 : (unit: 0.25us) Timing control of pwrupRadio[1] */
#define RADIO_TIMINGENGINE_GROUP_ALL_0_TPwrupRadio_Bit1_Pos (24UL) /*!< Position of TPwrupRadio_Bit1 field. */
#define RADIO_TIMINGENGINE_GROUP_ALL_0_TPwrupRadio_Bit1_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_ALL_0_TPwrupRadio_Bit1_Pos) /*!< Bit mask of TPwrupRadio_Bit1 field. */

/* Bits 23..16 : (unit: 0.25us) Timing control of pwrupRadio[0] */
#define RADIO_TIMINGENGINE_GROUP_ALL_0_TPwrupRadio_Bit0_Pos (16UL) /*!< Position of TPwrupRadio_Bit0 field. */
#define RADIO_TIMINGENGINE_GROUP_ALL_0_TPwrupRadio_Bit0_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_ALL_0_TPwrupRadio_Bit0_Pos) /*!< Bit mask of TPwrupRadio_Bit0 field. */

/* Bits 15..8 : (unit: 0.25us) Timing control of retainRadio */
#define RADIO_TIMINGENGINE_GROUP_ALL_0_TRetainRadio_Pos (8UL) /*!< Position of TRetainRadio field. */
#define RADIO_TIMINGENGINE_GROUP_ALL_0_TRetainRadio_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_ALL_0_TRetainRadio_Pos) /*!< Bit mask of TRetainRadio field. */

/* Bits 7..0 : (unit: 0.25us) Timing control of pllSettled */
#define RADIO_TIMINGENGINE_GROUP_ALL_0_TPllSettled_Pos (0UL) /*!< Position of TPllSettled field. */
#define RADIO_TIMINGENGINE_GROUP_ALL_0_TPllSettled_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_ALL_0_TPllSettled_Pos) /*!< Bit mask of TPllSettled field. */

/* Register: RADIO_TIMINGENGINE_GROUP_ALL_1 */
/* Description: TODO */

/* Bits 23..16 : (unit: 0.25us) Timing control of PwrupFsRef[2] */
#define RADIO_TIMINGENGINE_GROUP_ALL_1_TPwrupFsRef_Bit2_Pos (16UL) /*!< Position of TPwrupFsRef_Bit2 field. */
#define RADIO_TIMINGENGINE_GROUP_ALL_1_TPwrupFsRef_Bit2_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_ALL_1_TPwrupFsRef_Bit2_Pos) /*!< Bit mask of TPwrupFsRef_Bit2 field. */

/* Bits 15..8 : (unit: 0.25us) Timing control of PwrupFsRef[1] */
#define RADIO_TIMINGENGINE_GROUP_ALL_1_TPwrupFsRef_Bit1_Pos (8UL) /*!< Position of TPwrupFsRef_Bit1 field. */
#define RADIO_TIMINGENGINE_GROUP_ALL_1_TPwrupFsRef_Bit1_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_ALL_1_TPwrupFsRef_Bit1_Pos) /*!< Bit mask of TPwrupFsRef_Bit1 field. */

/* Bits 7..0 : (unit: 0.25us) Timing control of PwrupFsRef[0] */
#define RADIO_TIMINGENGINE_GROUP_ALL_1_TPwrupFsRef_Bit0_Pos (0UL) /*!< Position of TPwrupFsRef_Bit0 field. */
#define RADIO_TIMINGENGINE_GROUP_ALL_1_TPwrupFsRef_Bit0_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_ALL_1_TPwrupFsRef_Bit0_Pos) /*!< Bit mask of TPwrupFsRef_Bit0 field. */

/* Register: RADIO_TIMINGENGINE_GROUP_ALL_2 */
/* Description: TODO */

/* Bits 31..24 : (unit: 0.25us) Timing control of PwrupFsLdoVco[1] */
#define RADIO_TIMINGENGINE_GROUP_ALL_2_TPwrupFsLdoVco_Bit1_Pos (24UL) /*!< Position of TPwrupFsLdoVco_Bit1 field. */
#define RADIO_TIMINGENGINE_GROUP_ALL_2_TPwrupFsLdoVco_Bit1_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_ALL_2_TPwrupFsLdoVco_Bit1_Pos) /*!< Bit mask of TPwrupFsLdoVco_Bit1 field. */

/* Bits 23..16 : (unit: 0.25us) Timing control of PwrupFsLdoVco[0] */
#define RADIO_TIMINGENGINE_GROUP_ALL_2_TPwrupFsLdoVco_Bit0_Pos (16UL) /*!< Position of TPwrupFsLdoVco_Bit0 field. */
#define RADIO_TIMINGENGINE_GROUP_ALL_2_TPwrupFsLdoVco_Bit0_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_ALL_2_TPwrupFsLdoVco_Bit0_Pos) /*!< Bit mask of TPwrupFsLdoVco_Bit0 field. */

