adamkondraciuk/nrfx/mdk/nrf54lilium_network_bitfields.h
/* Bits 15..8 : (unit: 0.25us) Timing control of RstFsLs[1] */
#define RADIO_TIMINGENGINE_GROUP_ALL_2_TRstFsLs_Bit1_Pos (8UL) /*!< Position of TRstFsLs_Bit1 field. */
#define RADIO_TIMINGENGINE_GROUP_ALL_2_TRstFsLs_Bit1_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_ALL_2_TRstFsLs_Bit1_Pos) /*!< Bit mask of TRstFsLs_Bit1 field. */

/* Bits 7..0 : (unit: 0.25us) Timing control of RstFsLs[0] */
#define RADIO_TIMINGENGINE_GROUP_ALL_2_TRstFsLs_Bit0_Pos (0UL) /*!< Position of TRstFsLs_Bit0 field. */
#define RADIO_TIMINGENGINE_GROUP_ALL_2_TRstFsLs_Bit0_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_ALL_2_TRstFsLs_Bit0_Pos) /*!< Bit mask of TRstFsLs_Bit0 field. */

/* Register: RADIO_TIMINGENGINE_GROUP_ALL_3 */
/* Description: TODO */

/* Bits 31..24 : (unit: 0.25us) Timing control of PwrupFsLdoDig[1] */
#define RADIO_TIMINGENGINE_GROUP_ALL_3_TPwrupFsLdoDig_Bit1_Pos (24UL) /*!< Position of TPwrupFsLdoDig_Bit1 field. */
#define RADIO_TIMINGENGINE_GROUP_ALL_3_TPwrupFsLdoDig_Bit1_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_ALL_3_TPwrupFsLdoDig_Bit1_Pos) /*!< Bit mask of TPwrupFsLdoDig_Bit1 field. */

/* Bits 23..16 : (unit: 0.25us) Timing control of PwrupFsLdoDig[0] */
#define RADIO_TIMINGENGINE_GROUP_ALL_3_TPwrupFsLdoDig_Bit0_Pos (16UL) /*!< Position of TPwrupFsLdoDig_Bit0 field. */
#define RADIO_TIMINGENGINE_GROUP_ALL_3_TPwrupFsLdoDig_Bit0_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_ALL_3_TPwrupFsLdoDig_Bit0_Pos) /*!< Bit mask of TPwrupFsLdoDig_Bit0 field. */

/* Bits 15..8 : (unit: 0.25us) Timing control of PwrupFsLdoDtc[1] */
#define RADIO_TIMINGENGINE_GROUP_ALL_3_TPwrupFsLdoDtc_Bit1_Pos (8UL) /*!< Position of TPwrupFsLdoDtc_Bit1 field. */
#define RADIO_TIMINGENGINE_GROUP_ALL_3_TPwrupFsLdoDtc_Bit1_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_ALL_3_TPwrupFsLdoDtc_Bit1_Pos) /*!< Bit mask of TPwrupFsLdoDtc_Bit1 field. */

/* Bits 7..0 : (unit: 0.25us) Timing control of PwrupFsLdoDtc[0] */
#define RADIO_TIMINGENGINE_GROUP_ALL_3_TPwrupFsLdoDtc_Bit0_Pos (0UL) /*!< Position of TPwrupFsLdoDtc_Bit0 field. */
#define RADIO_TIMINGENGINE_GROUP_ALL_3_TPwrupFsLdoDtc_Bit0_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_ALL_3_TPwrupFsLdoDtc_Bit0_Pos) /*!< Bit mask of TPwrupFsLdoDtc_Bit0 field. */

/* Register: RADIO_TIMINGENGINE_GROUP_ALL_4 */
/* Description: TODO */

/* Bits 31..24 : (unit: 0.25us) Timing control of PwrupFsLdoCnt[1] */
#define RADIO_TIMINGENGINE_GROUP_ALL_4_TPwrupFsLdoCnt_Bit1_Pos (24UL) /*!< Position of TPwrupFsLdoCnt_Bit1 field. */
#define RADIO_TIMINGENGINE_GROUP_ALL_4_TPwrupFsLdoCnt_Bit1_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_ALL_4_TPwrupFsLdoCnt_Bit1_Pos) /*!< Bit mask of TPwrupFsLdoCnt_Bit1 field. */

/* Bits 23..16 : (unit: 0.25us) Timing control of PwrupFsLdoCnt[0] */
#define RADIO_TIMINGENGINE_GROUP_ALL_4_TPwrupFsLdoCnt_Bit0_Pos (16UL) /*!< Position of TPwrupFsLdoCnt_Bit0 field. */
#define RADIO_TIMINGENGINE_GROUP_ALL_4_TPwrupFsLdoCnt_Bit0_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_ALL_4_TPwrupFsLdoCnt_Bit0_Pos) /*!< Bit mask of TPwrupFsLdoCnt_Bit0 field. */

/* Bits 15..8 : (unit: 0.25us) Timing control of PwrupFsLdoDiv[1] */
#define RADIO_TIMINGENGINE_GROUP_ALL_4_TPwrupFsLdoDiv_Bit1_Pos (8UL) /*!< Position of TPwrupFsLdoDiv_Bit1 field. */
#define RADIO_TIMINGENGINE_GROUP_ALL_4_TPwrupFsLdoDiv_Bit1_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_ALL_4_TPwrupFsLdoDiv_Bit1_Pos) /*!< Bit mask of TPwrupFsLdoDiv_Bit1 field. */

/* Bits 7..0 : (unit: 0.25us) Timing control of PwrupFsLdoDiv[0] */
#define RADIO_TIMINGENGINE_GROUP_ALL_4_TPwrupFsLdoDiv_Bit0_Pos (0UL) /*!< Position of TPwrupFsLdoDiv_Bit0 field. */
#define RADIO_TIMINGENGINE_GROUP_ALL_4_TPwrupFsLdoDiv_Bit0_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_ALL_4_TPwrupFsLdoDiv_Bit0_Pos) /*!< Bit mask of TPwrupFsLdoDiv_Bit0 field. */

/* Register: RADIO_TIMINGENGINE_GROUP_ALL_5 */
/* Description: TODO */

/* Bits 31..24 : (unit: 0.25us) Timing control of FsStart */
#define RADIO_TIMINGENGINE_GROUP_ALL_5_TFsStart_Pos (24UL) /*!< Position of TFsStart field. */
#define RADIO_TIMINGENGINE_GROUP_ALL_5_TFsStart_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_ALL_5_TFsStart_Pos) /*!< Bit mask of TFsStart field. */

/* Bits 23..16 : (unit: 0.25us) Timing control of ArstFs */
#define RADIO_TIMINGENGINE_GROUP_ALL_5_TArstFs_Pos (16UL) /*!< Position of TArstFs field. */
#define RADIO_TIMINGENGINE_GROUP_ALL_5_TArstFs_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_ALL_5_TArstFs_Pos) /*!< Bit mask of TArstFs field. */

/* Bits 15..8 : (unit: 0.25us) Timing control of PwrupFsLdoTdc[1] */
#define RADIO_TIMINGENGINE_GROUP_ALL_5_TPwrupFsLdoTdc_Bit1_Pos (8UL) /*!< Position of TPwrupFsLdoTdc_Bit1 field. */
#define RADIO_TIMINGENGINE_GROUP_ALL_5_TPwrupFsLdoTdc_Bit1_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_ALL_5_TPwrupFsLdoTdc_Bit1_Pos) /*!< Bit mask of TPwrupFsLdoTdc_Bit1 field. */

/* Bits 7..0 : (unit: 0.25us) Timing control of PwrupFsLdoTdc[0] */
#define RADIO_TIMINGENGINE_GROUP_ALL_5_TPwrupFsLdoTdc_Bit0_Pos (0UL) /*!< Position of TPwrupFsLdoTdc_Bit0 field. */
#define RADIO_TIMINGENGINE_GROUP_ALL_5_TPwrupFsLdoTdc_Bit0_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_ALL_5_TPwrupFsLdoTdc_Bit0_Pos) /*!< Bit mask of TPwrupFsLdoTdc_Bit0 field. */

/* Register: RADIO_TIMINGENGINE_GROUP_ALL_6 */
/* Description: TODO */

/* Bits 31..24 : (unit: 0.25us) Timing control of PwrupFsDiv2 */
#define RADIO_TIMINGENGINE_GROUP_ALL_6_TPwrupFsDiv2_Pos (24UL) /*!< Position of TPwrupFsDiv2 field. */
#define RADIO_TIMINGENGINE_GROUP_ALL_6_TPwrupFsDiv2_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_ALL_6_TPwrupFsDiv2_Pos) /*!< Bit mask of TPwrupFsDiv2 field. */

/* Bits 23..16 : (unit: 0.25us) Timing control of PwrupFsVco */
#define RADIO_TIMINGENGINE_GROUP_ALL_6_TPwrupFsVco_Pos (16UL) /*!< Position of TPwrupFsVco field. */
#define RADIO_TIMINGENGINE_GROUP_ALL_6_TPwrupFsVco_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_ALL_6_TPwrupFsVco_Pos) /*!< Bit mask of TPwrupFsVco field. */

/* Bits 15..8 : (unit: 0.25us) Timing control of PwrupFsTdc */
#define RADIO_TIMINGENGINE_GROUP_ALL_6_TPwrupFsTdc_Pos (8UL) /*!< Position of TPwrupFsTdc field. */
#define RADIO_TIMINGENGINE_GROUP_ALL_6_TPwrupFsTdc_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_ALL_6_TPwrupFsTdc_Pos) /*!< Bit mask of TPwrupFsTdc field. */

/* Bits 7..0 : (unit: 0.25us) Timing control of PwrupFsDtc */
#define RADIO_TIMINGENGINE_GROUP_ALL_6_TPwrupFsDtc_Pos (0UL) /*!< Position of TPwrupFsDtc field. */
#define RADIO_TIMINGENGINE_GROUP_ALL_6_TPwrupFsDtc_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_ALL_6_TPwrupFsDtc_Pos) /*!< Bit mask of TPwrupFsDtc field. */

/* Register: RADIO_TIMINGENGINE_GROUP_ALL_7 */
/* Description: TODO */

/* Bits 31..24 : (unit: 0.25us) Timing control of PwrupRxTxRef[2] */
#define RADIO_TIMINGENGINE_GROUP_ALL_7_TPwrupRxTxRef_Bit2_Pos (24UL) /*!< Position of TPwrupRxTxRef_Bit2 field. */
#define RADIO_TIMINGENGINE_GROUP_ALL_7_TPwrupRxTxRef_Bit2_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_ALL_7_TPwrupRxTxRef_Bit2_Pos) /*!< Bit mask of TPwrupRxTxRef_Bit2 field. */

/* Bits 23..16 : (unit: 0.25us) Timing control of PwrupRxTxRef[1] */
#define RADIO_TIMINGENGINE_GROUP_ALL_7_TPwrupRxTxRef_Bit1_Pos (16UL) /*!< Position of TPwrupRxTxRef_Bit1 field. */
#define RADIO_TIMINGENGINE_GROUP_ALL_7_TPwrupRxTxRef_Bit1_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_ALL_7_TPwrupRxTxRef_Bit1_Pos) /*!< Bit mask of TPwrupRxTxRef_Bit1 field. */

