adamkondraciuk/nrfx/mdk/nrf54lilium_network_bitfields.h
/* Bits 15..8 : (unit: 0.25us) Timing control of PwrupRxTxRef[0] */
#define RADIO_TIMINGENGINE_GROUP_ALL_7_TPwrupRxTxRef_Bit0_Pos (8UL) /*!< Position of TPwrupRxTxRef_Bit0 field. */
#define RADIO_TIMINGENGINE_GROUP_ALL_7_TPwrupRxTxRef_Bit0_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_ALL_7_TPwrupRxTxRef_Bit0_Pos) /*!< Bit mask of TPwrupRxTxRef_Bit0 field. */

/* Bits 7..0 : (unit: 0.25us) Timing control of PwrupFsDiv2g4Counter */
#define RADIO_TIMINGENGINE_GROUP_ALL_7_TPwrupFsDiv2g4Counter_Pos (0UL) /*!< Position of TPwrupFsDiv2g4Counter field. */
#define RADIO_TIMINGENGINE_GROUP_ALL_7_TPwrupFsDiv2g4Counter_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_ALL_7_TPwrupFsDiv2g4Counter_Pos) /*!< Bit mask of TPwrupFsDiv2g4Counter field. */

/* Register: RADIO_TIMINGENGINE_GROUP_ALL_8 */
/* Description: TODO */

/* Bits 7..0 : (unit: 0.25us) Timing control of RstFsLs[2] */
#define RADIO_TIMINGENGINE_GROUP_ALL_8_TRstFsLs_Bit2_Pos (0UL) /*!< Position of TRstFsLs_Bit2 field. */
#define RADIO_TIMINGENGINE_GROUP_ALL_8_TRstFsLs_Bit2_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_ALL_8_TRstFsLs_Bit2_Pos) /*!< Bit mask of TRstFsLs_Bit2 field. */

/* Register: RADIO_TIMINGENGINE_MODE_DEPENDENT */
/* Description: TODO */

/* Bits 31..24 : (unit: 0.25us) Timing control of DeltaPwrdnPa */
#define RADIO_TIMINGENGINE_MODE_DEPENDENT_TDeltaPwrdnPa_Pos (24UL) /*!< Position of TDeltaPwrdnPa field. */
#define RADIO_TIMINGENGINE_MODE_DEPENDENT_TDeltaPwrdnPa_Msk (0xFFUL << RADIO_TIMINGENGINE_MODE_DEPENDENT_TDeltaPwrdnPa_Pos) /*!< Bit mask of TDeltaPwrdnPa field. */

/* Bits 23..16 : (unit: 0.25us) Timing control of DeltaPipe */
#define RADIO_TIMINGENGINE_MODE_DEPENDENT_TDeltaPipe_Pos (16UL) /*!< Position of TDeltaPipe field. */
#define RADIO_TIMINGENGINE_MODE_DEPENDENT_TDeltaPipe_Msk (0xFFUL << RADIO_TIMINGENGINE_MODE_DEPENDENT_TDeltaPipe_Pos) /*!< Bit mask of TDeltaPipe field. */

/* Bits 12..8 : (unit: 0.25us) Timing control of IfsDeltaPlus */
#define RADIO_TIMINGENGINE_MODE_DEPENDENT_TIfsDeltaPlus_Pos (8UL) /*!< Position of TIfsDeltaPlus field. */
#define RADIO_TIMINGENGINE_MODE_DEPENDENT_TIfsDeltaPlus_Msk (0x1FUL << RADIO_TIMINGENGINE_MODE_DEPENDENT_TIfsDeltaPlus_Pos) /*!< Bit mask of TIfsDeltaPlus field. */

/* Bits 7..0 : (unit: 0.25us) Timing control of IfsDelta */
#define RADIO_TIMINGENGINE_MODE_DEPENDENT_TIfsDelta_Pos (0UL) /*!< Position of TIfsDelta field. */
#define RADIO_TIMINGENGINE_MODE_DEPENDENT_TIfsDelta_Msk (0xFFUL << RADIO_TIMINGENGINE_MODE_DEPENDENT_TIfsDelta_Pos) /*!< Bit mask of TIfsDelta field. */

/* Register: RADIO_TIMINGENGINE_GROUP_RX_0 */
/* Description: TODO */

/* Bits 31..24 : (unit: 0.25us) Timing control of PwrupRxLdo[1] */
#define RADIO_TIMINGENGINE_GROUP_RX_0_TPwrupRxLdo_Bit1_Pos (24UL) /*!< Position of TPwrupRxLdo_Bit1 field. */
#define RADIO_TIMINGENGINE_GROUP_RX_0_TPwrupRxLdo_Bit1_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_RX_0_TPwrupRxLdo_Bit1_Pos) /*!< Bit mask of TPwrupRxLdo_Bit1 field. */

/* Bits 23..16 : (unit: 0.25us) Timing control of PwrupRxLdo[0] */
#define RADIO_TIMINGENGINE_GROUP_RX_0_TPwrupRxLdo_Bit0_Pos (16UL) /*!< Position of TPwrupRxLdo_Bit0 field. */
#define RADIO_TIMINGENGINE_GROUP_RX_0_TPwrupRxLdo_Bit0_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_RX_0_TPwrupRxLdo_Bit0_Pos) /*!< Bit mask of TPwrupRxLdo_Bit0 field. */

/* Bits 15..8 : (unit: 0.25us) Timing control of RstRxLs[1] */
#define RADIO_TIMINGENGINE_GROUP_RX_0_TRstRxLs_Bit1_Pos (8UL) /*!< Position of TRstRxLs_Bit1 field. */
#define RADIO_TIMINGENGINE_GROUP_RX_0_TRstRxLs_Bit1_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_RX_0_TRstRxLs_Bit1_Pos) /*!< Bit mask of TRstRxLs_Bit1 field. */

/* Bits 7..0 : (unit: 0.25us) Timing control of RstRxLs[0] */
#define RADIO_TIMINGENGINE_GROUP_RX_0_TRstRxLs_Bit0_Pos (0UL) /*!< Position of TRstRxLs_Bit0 field. */
#define RADIO_TIMINGENGINE_GROUP_RX_0_TRstRxLs_Bit0_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_RX_0_TRstRxLs_Bit0_Pos) /*!< Bit mask of TRstRxLs_Bit0 field. */

/* Register: RADIO_TIMINGENGINE_GROUP_RX_1 */
/* Description: TODO */

/* Bits 31..24 : (unit: 0.25us) Timing control of PwrupRxLdo[5] */
#define RADIO_TIMINGENGINE_GROUP_RX_1_TPwrupRxLdo_Bit5_Pos (24UL) /*!< Position of TPwrupRxLdo_Bit5 field. */
#define RADIO_TIMINGENGINE_GROUP_RX_1_TPwrupRxLdo_Bit5_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_RX_1_TPwrupRxLdo_Bit5_Pos) /*!< Bit mask of TPwrupRxLdo_Bit5 field. */

/* Bits 23..16 : (unit: 0.25us) Timing control of PwrupRxLdo[4] */
#define RADIO_TIMINGENGINE_GROUP_RX_1_TPwrupRxLdo_Bit4_Pos (16UL) /*!< Position of TPwrupRxLdo_Bit4 field. */
#define RADIO_TIMINGENGINE_GROUP_RX_1_TPwrupRxLdo_Bit4_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_RX_1_TPwrupRxLdo_Bit4_Pos) /*!< Bit mask of TPwrupRxLdo_Bit4 field. */

/* Bits 15..8 : (unit: 0.25us) Timing control of PwrupRxLdo[3] */
#define RADIO_TIMINGENGINE_GROUP_RX_1_TPwrupRxLdo_Bit3_Pos (8UL) /*!< Position of TPwrupRxLdo_Bit3 field. */
#define RADIO_TIMINGENGINE_GROUP_RX_1_TPwrupRxLdo_Bit3_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_RX_1_TPwrupRxLdo_Bit3_Pos) /*!< Bit mask of TPwrupRxLdo_Bit3 field. */

/* Bits 7..0 : (unit: 0.25us) Timing control of PwrupRxLdo[2] */
#define RADIO_TIMINGENGINE_GROUP_RX_1_TPwrupRxLdo_Bit2_Pos (0UL) /*!< Position of TPwrupRxLdo_Bit2 field. */
#define RADIO_TIMINGENGINE_GROUP_RX_1_TPwrupRxLdo_Bit2_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_RX_1_TPwrupRxLdo_Bit2_Pos) /*!< Bit mask of TPwrupRxLdo_Bit2 field. */

/* Register: RADIO_TIMINGENGINE_GROUP_RX_2 */
/* Description: TODO */

/* Bits 31..24 : (unit: 0.25us) Timing control of PwrupRxAaf */
#define RADIO_TIMINGENGINE_GROUP_RX_2_TPwrupRxAaf_Pos (24UL) /*!< Position of TPwrupRxAaf field. */
#define RADIO_TIMINGENGINE_GROUP_RX_2_TPwrupRxAaf_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_RX_2_TPwrupRxAaf_Pos) /*!< Bit mask of TPwrupRxAaf field. */

/* Bits 23..16 : (unit: 0.25us) Timing control of PwrupRx */
#define RADIO_TIMINGENGINE_GROUP_RX_2_TPwrupRx_Pos (16UL) /*!< Position of TPwrupRx field. */
#define RADIO_TIMINGENGINE_GROUP_RX_2_TPwrupRx_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_RX_2_TPwrupRx_Pos) /*!< Bit mask of TPwrupRx field. */

/* Bits 15..8 : (unit: 0.25us) Timing control of PwrupRxMix */
#define RADIO_TIMINGENGINE_GROUP_RX_2_TPwrupRxMix_Pos (8UL) /*!< Position of TPwrupRxMix field. */
#define RADIO_TIMINGENGINE_GROUP_RX_2_TPwrupRxMix_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_RX_2_TPwrupRxMix_Pos) /*!< Bit mask of TPwrupRxMix field. */

/* Bits 7..0 : (unit: 0.25us) Timing control of PwrupRxLna */
#define RADIO_TIMINGENGINE_GROUP_RX_2_TPwrupRxLna_Pos (0UL) /*!< Position of TPwrupRxLna field. */
#define RADIO_TIMINGENGINE_GROUP_RX_2_TPwrupRxLna_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_RX_2_TPwrupRxLna_Pos) /*!< Bit mask of TPwrupRxLna field. */

/* Register: RADIO_TIMINGENGINE_GROUP_RX_3 */
/* Description: TODO */

/* Bits 31..24 : (unit: 0.25us) Timing control of PwrupExtLna */
#define RADIO_TIMINGENGINE_GROUP_RX_3_TPwrupExtLna_Pos (24UL) /*!< Position of TPwrupExtLna field. */
#define RADIO_TIMINGENGINE_GROUP_RX_3_TPwrupExtLna_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_RX_3_TPwrupExtLna_Pos) /*!< Bit mask of TPwrupExtLna field. */

/* Bits 23..16 : Spare register. Power up peak detector is now tied with power up mixer. */
#define RADIO_TIMINGENGINE_GROUP_RX_3_TPwrupRxPkd_Pos (16UL) /*!< Position of TPwrupRxPkd field. */
#define RADIO_TIMINGENGINE_GROUP_RX_3_TPwrupRxPkd_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_RX_3_TPwrupRxPkd_Pos) /*!< Bit mask of TPwrupRxPkd field. */

