adamkondraciuk/nrfx/mdk/nrf54lilium_network_bitfields.h
/* Bits 15..8 : (unit: 0.25us) Timing control of PwrupRxSar[1] */
#define RADIO_TIMINGENGINE_GROUP_RX_3_TPwrupRxSar_Bit1_Pos (8UL) /*!< Position of TPwrupRxSar_Bit1 field. */
#define RADIO_TIMINGENGINE_GROUP_RX_3_TPwrupRxSar_Bit1_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_RX_3_TPwrupRxSar_Bit1_Pos) /*!< Bit mask of TPwrupRxSar_Bit1 field. */

/* Bits 7..0 : (unit: 0.25us) Timing control of PwrupRxSar[0] */
#define RADIO_TIMINGENGINE_GROUP_RX_3_TPwrupRxSar_Bit0_Pos (0UL) /*!< Position of TPwrupRxSar_Bit0 field. */
#define RADIO_TIMINGENGINE_GROUP_RX_3_TPwrupRxSar_Bit0_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_RX_3_TPwrupRxSar_Bit0_Pos) /*!< Bit mask of TPwrupRxSar_Bit0 field. */

/* Register: RADIO_TIMINGENGINE_GROUP_RX_4 */
/* Description: TODO */

/* Bits 31..24 : (unit: 0.25us) Timing control of RxDigEn */
#define RADIO_TIMINGENGINE_GROUP_RX_4_TRxDigEn_Pos (24UL) /*!< Position of TRxDigEn field. */
#define RADIO_TIMINGENGINE_GROUP_RX_4_TRxDigEn_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_RX_4_TRxDigEn_Pos) /*!< Bit mask of TRxDigEn field. */

/* Bits 23..16 : (unit: 0.25us) Timing control of RxAgcEn */
#define RADIO_TIMINGENGINE_GROUP_RX_4_TRxAgcEn_Pos (16UL) /*!< Position of TRxAgcEn field. */
#define RADIO_TIMINGENGINE_GROUP_RX_4_TRxAgcEn_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_RX_4_TRxAgcEn_Pos) /*!< Bit mask of TRxAgcEn field. */

/* Bits 15..8 : (unit: 0.25us) Timing control of ArstAdcEnd */
#define RADIO_TIMINGENGINE_GROUP_RX_4_TArstAdcEnd_Pos (8UL) /*!< Position of TArstAdcEnd field. */
#define RADIO_TIMINGENGINE_GROUP_RX_4_TArstAdcEnd_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_RX_4_TArstAdcEnd_Pos) /*!< Bit mask of TArstAdcEnd field. */

/* Bits 7..0 : (unit: 0.25us) Timing control of ArstAdc */
#define RADIO_TIMINGENGINE_GROUP_RX_4_TArstAdc_Pos (0UL) /*!< Position of TArstAdc field. */
#define RADIO_TIMINGENGINE_GROUP_RX_4_TArstAdc_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_RX_4_TArstAdc_Pos) /*!< Bit mask of TArstAdc field. */

/* Register: RADIO_TIMINGENGINE_GROUP_TX_0 */
/* Description: TODO */

/* Bits 31..24 : (unit: 0.25us) Timing control of PwrupTxLdo[3] */
#define RADIO_TIMINGENGINE_GROUP_TX_0_TPwrupTxLdo_Bit3_Pos (24UL) /*!< Position of TPwrupTxLdo_Bit3 field. */
#define RADIO_TIMINGENGINE_GROUP_TX_0_TPwrupTxLdo_Bit3_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_TX_0_TPwrupTxLdo_Bit3_Pos) /*!< Bit mask of TPwrupTxLdo_Bit3 field. */

/* Bits 23..16 : (unit: 0.25us) Timing control of PwrupTxLdo[2] */
#define RADIO_TIMINGENGINE_GROUP_TX_0_TPwrupTxLdo_Bit2_Pos (16UL) /*!< Position of TPwrupTxLdo_Bit2 field. */
#define RADIO_TIMINGENGINE_GROUP_TX_0_TPwrupTxLdo_Bit2_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_TX_0_TPwrupTxLdo_Bit2_Pos) /*!< Bit mask of TPwrupTxLdo_Bit2 field. */

/* Bits 15..8 : (unit: 0.25us) Timing control of PwrupTxLdo[1] */
#define RADIO_TIMINGENGINE_GROUP_TX_0_TPwrupTxLdo_Bit1_Pos (8UL) /*!< Position of TPwrupTxLdo_Bit1 field. */
#define RADIO_TIMINGENGINE_GROUP_TX_0_TPwrupTxLdo_Bit1_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_TX_0_TPwrupTxLdo_Bit1_Pos) /*!< Bit mask of TPwrupTxLdo_Bit1 field. */

/* Bits 7..0 : (unit: 0.25us) Timing control of PwrupTxLdo[0] */
#define RADIO_TIMINGENGINE_GROUP_TX_0_TPwrupTxLdo_Bit0_Pos (0UL) /*!< Position of TPwrupTxLdo_Bit0 field. */
#define RADIO_TIMINGENGINE_GROUP_TX_0_TPwrupTxLdo_Bit0_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_TX_0_TPwrupTxLdo_Bit0_Pos) /*!< Bit mask of TPwrupTxLdo_Bit0 field. */

/* Register: RADIO_TIMINGENGINE_GROUP_TX_1 */
/* Description: TODO */

/* Bits 31..24 : (unit: 0.25us) Timing control of PwrupTxPwrCtrl */
#define RADIO_TIMINGENGINE_GROUP_TX_1_TPwrupTxPwrCtrl_Pos (24UL) /*!< Position of TPwrupTxPwrCtrl field. */
#define RADIO_TIMINGENGINE_GROUP_TX_1_TPwrupTxPwrCtrl_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_TX_1_TPwrupTxPwrCtrl_Pos) /*!< Bit mask of TPwrupTxPwrCtrl field. */

/* Bits 23..16 : (unit: 0.25us) Timing control of PwrupTx */
#define RADIO_TIMINGENGINE_GROUP_TX_1_TPwrupTx_Pos (16UL) /*!< Position of TPwrupTx field. */
#define RADIO_TIMINGENGINE_GROUP_TX_1_TPwrupTx_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_TX_1_TPwrupTx_Pos) /*!< Bit mask of TPwrupTx field. */

/* Bits 15..8 : (unit: 0.25us) Timing control of PwrupTxLdo[5] */
#define RADIO_TIMINGENGINE_GROUP_TX_1_TPwrupTxLdo_Bit5_Pos (8UL) /*!< Position of TPwrupTxLdo_Bit5 field. */
#define RADIO_TIMINGENGINE_GROUP_TX_1_TPwrupTxLdo_Bit5_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_TX_1_TPwrupTxLdo_Bit5_Pos) /*!< Bit mask of TPwrupTxLdo_Bit5 field. */

/* Bits 7..0 : (unit: 0.25us) Timing control of PwrupTxLdo[4] */
#define RADIO_TIMINGENGINE_GROUP_TX_1_TPwrupTxLdo_Bit4_Pos (0UL) /*!< Position of TPwrupTxLdo_Bit4 field. */
#define RADIO_TIMINGENGINE_GROUP_TX_1_TPwrupTxLdo_Bit4_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_TX_1_TPwrupTxLdo_Bit4_Pos) /*!< Bit mask of TPwrupTxLdo_Bit4 field. */

/* Register: RADIO_TIMINGENGINE_GROUP_TX_2 */
/* Description: TODO */

/* Bits 15..8 : (unit: 0.25us) Timing control of PwrupExtPa */
#define RADIO_TIMINGENGINE_GROUP_TX_2_TPwrupExtPa_Pos (8UL) /*!< Position of TPwrupExtPa field. */
#define RADIO_TIMINGENGINE_GROUP_TX_2_TPwrupExtPa_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_TX_2_TPwrupExtPa_Pos) /*!< Bit mask of TPwrupExtPa field. */

/* Bits 7..0 : (unit: 0.25us) Timing control of PwrupTxPa */
#define RADIO_TIMINGENGINE_GROUP_TX_2_TPwrupTxPa_Pos (0UL) /*!< Position of TPwrupTxPa field. */
#define RADIO_TIMINGENGINE_GROUP_TX_2_TPwrupTxPa_Msk (0xFFUL << RADIO_TIMINGENGINE_GROUP_TX_2_TPwrupTxPa_Pos) /*!< Bit mask of TPwrupTxPa field. */

/* Register: RADIO_TIMINGENGINE_CONFIG */
/* Description: TODO */

/* Bit 31 : In legacy timing mode, pwrupExtPa can be powered on before starting to ramp up by setting this registers to 1. */
#define RADIO_TIMINGENGINE_CONFIG_PwrupExtPaBeforeRampUp_Pos (31UL) /*!< Position of PwrupExtPaBeforeRampUp field. */
#define RADIO_TIMINGENGINE_CONFIG_PwrupExtPaBeforeRampUp_Msk (0x1UL << RADIO_TIMINGENGINE_CONFIG_PwrupExtPaBeforeRampUp_Pos) /*!< Bit mask of PwrupExtPaBeforeRampUp field. */

/* Bit 30 : In legacy timing mode, pwrupExtLna can be powered on before starting to ramp up by setting this registers to 1. */
#define RADIO_TIMINGENGINE_CONFIG_PwrupExtLnaBeforeRampUp_Pos (30UL) /*!< Position of PwrupExtLnaBeforeRampUp field. */
#define RADIO_TIMINGENGINE_CONFIG_PwrupExtLnaBeforeRampUp_Msk (0x1UL << RADIO_TIMINGENGINE_CONFIG_PwrupExtLnaBeforeRampUp_Pos) /*!< Bit mask of PwrupExtLnaBeforeRampUp field. */

/* Bits 17..8 : (unit: 0.25us) Additional delay to hold Tx/Rx turnaround */
#define RADIO_TIMINGENGINE_CONFIG_TrxTxTurnAroundHold_Pos (8UL) /*!< Position of TrxTxTurnAroundHold field. */
#define RADIO_TIMINGENGINE_CONFIG_TrxTxTurnAroundHold_Msk (0x3FFUL << RADIO_TIMINGENGINE_CONFIG_TrxTxTurnAroundHold_Pos) /*!< Bit mask of TrxTxTurnAroundHold field. */

