adamkondraciuk/nrfx/mdk/nrf54lilium_network_bitfields.h
/* Bits 7..0 : (unit: 0.25us) Reduced timing for on-the-fly switch on both Rx-&gt;Tx and Tx-&gt;Rx */
#define RADIO_TIMINGENGINE_CONFIG_TReduceTrxSwitch_Pos (0UL) /*!< Position of TReduceTrxSwitch field. */
#define RADIO_TIMINGENGINE_CONFIG_TReduceTrxSwitch_Msk (0xFFUL << RADIO_TIMINGENGINE_CONFIG_TReduceTrxSwitch_Pos) /*!< Bit mask of TReduceTrxSwitch field. */

/* Register: RADIO_TIMINGENGINE_OVR_EN_GROUP_ALL */
/* Description: TODO */

/* Bits 30..28 : Override enable of PwrupRxTxRef */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_ALL_OvrEnPwrupRxTxRef_Pos (28UL) /*!< Position of OvrEnPwrupRxTxRef field. */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_ALL_OvrEnPwrupRxTxRef_Msk (0x7UL << RADIO_TIMINGENGINE_OVR_EN_GROUP_ALL_OvrEnPwrupRxTxRef_Pos) /*!< Bit mask of OvrEnPwrupRxTxRef field. */

/* Bit 27 : Override enable of FsStart */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_ALL_OvrEnFsStart_Pos (27UL) /*!< Position of OvrEnFsStart field. */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_ALL_OvrEnFsStart_Msk (0x1UL << RADIO_TIMINGENGINE_OVR_EN_GROUP_ALL_OvrEnFsStart_Pos) /*!< Bit mask of OvrEnFsStart field. */

/* Bit 26 : Override enable of ArstFs */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_ALL_OvrEnArstFs_Pos (26UL) /*!< Position of OvrEnArstFs field. */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_ALL_OvrEnArstFs_Msk (0x1UL << RADIO_TIMINGENGINE_OVR_EN_GROUP_ALL_OvrEnArstFs_Pos) /*!< Bit mask of OvrEnArstFs field. */

/* Bit 25 : Override enable of PwrupFsDiv2g4Counter */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_ALL_OvrEnPwrupFsDiv2g4Counter_Pos (25UL) /*!< Position of OvrEnPwrupFsDiv2g4Counter field. */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_ALL_OvrEnPwrupFsDiv2g4Counter_Msk (0x1UL << RADIO_TIMINGENGINE_OVR_EN_GROUP_ALL_OvrEnPwrupFsDiv2g4Counter_Pos) /*!< Bit mask of OvrEnPwrupFsDiv2g4Counter field. */

/* Bit 24 : Override enable of PwrupFsDiv2 */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_ALL_OvrEnPwrupFsDiv2_Pos (24UL) /*!< Position of OvrEnPwrupFsDiv2 field. */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_ALL_OvrEnPwrupFsDiv2_Msk (0x1UL << RADIO_TIMINGENGINE_OVR_EN_GROUP_ALL_OvrEnPwrupFsDiv2_Pos) /*!< Bit mask of OvrEnPwrupFsDiv2 field. */

/* Bit 23 : Override enable of PwrupFsVco */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_ALL_OvrEnPwrupFsVco_Pos (23UL) /*!< Position of OvrEnPwrupFsVco field. */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_ALL_OvrEnPwrupFsVco_Msk (0x1UL << RADIO_TIMINGENGINE_OVR_EN_GROUP_ALL_OvrEnPwrupFsVco_Pos) /*!< Bit mask of OvrEnPwrupFsVco field. */

/* Bit 22 : Override enable of PwrupFsTdc */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_ALL_OvrEnPwrupFsTdc_Pos (22UL) /*!< Position of OvrEnPwrupFsTdc field. */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_ALL_OvrEnPwrupFsTdc_Msk (0x1UL << RADIO_TIMINGENGINE_OVR_EN_GROUP_ALL_OvrEnPwrupFsTdc_Pos) /*!< Bit mask of OvrEnPwrupFsTdc field. */

/* Bit 21 : Override enable of PwrupFsDtc */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_ALL_OvrEnPwrupFsDtc_Pos (21UL) /*!< Position of OvrEnPwrupFsDtc field. */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_ALL_OvrEnPwrupFsDtc_Msk (0x1UL << RADIO_TIMINGENGINE_OVR_EN_GROUP_ALL_OvrEnPwrupFsDtc_Pos) /*!< Bit mask of OvrEnPwrupFsDtc field. */

/* Bits 20..19 : Override enable of PwrupFsLdoTdc */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_ALL_OvrEnPwrupFsLdoTdc_Pos (19UL) /*!< Position of OvrEnPwrupFsLdoTdc field. */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_ALL_OvrEnPwrupFsLdoTdc_Msk (0x3UL << RADIO_TIMINGENGINE_OVR_EN_GROUP_ALL_OvrEnPwrupFsLdoTdc_Pos) /*!< Bit mask of OvrEnPwrupFsLdoTdc field. */

/* Bits 18..17 : Override enable of PwrupFsLdoCnt */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_ALL_OvrEnPwrupFsLdoCnt_Pos (17UL) /*!< Position of OvrEnPwrupFsLdoCnt field. */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_ALL_OvrEnPwrupFsLdoCnt_Msk (0x3UL << RADIO_TIMINGENGINE_OVR_EN_GROUP_ALL_OvrEnPwrupFsLdoCnt_Pos) /*!< Bit mask of OvrEnPwrupFsLdoCnt field. */

/* Bits 16..15 : Override enable of PwrupFsLdoDiv */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_ALL_OvrEnPwrupFsLdoDiv_Pos (15UL) /*!< Position of OvrEnPwrupFsLdoDiv field. */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_ALL_OvrEnPwrupFsLdoDiv_Msk (0x3UL << RADIO_TIMINGENGINE_OVR_EN_GROUP_ALL_OvrEnPwrupFsLdoDiv_Pos) /*!< Bit mask of OvrEnPwrupFsLdoDiv field. */

/* Bits 14..13 : Override enable of PwrupFsLdoDig */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_ALL_OvrEnPwrupFsLdoDig_Pos (13UL) /*!< Position of OvrEnPwrupFsLdoDig field. */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_ALL_OvrEnPwrupFsLdoDig_Msk (0x3UL << RADIO_TIMINGENGINE_OVR_EN_GROUP_ALL_OvrEnPwrupFsLdoDig_Pos) /*!< Bit mask of OvrEnPwrupFsLdoDig field. */

/* Bits 12..11 : Override enable of PwrupFsLdoDtc */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_ALL_OvrEnPwrupFsLdoDtc_Pos (11UL) /*!< Position of OvrEnPwrupFsLdoDtc field. */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_ALL_OvrEnPwrupFsLdoDtc_Msk (0x3UL << RADIO_TIMINGENGINE_OVR_EN_GROUP_ALL_OvrEnPwrupFsLdoDtc_Pos) /*!< Bit mask of OvrEnPwrupFsLdoDtc field. */

/* Bits 10..9 : Override enable of PwrupFsLdoVco */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_ALL_OvrEnPwrupFsLdoVco_Pos (9UL) /*!< Position of OvrEnPwrupFsLdoVco field. */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_ALL_OvrEnPwrupFsLdoVco_Msk (0x3UL << RADIO_TIMINGENGINE_OVR_EN_GROUP_ALL_OvrEnPwrupFsLdoVco_Pos) /*!< Bit mask of OvrEnPwrupFsLdoVco field. */

/* Bits 8..6 : Override enable of RstFsLs */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_ALL_OvrEnRstFsLs_Pos (6UL) /*!< Position of OvrEnRstFsLs field. */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_ALL_OvrEnRstFsLs_Msk (0x7UL << RADIO_TIMINGENGINE_OVR_EN_GROUP_ALL_OvrEnRstFsLs_Pos) /*!< Bit mask of OvrEnRstFsLs field. */

/* Bits 5..3 : Override enable of PwrupFsRef */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_ALL_OvrEnPwrupFsRef_Pos (3UL) /*!< Position of OvrEnPwrupFsRef field. */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_ALL_OvrEnPwrupFsRef_Msk (0x7UL << RADIO_TIMINGENGINE_OVR_EN_GROUP_ALL_OvrEnPwrupFsRef_Pos) /*!< Bit mask of OvrEnPwrupFsRef field. */

/* Bits 2..1 : Override enable of PwrupRadio */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_ALL_OvrEnPwrupRadio_Pos (1UL) /*!< Position of OvrEnPwrupRadio field. */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_ALL_OvrEnPwrupRadio_Msk (0x3UL << RADIO_TIMINGENGINE_OVR_EN_GROUP_ALL_OvrEnPwrupRadio_Pos) /*!< Bit mask of OvrEnPwrupRadio field. */

/* Bit 0 : Override enable of RetainRadio */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_ALL_OvrEnRetainRadio_Pos (0UL) /*!< Position of OvrEnRetainRadio field. */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_ALL_OvrEnRetainRadio_Msk (0x1UL << RADIO_TIMINGENGINE_OVR_EN_GROUP_ALL_OvrEnRetainRadio_Pos) /*!< Bit mask of OvrEnRetainRadio field. */

/* Register: RADIO_TIMINGENGINE_OVR_EN_GROUP_RXTX */
/* Description: TODO */

/* Bit 26 : Override enable of PwrupExtPa */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_RXTX_OvrEnPwrupExtPa_Pos (26UL) /*!< Position of OvrEnPwrupExtPa field. */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_RXTX_OvrEnPwrupExtPa_Msk (0x1UL << RADIO_TIMINGENGINE_OVR_EN_GROUP_RXTX_OvrEnPwrupExtPa_Pos) /*!< Bit mask of OvrEnPwrupExtPa field. */

/* Bit 25 : Override enable of PwrupExtLna */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_RXTX_OvrEnPwrupExtLna_Pos (25UL) /*!< Position of OvrEnPwrupExtLna field. */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_RXTX_OvrEnPwrupExtLna_Msk (0x1UL << RADIO_TIMINGENGINE_OVR_EN_GROUP_RXTX_OvrEnPwrupExtLna_Pos) /*!< Bit mask of OvrEnPwrupExtLna field. */

/* Bit 24 : Override enable of PwrupTxPa */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_RXTX_OvrEnPwrupTxPa_Pos (24UL) /*!< Position of OvrEnPwrupTxPa field. */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_RXTX_OvrEnPwrupTxPa_Msk (0x1UL << RADIO_TIMINGENGINE_OVR_EN_GROUP_RXTX_OvrEnPwrupTxPa_Pos) /*!< Bit mask of OvrEnPwrupTxPa field. */

