adamkondraciuk/nrfx/mdk/nrf54lilium_network_bitfields.h
/* Bit 23 : Override enable of PwrupTxPwrCtrl */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_RXTX_OvrEnPwrupTxPwrCtrl_Pos (23UL) /*!< Position of OvrEnPwrupTxPwrCtrl field. */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_RXTX_OvrEnPwrupTxPwrCtrl_Msk (0x1UL << RADIO_TIMINGENGINE_OVR_EN_GROUP_RXTX_OvrEnPwrupTxPwrCtrl_Pos) /*!< Bit mask of OvrEnPwrupTxPwrCtrl field. */

/* Bit 22 : Override enable of PwrupTx */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_RXTX_OvrEnPwrupTx_Pos (22UL) /*!< Position of OvrEnPwrupTx field. */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_RXTX_OvrEnPwrupTx_Msk (0x1UL << RADIO_TIMINGENGINE_OVR_EN_GROUP_RXTX_OvrEnPwrupTx_Pos) /*!< Bit mask of OvrEnPwrupTx field. */

/* Bits 21..16 : Override enable of PwrupTxLdo */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_RXTX_OvrEnPwrupTxLdo_Pos (16UL) /*!< Position of OvrEnPwrupTxLdo field. */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_RXTX_OvrEnPwrupTxLdo_Msk (0x3FUL << RADIO_TIMINGENGINE_OVR_EN_GROUP_RXTX_OvrEnPwrupTxLdo_Pos) /*!< Bit mask of OvrEnPwrupTxLdo field. */

/* Bit 15 : Override enable of ArstAdc */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_RXTX_OvrEnArstAdc_Pos (15UL) /*!< Position of OvrEnArstAdc field. */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_RXTX_OvrEnArstAdc_Msk (0x1UL << RADIO_TIMINGENGINE_OVR_EN_GROUP_RXTX_OvrEnArstAdc_Pos) /*!< Bit mask of OvrEnArstAdc field. */

/* Bit 14 : Override enable of PwrupRxPkd */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_RXTX_OvrEnPwrupRxPkd_Pos (14UL) /*!< Position of OvrEnPwrupRxPkd field. */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_RXTX_OvrEnPwrupRxPkd_Msk (0x1UL << RADIO_TIMINGENGINE_OVR_EN_GROUP_RXTX_OvrEnPwrupRxPkd_Pos) /*!< Bit mask of OvrEnPwrupRxPkd field. */

/* Bits 13..12 : Override enable of PwrupRxSar */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_RXTX_OvrEnPwrupRxSar_Pos (12UL) /*!< Position of OvrEnPwrupRxSar field. */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_RXTX_OvrEnPwrupRxSar_Msk (0x3UL << RADIO_TIMINGENGINE_OVR_EN_GROUP_RXTX_OvrEnPwrupRxSar_Pos) /*!< Bit mask of OvrEnPwrupRxSar field. */

/* Bit 11 : Override enable of PwrupRxAaf */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_RXTX_OvrEnPwrupRxAaf_Pos (11UL) /*!< Position of OvrEnPwrupRxAaf field. */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_RXTX_OvrEnPwrupRxAaf_Msk (0x1UL << RADIO_TIMINGENGINE_OVR_EN_GROUP_RXTX_OvrEnPwrupRxAaf_Pos) /*!< Bit mask of OvrEnPwrupRxAaf field. */

/* Bit 10 : Override enable of PwrupRx */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_RXTX_OvrEnPwrupRx_Pos (10UL) /*!< Position of OvrEnPwrupRx field. */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_RXTX_OvrEnPwrupRx_Msk (0x1UL << RADIO_TIMINGENGINE_OVR_EN_GROUP_RXTX_OvrEnPwrupRx_Pos) /*!< Bit mask of OvrEnPwrupRx field. */

/* Bit 9 : Override enable of PwrupRxMix */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_RXTX_OvrEnPwrupRxMix_Pos (9UL) /*!< Position of OvrEnPwrupRxMix field. */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_RXTX_OvrEnPwrupRxMix_Msk (0x1UL << RADIO_TIMINGENGINE_OVR_EN_GROUP_RXTX_OvrEnPwrupRxMix_Pos) /*!< Bit mask of OvrEnPwrupRxMix field. */

/* Bit 8 : Override enable of PwrupRxLna */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_RXTX_OvrEnPwrupRxLna_Pos (8UL) /*!< Position of OvrEnPwrupRxLna field. */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_RXTX_OvrEnPwrupRxLna_Msk (0x1UL << RADIO_TIMINGENGINE_OVR_EN_GROUP_RXTX_OvrEnPwrupRxLna_Pos) /*!< Bit mask of OvrEnPwrupRxLna field. */

/* Bits 7..2 : Override enable of PwrupRxLdo */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_RXTX_OvrEnPwrupRxLdo_Pos (2UL) /*!< Position of OvrEnPwrupRxLdo field. */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_RXTX_OvrEnPwrupRxLdo_Msk (0x3FUL << RADIO_TIMINGENGINE_OVR_EN_GROUP_RXTX_OvrEnPwrupRxLdo_Pos) /*!< Bit mask of OvrEnPwrupRxLdo field. */

/* Bits 1..0 : Override enable of RstRxLs */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_RXTX_OvrEnRstRxLs_Pos (0UL) /*!< Position of OvrEnRstRxLs field. */
#define RADIO_TIMINGENGINE_OVR_EN_GROUP_RXTX_OvrEnRstRxLs_Msk (0x3UL << RADIO_TIMINGENGINE_OVR_EN_GROUP_RXTX_OvrEnRstRxLs_Pos) /*!< Bit mask of OvrEnRstRxLs field. */

/* Register: RADIO_TIMINGENGINE_OVR_VAL_GROUP_ALL */
/* Description: TODO */

/* Bits 30..28 : Override value of PwrupRxTxRef */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_ALL_OvrValPwrupRxTxRef_Pos (28UL) /*!< Position of OvrValPwrupRxTxRef field. */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_ALL_OvrValPwrupRxTxRef_Msk (0x7UL << RADIO_TIMINGENGINE_OVR_VAL_GROUP_ALL_OvrValPwrupRxTxRef_Pos) /*!< Bit mask of OvrValPwrupRxTxRef field. */

/* Bit 27 : Override value of FsStart */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_ALL_OvrValFsStart_Pos (27UL) /*!< Position of OvrValFsStart field. */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_ALL_OvrValFsStart_Msk (0x1UL << RADIO_TIMINGENGINE_OVR_VAL_GROUP_ALL_OvrValFsStart_Pos) /*!< Bit mask of OvrValFsStart field. */

/* Bit 26 : Override value of ArstFs */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_ALL_OvrValArstFs_Pos (26UL) /*!< Position of OvrValArstFs field. */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_ALL_OvrValArstFs_Msk (0x1UL << RADIO_TIMINGENGINE_OVR_VAL_GROUP_ALL_OvrValArstFs_Pos) /*!< Bit mask of OvrValArstFs field. */

/* Bit 25 : Override value of PwrupFsDiv2g4Counter */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_ALL_OvrValPwrupFsDiv2g4Counter_Pos (25UL) /*!< Position of OvrValPwrupFsDiv2g4Counter field. */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_ALL_OvrValPwrupFsDiv2g4Counter_Msk (0x1UL << RADIO_TIMINGENGINE_OVR_VAL_GROUP_ALL_OvrValPwrupFsDiv2g4Counter_Pos) /*!< Bit mask of OvrValPwrupFsDiv2g4Counter field. */

/* Bit 24 : Override value of PwrupFsDiv2 */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_ALL_OvrValPwrupFsDiv2_Pos (24UL) /*!< Position of OvrValPwrupFsDiv2 field. */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_ALL_OvrValPwrupFsDiv2_Msk (0x1UL << RADIO_TIMINGENGINE_OVR_VAL_GROUP_ALL_OvrValPwrupFsDiv2_Pos) /*!< Bit mask of OvrValPwrupFsDiv2 field. */

/* Bit 23 : Override value of PwrupFsVco */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_ALL_OvrValPwrupFsVco_Pos (23UL) /*!< Position of OvrValPwrupFsVco field. */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_ALL_OvrValPwrupFsVco_Msk (0x1UL << RADIO_TIMINGENGINE_OVR_VAL_GROUP_ALL_OvrValPwrupFsVco_Pos) /*!< Bit mask of OvrValPwrupFsVco field. */

/* Bit 22 : Override value of PwrupFsTdc */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_ALL_OvrValPwrupFsTdc_Pos (22UL) /*!< Position of OvrValPwrupFsTdc field. */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_ALL_OvrValPwrupFsTdc_Msk (0x1UL << RADIO_TIMINGENGINE_OVR_VAL_GROUP_ALL_OvrValPwrupFsTdc_Pos) /*!< Bit mask of OvrValPwrupFsTdc field. */

/* Bit 21 : Override value of PwrupFsDtc */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_ALL_OvrValPwrupFsDtc_Pos (21UL) /*!< Position of OvrValPwrupFsDtc field. */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_ALL_OvrValPwrupFsDtc_Msk (0x1UL << RADIO_TIMINGENGINE_OVR_VAL_GROUP_ALL_OvrValPwrupFsDtc_Pos) /*!< Bit mask of OvrValPwrupFsDtc field. */

/* Bits 20..19 : Override value of PwrupFsLdoTdc */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_ALL_OvrValPwrupFsLdoTdc_Pos (19UL) /*!< Position of OvrValPwrupFsLdoTdc field. */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_ALL_OvrValPwrupFsLdoTdc_Msk (0x3UL << RADIO_TIMINGENGINE_OVR_VAL_GROUP_ALL_OvrValPwrupFsLdoTdc_Pos) /*!< Bit mask of OvrValPwrupFsLdoTdc field. */

