adamkondraciuk/nrfx/mdk/nrf54lilium_network_bitfields.h
/* Bits 18..17 : Override value of PwrupFsLdoCnt */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_ALL_OvrValPwrupFsLdoCnt_Pos (17UL) /*!< Position of OvrValPwrupFsLdoCnt field. */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_ALL_OvrValPwrupFsLdoCnt_Msk (0x3UL << RADIO_TIMINGENGINE_OVR_VAL_GROUP_ALL_OvrValPwrupFsLdoCnt_Pos) /*!< Bit mask of OvrValPwrupFsLdoCnt field. */

/* Bits 16..15 : Override value of PwrupFsLdoDiv */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_ALL_OvrValPwrupFsLdoDiv_Pos (15UL) /*!< Position of OvrValPwrupFsLdoDiv field. */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_ALL_OvrValPwrupFsLdoDiv_Msk (0x3UL << RADIO_TIMINGENGINE_OVR_VAL_GROUP_ALL_OvrValPwrupFsLdoDiv_Pos) /*!< Bit mask of OvrValPwrupFsLdoDiv field. */

/* Bits 14..13 : Override value of PwrupFsLdoDig */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_ALL_OvrValPwrupFsLdoDig_Pos (13UL) /*!< Position of OvrValPwrupFsLdoDig field. */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_ALL_OvrValPwrupFsLdoDig_Msk (0x3UL << RADIO_TIMINGENGINE_OVR_VAL_GROUP_ALL_OvrValPwrupFsLdoDig_Pos) /*!< Bit mask of OvrValPwrupFsLdoDig field. */

/* Bits 12..11 : Override value of PwrupFsLdoDtc */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_ALL_OvrValPwrupFsLdoDtc_Pos (11UL) /*!< Position of OvrValPwrupFsLdoDtc field. */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_ALL_OvrValPwrupFsLdoDtc_Msk (0x3UL << RADIO_TIMINGENGINE_OVR_VAL_GROUP_ALL_OvrValPwrupFsLdoDtc_Pos) /*!< Bit mask of OvrValPwrupFsLdoDtc field. */

/* Bits 10..9 : Override value of PwrupFsLdoVco */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_ALL_OvrValPwrupFsLdoVco_Pos (9UL) /*!< Position of OvrValPwrupFsLdoVco field. */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_ALL_OvrValPwrupFsLdoVco_Msk (0x3UL << RADIO_TIMINGENGINE_OVR_VAL_GROUP_ALL_OvrValPwrupFsLdoVco_Pos) /*!< Bit mask of OvrValPwrupFsLdoVco field. */

/* Bits 8..6 : Override value of RstFsLs */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_ALL_OvrValRstFsLs_Pos (6UL) /*!< Position of OvrValRstFsLs field. */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_ALL_OvrValRstFsLs_Msk (0x7UL << RADIO_TIMINGENGINE_OVR_VAL_GROUP_ALL_OvrValRstFsLs_Pos) /*!< Bit mask of OvrValRstFsLs field. */

/* Bits 5..3 : Override value of PwrupFsRef */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_ALL_OvrValPwrupFsRef_Pos (3UL) /*!< Position of OvrValPwrupFsRef field. */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_ALL_OvrValPwrupFsRef_Msk (0x7UL << RADIO_TIMINGENGINE_OVR_VAL_GROUP_ALL_OvrValPwrupFsRef_Pos) /*!< Bit mask of OvrValPwrupFsRef field. */

/* Bits 2..1 : Override value of PwrupRadio */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_ALL_OvrValPwrupRadio_Pos (1UL) /*!< Position of OvrValPwrupRadio field. */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_ALL_OvrValPwrupRadio_Msk (0x3UL << RADIO_TIMINGENGINE_OVR_VAL_GROUP_ALL_OvrValPwrupRadio_Pos) /*!< Bit mask of OvrValPwrupRadio field. */

/* Bit 0 : Override value of RetainRadio */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_ALL_OvrValRetainRadio_Pos (0UL) /*!< Position of OvrValRetainRadio field. */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_ALL_OvrValRetainRadio_Msk (0x1UL << RADIO_TIMINGENGINE_OVR_VAL_GROUP_ALL_OvrValRetainRadio_Pos) /*!< Bit mask of OvrValRetainRadio field. */

/* Register: RADIO_TIMINGENGINE_OVR_VAL_GROUP_RXTX */
/* Description: TODO */

/* Bit 26 : Override value of PwrupExtPa */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_RXTX_OvrValPwrupExtPa_Pos (26UL) /*!< Position of OvrValPwrupExtPa field. */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_RXTX_OvrValPwrupExtPa_Msk (0x1UL << RADIO_TIMINGENGINE_OVR_VAL_GROUP_RXTX_OvrValPwrupExtPa_Pos) /*!< Bit mask of OvrValPwrupExtPa field. */

/* Bit 25 : Override value of PwrupExtLna */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_RXTX_OvrValPwrupExtLna_Pos (25UL) /*!< Position of OvrValPwrupExtLna field. */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_RXTX_OvrValPwrupExtLna_Msk (0x1UL << RADIO_TIMINGENGINE_OVR_VAL_GROUP_RXTX_OvrValPwrupExtLna_Pos) /*!< Bit mask of OvrValPwrupExtLna field. */

/* Bit 24 : Override value of PwrupTxPa */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_RXTX_OvrValPwrupTxPa_Pos (24UL) /*!< Position of OvrValPwrupTxPa field. */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_RXTX_OvrValPwrupTxPa_Msk (0x1UL << RADIO_TIMINGENGINE_OVR_VAL_GROUP_RXTX_OvrValPwrupTxPa_Pos) /*!< Bit mask of OvrValPwrupTxPa field. */

/* Bit 23 : Override value of PwrupTxPwrCtrl */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_RXTX_OvrValPwrupTxPwrCtrl_Pos (23UL) /*!< Position of OvrValPwrupTxPwrCtrl field. */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_RXTX_OvrValPwrupTxPwrCtrl_Msk (0x1UL << RADIO_TIMINGENGINE_OVR_VAL_GROUP_RXTX_OvrValPwrupTxPwrCtrl_Pos) /*!< Bit mask of OvrValPwrupTxPwrCtrl field. */

/* Bit 22 : Override value of PwrupTx */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_RXTX_OvrValPwrupTx_Pos (22UL) /*!< Position of OvrValPwrupTx field. */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_RXTX_OvrValPwrupTx_Msk (0x1UL << RADIO_TIMINGENGINE_OVR_VAL_GROUP_RXTX_OvrValPwrupTx_Pos) /*!< Bit mask of OvrValPwrupTx field. */

/* Bits 21..16 : Override value of PwrupTxLdo */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_RXTX_OvrValPwrupTxLdo_Pos (16UL) /*!< Position of OvrValPwrupTxLdo field. */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_RXTX_OvrValPwrupTxLdo_Msk (0x3FUL << RADIO_TIMINGENGINE_OVR_VAL_GROUP_RXTX_OvrValPwrupTxLdo_Pos) /*!< Bit mask of OvrValPwrupTxLdo field. */

/* Bit 15 : Override value of ArstAdc */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_RXTX_OvrValArstAdc_Pos (15UL) /*!< Position of OvrValArstAdc field. */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_RXTX_OvrValArstAdc_Msk (0x1UL << RADIO_TIMINGENGINE_OVR_VAL_GROUP_RXTX_OvrValArstAdc_Pos) /*!< Bit mask of OvrValArstAdc field. */

/* Bit 14 : Override value of PwrupRxPkd */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_RXTX_OvrValPwrupRxPkd_Pos (14UL) /*!< Position of OvrValPwrupRxPkd field. */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_RXTX_OvrValPwrupRxPkd_Msk (0x1UL << RADIO_TIMINGENGINE_OVR_VAL_GROUP_RXTX_OvrValPwrupRxPkd_Pos) /*!< Bit mask of OvrValPwrupRxPkd field. */

/* Bits 13..12 : Override value of PwrupRxSar */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_RXTX_OvrValPwrupRxSar_Pos (12UL) /*!< Position of OvrValPwrupRxSar field. */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_RXTX_OvrValPwrupRxSar_Msk (0x3UL << RADIO_TIMINGENGINE_OVR_VAL_GROUP_RXTX_OvrValPwrupRxSar_Pos) /*!< Bit mask of OvrValPwrupRxSar field. */

/* Bit 11 : Override value of PwrupRxAaf */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_RXTX_OvrValPwrupRxAaf_Pos (11UL) /*!< Position of OvrValPwrupRxAaf field. */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_RXTX_OvrValPwrupRxAaf_Msk (0x1UL << RADIO_TIMINGENGINE_OVR_VAL_GROUP_RXTX_OvrValPwrupRxAaf_Pos) /*!< Bit mask of OvrValPwrupRxAaf field. */

