adamkondraciuk/nrfx/mdk/nrf54lilium_network_bitfields.h
/* Bit 10 : Override value of PwrupRx */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_RXTX_OvrValPwrupRx_Pos (10UL) /*!< Position of OvrValPwrupRx field. */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_RXTX_OvrValPwrupRx_Msk (0x1UL << RADIO_TIMINGENGINE_OVR_VAL_GROUP_RXTX_OvrValPwrupRx_Pos) /*!< Bit mask of OvrValPwrupRx field. */

/* Bit 9 : Override value of PwrupRxMix */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_RXTX_OvrValPwrupRxMix_Pos (9UL) /*!< Position of OvrValPwrupRxMix field. */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_RXTX_OvrValPwrupRxMix_Msk (0x1UL << RADIO_TIMINGENGINE_OVR_VAL_GROUP_RXTX_OvrValPwrupRxMix_Pos) /*!< Bit mask of OvrValPwrupRxMix field. */

/* Bit 8 : Override value of PwrupRxLna */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_RXTX_OvrValPwrupRxLna_Pos (8UL) /*!< Position of OvrValPwrupRxLna field. */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_RXTX_OvrValPwrupRxLna_Msk (0x1UL << RADIO_TIMINGENGINE_OVR_VAL_GROUP_RXTX_OvrValPwrupRxLna_Pos) /*!< Bit mask of OvrValPwrupRxLna field. */

/* Bits 7..2 : Override value of PwrupRxLdo */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_RXTX_OvrValPwrupRxLdo_Pos (2UL) /*!< Position of OvrValPwrupRxLdo field. */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_RXTX_OvrValPwrupRxLdo_Msk (0x3FUL << RADIO_TIMINGENGINE_OVR_VAL_GROUP_RXTX_OvrValPwrupRxLdo_Pos) /*!< Bit mask of OvrValPwrupRxLdo field. */

/* Bits 1..0 : Override value of RstRxLs */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_RXTX_OvrValRstRxLs_Pos (0UL) /*!< Position of OvrValRstRxLs field. */
#define RADIO_TIMINGENGINE_OVR_VAL_GROUP_RXTX_OvrValRstRxLs_Msk (0x3UL << RADIO_TIMINGENGINE_OVR_VAL_GROUP_RXTX_OvrValRstRxLs_Pos) /*!< Bit mask of OvrValRstRxLs field. */

/* Register: RADIO_TIMINGENGINE_MODE_DEPENDENT_2 */
/* Description: TODO */

/* Bit 8 : Turn off radio w.r.t txDataValid in addition to radioEn */
#define RADIO_TIMINGENGINE_MODE_DEPENDENT_2_TurnOffRadioWrtTxDataValid_Pos (8UL) /*!< Position of TurnOffRadioWrtTxDataValid field. */
#define RADIO_TIMINGENGINE_MODE_DEPENDENT_2_TurnOffRadioWrtTxDataValid_Msk (0x1UL << RADIO_TIMINGENGINE_MODE_DEPENDENT_2_TurnOffRadioWrtTxDataValid_Pos) /*!< Bit mask of TurnOffRadioWrtTxDataValid field. */

/* Bits 4..0 : Additional offset in Rx mode, for Rx to be able to be ready earlier, which is required for 2Mbps. */
#define RADIO_TIMINGENGINE_MODE_DEPENDENT_2_TTxRxTurnAroundDelta_Pos (0UL) /*!< Position of TTxRxTurnAroundDelta field. */
#define RADIO_TIMINGENGINE_MODE_DEPENDENT_2_TTxRxTurnAroundDelta_Msk (0x1FUL << RADIO_TIMINGENGINE_MODE_DEPENDENT_2_TTxRxTurnAroundDelta_Pos) /*!< Bit mask of TTxRxTurnAroundDelta field. */

/* Register: RADIO_RXAGC_GAIN */
/* Description: TODO */

/* Bits 31..28 : gain step for decreasing IF gain */
#define RADIO_RXAGC_GAIN_AgcIFgainStepDown_Pos (28UL) /*!< Position of AgcIFgainStepDown field. */
#define RADIO_RXAGC_GAIN_AgcIFgainStepDown_Msk (0xFUL << RADIO_RXAGC_GAIN_AgcIFgainStepDown_Pos) /*!< Bit mask of AgcIFgainStepDown field. */

/* Bits 27..24 : gain step for increasing IF gain */
#define RADIO_RXAGC_GAIN_AgcIFgainStepUp_Pos (24UL) /*!< Position of AgcIFgainStepUp field. */
#define RADIO_RXAGC_GAIN_AgcIFgainStepUp_Msk (0xFUL << RADIO_RXAGC_GAIN_AgcIFgainStepUp_Pos) /*!< Bit mask of AgcIFgainStepUp field. */

/* Bits 23..20 : Minimum gain of IF gain */
#define RADIO_RXAGC_GAIN_AgcIFgainMin_Pos (20UL) /*!< Position of AgcIFgainMin field. */
#define RADIO_RXAGC_GAIN_AgcIFgainMin_Msk (0xFUL << RADIO_RXAGC_GAIN_AgcIFgainMin_Pos) /*!< Bit mask of AgcIFgainMin field. */

/* Bits 19..16 : Maximum gain of IF gain */
#define RADIO_RXAGC_GAIN_AgcIFgainMax_Pos (16UL) /*!< Position of AgcIFgainMax field. */
#define RADIO_RXAGC_GAIN_AgcIFgainMax_Msk (0xFUL << RADIO_RXAGC_GAIN_AgcIFgainMax_Pos) /*!< Bit mask of AgcIFgainMax field. */

/* Bits 15..12 : gain step for decreasing RF gain */
#define RADIO_RXAGC_GAIN_AgcRFgainStepDown_Pos (12UL) /*!< Position of AgcRFgainStepDown field. */
#define RADIO_RXAGC_GAIN_AgcRFgainStepDown_Msk (0xFUL << RADIO_RXAGC_GAIN_AgcRFgainStepDown_Pos) /*!< Bit mask of AgcRFgainStepDown field. */

/* Bits 11..8 : gain step for increasing RF gain */
#define RADIO_RXAGC_GAIN_AgcRFgainStepUp_Pos (8UL) /*!< Position of AgcRFgainStepUp field. */
#define RADIO_RXAGC_GAIN_AgcRFgainStepUp_Msk (0xFUL << RADIO_RXAGC_GAIN_AgcRFgainStepUp_Pos) /*!< Bit mask of AgcRFgainStepUp field. */

/* Bits 7..4 : Minimum gain of RF gain */
#define RADIO_RXAGC_GAIN_AgcRFgainMin_Pos (4UL) /*!< Position of AgcRFgainMin field. */
#define RADIO_RXAGC_GAIN_AgcRFgainMin_Msk (0xFUL << RADIO_RXAGC_GAIN_AgcRFgainMin_Pos) /*!< Bit mask of AgcRFgainMin field. */

/* Bits 3..0 : Maximum gain of RF gain */
#define RADIO_RXAGC_GAIN_AgcRFgainMax_Pos (0UL) /*!< Position of AgcRFgainMax field. */
#define RADIO_RXAGC_GAIN_AgcRFgainMax_Msk (0xFUL << RADIO_RXAGC_GAIN_AgcRFgainMax_Pos) /*!< Bit mask of AgcRFgainMax field. */

/* Register: RADIO_RXAGC_CONFIG */
/* Description: TODO */

/* Bits 30..29 : Enable(1) or disable(0) functional testmode for AGC */
#define RADIO_RXAGC_CONFIG_AgcToggle_Pos (29UL) /*!< Position of AgcToggle field. */
#define RADIO_RXAGC_CONFIG_AgcToggle_Msk (0x3UL << RADIO_RXAGC_CONFIG_AgcToggle_Pos) /*!< Bit mask of AgcToggle field. */

/* Bit 28 : 0: AGC takes control of RC-filter in passive mixer, 1: Control RC-filter in passive mixer from register */
#define RADIO_RXAGC_CONFIG_AgcMixFiltBypassOvrEn_Pos (28UL) /*!< Position of AgcMixFiltBypassOvrEn field. */
#define RADIO_RXAGC_CONFIG_AgcMixFiltBypassOvrEn_Msk (0x1UL << RADIO_RXAGC_CONFIG_AgcMixFiltBypassOvrEn_Pos) /*!< Bit mask of AgcMixFiltBypassOvrEn field. */

/* Bit 27 : 0: Enable RC-filter in passive mixer, 1: Bypass RC-filter in passive mixer */
#define RADIO_RXAGC_CONFIG_AgcMixFiltBypass_Pos (27UL) /*!< Position of AgcMixFiltBypass field. */
#define RADIO_RXAGC_CONFIG_AgcMixFiltBypass_Msk (0x1UL << RADIO_RXAGC_CONFIG_AgcMixFiltBypass_Pos) /*!< Bit mask of AgcMixFiltBypass field. */

/* Bit 26 : 0: AGC takes control of all gains, 1: Control all gains (aafGain, mixGain, lnaGain) from registers */
#define RADIO_RXAGC_CONFIG_AgcOverrideGain_Pos (26UL) /*!< Position of AgcOverrideGain field. */
#define RADIO_RXAGC_CONFIG_AgcOverrideGain_Msk (0x1UL << RADIO_RXAGC_CONFIG_AgcOverrideGain_Pos) /*!< Bit mask of AgcOverrideGain field. */

/* Bits 25..23 : Override value for lnaGain */
#define RADIO_RXAGC_CONFIG_AgcLnaOverride_Pos (23UL) /*!< Position of AgcLnaOverride field. */
#define RADIO_RXAGC_CONFIG_AgcLnaOverride_Msk (0x7UL << RADIO_RXAGC_CONFIG_AgcLnaOverride_Pos) /*!< Bit mask of AgcLnaOverride field. */

