adamkondraciuk/nrfx/mdk/nrf54lilium_network_bitfields.h
/* Bits 22..21 : Override value for mixGain */
#define RADIO_RXAGC_CONFIG_AgcMixOverride_Pos (21UL) /*!< Position of AgcMixOverride field. */
#define RADIO_RXAGC_CONFIG_AgcMixOverride_Msk (0x3UL << RADIO_RXAGC_CONFIG_AgcMixOverride_Pos) /*!< Bit mask of AgcMixOverride field. */

/* Bits 20..17 : Override value for aafGain */
#define RADIO_RXAGC_CONFIG_AgcAafOverride_Pos (17UL) /*!< Position of AgcAafOverride field. */
#define RADIO_RXAGC_CONFIG_AgcAafOverride_Msk (0xFUL << RADIO_RXAGC_CONFIG_AgcAafOverride_Pos) /*!< Bit mask of AgcAafOverride field. */

/* Bits 16..11 : The number of clock cycles between each adjustment of the gain while addressMatch is high */
#define RADIO_RXAGC_CONFIG_AgcWaitPacket_Pos (11UL) /*!< Position of AgcWaitPacket field. */
#define RADIO_RXAGC_CONFIG_AgcWaitPacket_Msk (0x3FUL << RADIO_RXAGC_CONFIG_AgcWaitPacket_Pos) /*!< Bit mask of AgcWaitPacket field. */

/* Bits 10..5 : The number of clock cycles between each adjustment of the gain while addressMatch is low */
#define RADIO_RXAGC_CONFIG_AgcWait_Pos (5UL) /*!< Position of AgcWait field. */
#define RADIO_RXAGC_CONFIG_AgcWait_Msk (0x3FUL << RADIO_RXAGC_CONFIG_AgcWait_Pos) /*!< Bit mask of AgcWait field. */

/* Bits 4..1 : The number of clock cycles after the adjustment of gain that the reset signal to the RF peak detector is set high */
#define RADIO_RXAGC_CONFIG_AgcRFpkDetResetCount_Pos (1UL) /*!< Position of AgcRFpkDetResetCount field. */
#define RADIO_RXAGC_CONFIG_AgcRFpkDetResetCount_Msk (0xFUL << RADIO_RXAGC_CONFIG_AgcRFpkDetResetCount_Pos) /*!< Bit mask of AgcRFpkDetResetCount field. */

/* Bit 0 : Causes the RF gain to be decreased and the IF gain to be increased if the overall gain can be maintained */
#define RADIO_RXAGC_CONFIG_AgcEnableGainSwitch_Pos (0UL) /*!< Position of AgcEnableGainSwitch field. */
#define RADIO_RXAGC_CONFIG_AgcEnableGainSwitch_Msk (0x1UL << RADIO_RXAGC_CONFIG_AgcEnableGainSwitch_Pos) /*!< Bit mask of AgcEnableGainSwitch field. */

/* Register: RADIO_RXAGC_RSSI */
/* Description: TODO */

/* Bits 13..7 : 802.15.4 Energy Detect calibration value */
#define RADIO_RXAGC_RSSI_Ed154Cal_Pos (7UL) /*!< Position of Ed154Cal field. */
#define RADIO_RXAGC_RSSI_Ed154Cal_Msk (0x7FUL << RADIO_RXAGC_RSSI_Ed154Cal_Pos) /*!< Bit mask of Ed154Cal field. */

/* Bits 6..0 : RSSI calibration value */
#define RADIO_RXAGC_RSSI_RssiCal_Pos (0UL) /*!< Position of RssiCal field. */
#define RADIO_RXAGC_RSSI_RssiCal_Msk (0x7FUL << RADIO_RXAGC_RSSI_RssiCal_Pos) /*!< Bit mask of RssiCal field. */

/* Register: RADIO_RXAGC_STATUS */
/* Description: TODO */

/* Bit 31 : MIX RC-filter status */
#define RADIO_RXAGC_STATUS_MixFiltBypass_Pos (31UL) /*!< Position of MixFiltBypass field. */
#define RADIO_RXAGC_STATUS_MixFiltBypass_Msk (0x1UL << RADIO_RXAGC_STATUS_MixFiltBypass_Pos) /*!< Bit mask of MixFiltBypass field. */

/* Bits 29..28 : BB peak detector output. Represent state[1:0] in RxAgc */
#define RADIO_RXAGC_STATUS_BbPkDet_Pos (28UL) /*!< Position of BbPkDet field. */
#define RADIO_RXAGC_STATUS_BbPkDet_Msk (0x3UL << RADIO_RXAGC_STATUS_BbPkDet_Pos) /*!< Bit mask of BbPkDet field. */

/* Bits 27..26 : IF peak detector output. Represent state[3:2] in RxAgc */
#define RADIO_RXAGC_STATUS_IfPkDet_Pos (26UL) /*!< Position of IfPkDet field. */
#define RADIO_RXAGC_STATUS_IfPkDet_Msk (0x3UL << RADIO_RXAGC_STATUS_IfPkDet_Pos) /*!< Bit mask of IfPkDet field. */

/* Bits 25..24 : RF peak detector output after sync. Represent state[5:4] in RxAgc */
#define RADIO_RXAGC_STATUS_RfPkDet_Pos (24UL) /*!< Position of RfPkDet field. */
#define RADIO_RXAGC_STATUS_RfPkDet_Msk (0x3UL << RADIO_RXAGC_STATUS_RfPkDet_Pos) /*!< Bit mask of RfPkDet field. */

/* Bits 16..14 : LNA gain status */
#define RADIO_RXAGC_STATUS_LnaGain_Pos (14UL) /*!< Position of LnaGain field. */
#define RADIO_RXAGC_STATUS_LnaGain_Msk (0x7UL << RADIO_RXAGC_STATUS_LnaGain_Pos) /*!< Bit mask of LnaGain field. */

/* Bits 13..12 : MIX gain status */
#define RADIO_RXAGC_STATUS_MixGain_Pos (12UL) /*!< Position of MixGain field. */
#define RADIO_RXAGC_STATUS_MixGain_Msk (0x3UL << RADIO_RXAGC_STATUS_MixGain_Pos) /*!< Bit mask of MixGain field. */

/* Bits 11..8 : AAF gain status */
#define RADIO_RXAGC_STATUS_AafGain_Pos (8UL) /*!< Position of AafGain field. */
#define RADIO_RXAGC_STATUS_AafGain_Msk (0xFUL << RADIO_RXAGC_STATUS_AafGain_Pos) /*!< Bit mask of AafGain field. */

/* Bits 6..0 : Received signal strength indicator */
#define RADIO_RXAGC_STATUS_Rssi_Pos (0UL) /*!< Position of Rssi field. */
#define RADIO_RXAGC_STATUS_Rssi_Msk (0x7FUL << RADIO_RXAGC_STATUS_Rssi_Pos) /*!< Bit mask of Rssi field. */

/* Register: RADIO_RXSATURATIONDETECT */
/* Description: TODO */

/* Bits 3..0 : combination of several PARs in PantherPar */
#define RADIO_RXSATURATIONDETECT_SatDelayCorrection_Pos (0UL) /*!< Position of SatDelayCorrection field. */
#define RADIO_RXSATURATIONDETECT_SatDelayCorrection_Msk (0xFUL << RADIO_RXSATURATIONDETECT_SatDelayCorrection_Pos) /*!< Bit mask of SatDelayCorrection field. */

/* Register: RADIO_RXPEAKDETECTOR_IF */
/* Description: TODO */

/* Bits 29..24 : TODO */
#define RADIO_RXPEAKDETECTOR_IF_DecayStep_Pos (24UL) /*!< Position of DecayStep field. */
#define RADIO_RXPEAKDETECTOR_IF_DecayStep_Msk (0x3FUL << RADIO_RXPEAKDETECTOR_IF_DecayStep_Pos) /*!< Bit mask of DecayStep field. */

/* Bits 23..12 : Low threshold of IF peak detector. This valued is based on the 11-bits ADC of SPHYNX_ANA */
#define RADIO_RXPEAKDETECTOR_IF_LowThres_Pos (12UL) /*!< Position of LowThres field. */
#define RADIO_RXPEAKDETECTOR_IF_LowThres_Msk (0xFFFUL << RADIO_RXPEAKDETECTOR_IF_LowThres_Pos) /*!< Bit mask of LowThres field. */

/* Bits 11..0 : High threshold of IF peak detector. This valued is based on the 11-bits ADC of SPHYNX_ANA */
#define RADIO_RXPEAKDETECTOR_IF_HighThres_Pos (0UL) /*!< Position of HighThres field. */
#define RADIO_RXPEAKDETECTOR_IF_HighThres_Msk (0xFFFUL << RADIO_RXPEAKDETECTOR_IF_HighThres_Pos) /*!< Bit mask of HighThres field. */

/* Register: RADIO_BITCONVERTER */
/* Description: TODO */

/* Bits 23..12 : ADC offset compensation of channel Q. (signed) */
#define RADIO_BITCONVERTER_FinalCalOffset_Q_Pos (12UL) /*!< Position of FinalCalOffset_Q field. */
#define RADIO_BITCONVERTER_FinalCalOffset_Q_Msk (0xFFFUL << RADIO_BITCONVERTER_FinalCalOffset_Q_Pos) /*!< Bit mask of FinalCalOffset_Q field. */

/* Bits 11..0 : ADC offset compensation of channel I. (signed) */
#define RADIO_BITCONVERTER_FinalCalOffset_I_Pos (0UL) /*!< Position of FinalCalOffset_I field. */
#define RADIO_BITCONVERTER_FinalCalOffset_I_Msk (0xFFFUL << RADIO_BITCONVERTER_FinalCalOffset_I_Pos) /*!< Bit mask of FinalCalOffset_I field. */

/* Register: RADIO_DATAACQVIADMA */
/* Description: TODO */

/* Bit 3 : used to be NrfModem port - dmaAhbCtrlTag, selection of DMA in radio. MUX(Panther/UTxRxChain) */
#define RADIO_DATAACQVIADMA_DmaAhbCtrlTag_Pos (3UL) /*!< Position of DmaAhbCtrlTag field. */
#define RADIO_DATAACQVIADMA_DmaAhbCtrlTag_Msk (0x1UL << RADIO_DATAACQVIADMA_DmaAhbCtrlTag_Pos) /*!< Bit mask of DmaAhbCtrlTag field. */

/* Bits 1..0 : Which of 4 existing mode it is running (each mode correspond the a particular set of data to be logged) */
#define RADIO_DATAACQVIADMA_DataCaptureModeSelect_Pos (0UL) /*!< Position of DataCaptureModeSelect field. */
#define RADIO_DATAACQVIADMA_DataCaptureModeSelect_Msk (0x3UL << RADIO_DATAACQVIADMA_DataCaptureModeSelect_Pos) /*!< Bit mask of DataCaptureModeSelect field. */

/* Register: RADIO_DEBUGRADIOPHY */
/* Description: TODO */

