adamkondraciuk/nrfx/mdk/nrf54lilium_network_bitfields.h
/* Bit 5 : 1: short RCCAL_CODE[3:0] to RX_AAF_RCTRIMM[3:0] */
#define RADIO_DEBUGRADIOPHY_ShortRcCalCodeToAafRcTrim_Pos (5UL) /*!< Position of ShortRcCalCodeToAafRcTrim field. */
#define RADIO_DEBUGRADIOPHY_ShortRcCalCodeToAafRcTrim_Msk (0x1UL << RADIO_DEBUGRADIOPHY_ShortRcCalCodeToAafRcTrim_Pos) /*!< Bit mask of ShortRcCalCodeToAafRcTrim field. */

/* Bit 4 : 1: Invert the sign bit of calibration code for DC offset calibration(invert DCCAL[4]). This inverts both channel I and Q. */
#define RADIO_DEBUGRADIOPHY_RfMixInvertSignBit_Pos (4UL) /*!< Position of RfMixInvertSignBit field. */
#define RADIO_DEBUGRADIOPHY_RfMixInvertSignBit_Msk (0x1UL << RADIO_DEBUGRADIOPHY_RfMixInvertSignBit_Pos) /*!< Bit mask of RfMixInvertSignBit field. */

/* Bit 3 : 0: output normal adcBinaryBQ, 1: tie adcBinaryBQ to zero */
#define RADIO_DEBUGRADIOPHY_TieAdcBQToZero_Pos (3UL) /*!< Position of TieAdcBQToZero field. */
#define RADIO_DEBUGRADIOPHY_TieAdcBQToZero_Msk (0x1UL << RADIO_DEBUGRADIOPHY_TieAdcBQToZero_Pos) /*!< Bit mask of TieAdcBQToZero field. */

/* Bit 2 : 0: output normal adcBinaryBI, 1: tie adcBinaryBI to zero */
#define RADIO_DEBUGRADIOPHY_TieAdcBIToZero_Pos (2UL) /*!< Position of TieAdcBIToZero field. */
#define RADIO_DEBUGRADIOPHY_TieAdcBIToZero_Msk (0x1UL << RADIO_DEBUGRADIOPHY_TieAdcBIToZero_Pos) /*!< Bit mask of TieAdcBIToZero field. */

/* Bit 1 : Set to high to buffer TXPOWER so that sub-modules in the MMI will only update next tx power config at TX_EN, RX_EN and LB_EN. Set to low if special test is needed for Tx test. */
#define RADIO_DEBUGRADIOPHY_BufferedTxPwr_Pos (1UL) /*!< Position of BufferedTxPwr field. */
#define RADIO_DEBUGRADIOPHY_BufferedTxPwr_Msk (0x1UL << RADIO_DEBUGRADIOPHY_BufferedTxPwr_Pos) /*!< Bit mask of BufferedTxPwr field. */

/* Bit 0 : 0: readout latched  gain values from RXAGC_STATUS, 1: readout raw gain values from RXAGC_STATUS */
#define RADIO_DEBUGRADIOPHY_ReadRawGainStatus_Pos (0UL) /*!< Position of ReadRawGainStatus field. */
#define RADIO_DEBUGRADIOPHY_ReadRawGainStatus_Msk (0x1UL << RADIO_DEBUGRADIOPHY_ReadRawGainStatus_Pos) /*!< Bit mask of ReadRawGainStatus field. */

/* Register: RADIO_MODECONF */
/* Description: IQCal status */

/* Bit 16 : temporary 4Mbps special case signal for mixer */
#define RADIO_MODECONF_REMOVE_ME_WHEN_4M_IF_EXISTS_Pos (16UL) /*!< Position of REMOVE_ME_WHEN_4M_IF_EXISTS field. */
#define RADIO_MODECONF_REMOVE_ME_WHEN_4M_IF_EXISTS_Msk (0x1UL << RADIO_MODECONF_REMOVE_ME_WHEN_4M_IF_EXISTS_Pos) /*!< Bit mask of REMOVE_ME_WHEN_4M_IF_EXISTS field. */

/* Bits 2..0 : Mode dependent register with saturation delay for different modes */
#define RADIO_MODECONF_SATDLY_Pos (0UL) /*!< Position of SATDLY field. */
#define RADIO_MODECONF_SATDLY_Msk (0x7UL << RADIO_MODECONF_SATDLY_Pos) /*!< Bit mask of SATDLY field. */

/* Register: RADIO_FESTATUS */
/* Description: Frontend readout register */

/* Bits 27..16 : Magnitude output from BB peak detector */
#define RADIO_FESTATUS_MAGNITUDE_Pos (16UL) /*!< Position of MAGNITUDE field. */
#define RADIO_FESTATUS_MAGNITUDE_Msk (0xFFFUL << RADIO_FESTATUS_MAGNITUDE_Pos) /*!< Bit mask of MAGNITUDE field. */

/* Bit 15 : High when IQCal search finished */
#define RADIO_FESTATUS_CALFIN_Pos (15UL) /*!< Position of CALFIN field. */
#define RADIO_FESTATUS_CALFIN_Msk (0x1UL << RADIO_FESTATUS_CALFIN_Pos) /*!< Bit mask of CALFIN field. */

/* Bits 12..8 : calAmp from IQCal */
#define RADIO_FESTATUS_CALAMP_Pos (8UL) /*!< Position of CALAMP field. */
#define RADIO_FESTATUS_CALAMP_Msk (0x1FUL << RADIO_FESTATUS_CALAMP_Pos) /*!< Bit mask of CALAMP field. */

/* Bits 4..0 : calPhi from IQCal */
#define RADIO_FESTATUS_CALPHI_Pos (0UL) /*!< Position of CALPHI field. */
#define RADIO_FESTATUS_CALPHI_Msk (0x1FUL << RADIO_FESTATUS_CALPHI_Pos) /*!< Bit mask of CALPHI field. */

/* Register: RADIO_FECONFIG */
/* Description: Config for Mixer and Scaler */

/* Bits 13..8 : The number of clock cycles to wait before stepping down the internal memory for the scaling. The value 0 means that the decay feature is off. */
#define RADIO_FECONFIG_SCALERDECAY_Pos (8UL) /*!< Position of SCALERDECAY field. */
#define RADIO_FECONFIG_SCALERDECAY_Msk (0x3FUL << RADIO_FECONFIG_SCALERDECAY_Pos) /*!< Bit mask of SCALERDECAY field. */

/* Bit 0 : Disable Q samples to save power */
#define RADIO_FECONFIG_QDISABLE_Pos (0UL) /*!< Position of QDISABLE field. */
#define RADIO_FECONFIG_QDISABLE_Msk (0x1UL << RADIO_FECONFIG_QDISABLE_Pos) /*!< Bit mask of QDISABLE field. */

/* Register: RADIO_IQCALCONF */
/* Description: Gain and phase mismatch calibration control for I and Q */

/* Bit 31 : Run I and Q calibration procedure */
#define RADIO_IQCALCONF_RUN_Pos (31UL) /*!< Position of RUN field. */
#define RADIO_IQCALCONF_RUN_Msk (0x1UL << RADIO_IQCALCONF_RUN_Pos) /*!< Bit mask of RUN field. */
#define RADIO_IQCALCONF_RUN_Stored (0UL) /*!< Using stored values for calPhi and calAmp */
#define RADIO_IQCALCONF_RUN_Calib (1UL) /*!< Running calibration. */

/* Bits 29..28 : IQCal search mode */
#define RADIO_IQCALCONF_MODE_Pos (28UL) /*!< Position of MODE field. */
#define RADIO_IQCALCONF_MODE_Msk (0x3UL << RADIO_IQCALCONF_MODE_Pos) /*!< Bit mask of MODE field. */
#define RADIO_IQCALCONF_MODE_Optimized (0UL) /*!< Optimized search algorithm. */
#define RADIO_IQCALCONF_MODE_Exhaustive (1UL) /*!< Exhaustive search. */
#define RADIO_IQCALCONF_MODE_Cancellation (2UL) /*!< Optimized search with cancellation. */

/* Bit 27 : Sign of calPhi value */
#define RADIO_IQCALCONF_CALPHISIGN_Pos (27UL) /*!< Position of CALPHISIGN field. */
#define RADIO_IQCALCONF_CALPHISIGN_Msk (0x1UL << RADIO_IQCALCONF_CALPHISIGN_Pos) /*!< Bit mask of CALPHISIGN field. */

/* Bits 20..16 : Stored calPhi value */
#define RADIO_IQCALCONF_CALPHI_Pos (16UL) /*!< Position of CALPHI field. */
#define RADIO_IQCALCONF_CALPHI_Msk (0x1FUL << RADIO_IQCALCONF_CALPHI_Pos) /*!< Bit mask of CALPHI field. */

/* Bits 12..8 : Stored calAmp value */
#define RADIO_IQCALCONF_CALAMP_Pos (8UL) /*!< Position of CALAMP field. */
#define RADIO_IQCALCONF_CALAMP_Msk (0x1FUL << RADIO_IQCALCONF_CALAMP_Pos) /*!< Bit mask of CALAMP field. */

/* Bits 7..0 : Settling time (in number of 16 MHz clock periods) for rssi input to stabilize */
#define RADIO_IQCALCONF_IQCALWAIT_Pos (0UL) /*!< Position of IQCALWAIT field. */
#define RADIO_IQCALCONF_IQCALWAIT_Msk (0xFFUL << RADIO_IQCALCONF_IQCALWAIT_Pos) /*!< Bit mask of IQCALWAIT field. */

