adamkondraciuk/nrfx/mdk/nrf54lilium_network_bitfields.h
/* Register: RADIO_LOGMAG */
/* Description: IQCal status */

/* Bits 15..8 : Alpha for IIR filter used in logMag calculation */
#define RADIO_LOGMAG_ALPHA_Pos (8UL) /*!< Position of ALPHA field. */
#define RADIO_LOGMAG_ALPHA_Msk (0xFFUL << RADIO_LOGMAG_ALPHA_Pos) /*!< Bit mask of ALPHA field. */

/* Register: RADIO_BBPKDETCONF */
/* Description: Configuration for baseband peak detector */

/* Bits 29..24 : Constant output reduction step */
#define RADIO_BBPKDETCONF_DECAYSTEP_Pos (24UL) /*!< Position of DECAYSTEP field. */
#define RADIO_BBPKDETCONF_DECAYSTEP_Msk (0x3FUL << RADIO_BBPKDETCONF_DECAYSTEP_Pos) /*!< Bit mask of DECAYSTEP field. */

/* Bits 23..12 : Low threshold for peak detector */
#define RADIO_BBPKDETCONF_LOWTHRESH_Pos (12UL) /*!< Position of LOWTHRESH field. */
#define RADIO_BBPKDETCONF_LOWTHRESH_Msk (0xFFFUL << RADIO_BBPKDETCONF_LOWTHRESH_Pos) /*!< Bit mask of LOWTHRESH field. */

/* Bits 11..0 : High threshold for peak detector */
#define RADIO_BBPKDETCONF_HIGHTHRES_Pos (0UL) /*!< Position of HIGHTHRES field. */
#define RADIO_BBPKDETCONF_HIGHTHRES_Msk (0xFFFUL << RADIO_BBPKDETCONF_HIGHTHRES_Pos) /*!< Bit mask of HIGHTHRES field. */

/* Register: RADIO_OUTMAIN_CKSEL_DECFIR */
/* Description: Clock select register for the output outMain */

/* Bits 2..0 : Number of times to divide the base clock rate by 2. Exception: highest value gives BYPASS, ie. clock is disabled and data out is assigned directly from data in. */
#define RADIO_OUTMAIN_CKSEL_DECFIR_CKSEL_Pos (0UL) /*!< Position of CKSEL field. */
#define RADIO_OUTMAIN_CKSEL_DECFIR_CKSEL_Msk (0x7UL << RADIO_OUTMAIN_CKSEL_DECFIR_CKSEL_Pos) /*!< Bit mask of CKSEL field. */
#define RADIO_OUTMAIN_CKSEL_DECFIR_CKSEL_ClkSel_32M (0UL) /*!< CKSEL_32M */
#define RADIO_OUTMAIN_CKSEL_DECFIR_CKSEL_ClkSel_16M (1UL) /*!< CKSEL_16M */
#define RADIO_OUTMAIN_CKSEL_DECFIR_CKSEL_ClkSel_8M (2UL) /*!< CKSEL_8M */
#define RADIO_OUTMAIN_CKSEL_DECFIR_CKSEL_ClkSel_4M (3UL) /*!< CKSEL_4M */
#define RADIO_OUTMAIN_CKSEL_DECFIR_CKSEL_ClkSel_2M (4UL) /*!< CKSEL_2M */
#define RADIO_OUTMAIN_CKSEL_DECFIR_CKSEL_ClkSel_1M (5UL) /*!< CKSEL_1M */
#define RADIO_OUTMAIN_CKSEL_DECFIR_CKSEL_ClkSel_500K (6UL) /*!< CKSEL_500K */
#define RADIO_OUTMAIN_CKSEL_DECFIR_CKSEL_ClkSel_Bypass (7UL) /*!< CKSEL_BYPASS */

/* Register: RADIO_DECFIR0_CKSEL */
/* Description: Clock select register for the PUnit decFIR0 of type IP_FIR */

/* Bits 2..0 : Number of times to divide the base clock rate by 2. Exception: highest value gives BYPASS, ie. clock is disabled and data out is assigned directly from data in. */
#define RADIO_DECFIR0_CKSEL_CKSEL_Pos (0UL) /*!< Position of CKSEL field. */
#define RADIO_DECFIR0_CKSEL_CKSEL_Msk (0x7UL << RADIO_DECFIR0_CKSEL_CKSEL_Pos) /*!< Bit mask of CKSEL field. */
#define RADIO_DECFIR0_CKSEL_CKSEL_ClkSel_32M (0UL) /*!< CKSEL_32M */
#define RADIO_DECFIR0_CKSEL_CKSEL_ClkSel_16M (1UL) /*!< CKSEL_16M */
#define RADIO_DECFIR0_CKSEL_CKSEL_ClkSel_8M (2UL) /*!< CKSEL_8M */
#define RADIO_DECFIR0_CKSEL_CKSEL_ClkSel_4M (3UL) /*!< CKSEL_4M */
#define RADIO_DECFIR0_CKSEL_CKSEL_ClkSel_2M (4UL) /*!< CKSEL_2M */
#define RADIO_DECFIR0_CKSEL_CKSEL_ClkSel_1M (5UL) /*!< CKSEL_1M */
#define RADIO_DECFIR0_CKSEL_CKSEL_ClkSel_500k (6UL) /*!< CKSEL_500K */
#define RADIO_DECFIR0_CKSEL_CKSEL_ClkSel_Bypass (7UL) /*!< CKSEL_BYPASS */

/* Register: RADIO_DECFIR0_CONTROL */
/* Description: Control register for the PUnit decFIR0 of type IP_FIR */

/* Bits 1..0 : Tap-select: number of active taps minus 2 */
#define RADIO_DECFIR0_CONTROL_TAPSEL_Pos (0UL) /*!< Position of TAPSEL field. */
#define RADIO_DECFIR0_CONTROL_TAPSEL_Msk (0x3UL << RADIO_DECFIR0_CONTROL_TAPSEL_Pos) /*!< Bit mask of TAPSEL field. */

/* Register: RADIO_DECFIR0_COEFFS_0 */
/* Description: Coefficient register 0 for the PUnit decFIR0 of type IP_FIR */

/* Bits 3..0 : Signed filter coefficient 0 */
#define RADIO_DECFIR0_COEFFS_0_COEFFS_0_Pos (0UL) /*!< Position of COEFFS_0 field. */
#define RADIO_DECFIR0_COEFFS_0_COEFFS_0_Msk (0xFUL << RADIO_DECFIR0_COEFFS_0_COEFFS_0_Pos) /*!< Bit mask of COEFFS_0 field. */

/* Register: RADIO_DECFIR0_COEFFS_1 */
/* Description: Coefficient register 1 for the PUnit decFIR0 of type IP_FIR */

/* Bits 3..0 : Signed filter coefficient 1 */
#define RADIO_DECFIR0_COEFFS_1_COEFFS_1_Pos (0UL) /*!< Position of COEFFS_1 field. */
#define RADIO_DECFIR0_COEFFS_1_COEFFS_1_Msk (0xFUL << RADIO_DECFIR0_COEFFS_1_COEFFS_1_Pos) /*!< Bit mask of COEFFS_1 field. */

/* Register: RADIO_DECFIR0_COEFFS_2 */
/* Description: Coefficient register 2 for the PUnit decFIR0 of type IP_FIR */

/* Bits 3..0 : Signed filter coefficient 2 */
#define RADIO_DECFIR0_COEFFS_2_COEFFS_2_Pos (0UL) /*!< Position of COEFFS_2 field. */
#define RADIO_DECFIR0_COEFFS_2_COEFFS_2_Msk (0xFUL << RADIO_DECFIR0_COEFFS_2_COEFFS_2_Pos) /*!< Bit mask of COEFFS_2 field. */

/* Register: RADIO_DECFIR0_COEFFS_3 */
/* Description: Coefficient register 3 for the PUnit decFIR0 of type IP_FIR */

/* Bits 3..0 : Signed filter coefficient 3 */
#define RADIO_DECFIR0_COEFFS_3_COEFFS_3_Pos (0UL) /*!< Position of COEFFS_3 field. */
#define RADIO_DECFIR0_COEFFS_3_COEFFS_3_Msk (0xFUL << RADIO_DECFIR0_COEFFS_3_COEFFS_3_Pos) /*!< Bit mask of COEFFS_3 field. */

/* Register: RADIO_DECFIR1_CKSEL */
/* Description: Clock select register for the PUnit decFIR1 of type IP_FIR */

/* Bits 2..0 : Number of times to divide the base clock rate by 2. Exception: highest value gives BYPASS, ie. clock is disabled and data out is assigned directly from data in. */
#define RADIO_DECFIR1_CKSEL_CKSEL_Pos (0UL) /*!< Position of CKSEL field. */
#define RADIO_DECFIR1_CKSEL_CKSEL_Msk (0x7UL << RADIO_DECFIR1_CKSEL_CKSEL_Pos) /*!< Bit mask of CKSEL field. */
#define RADIO_DECFIR1_CKSEL_CKSEL_ClkSel_32M (0UL) /*!< CKSEL_32M */
#define RADIO_DECFIR1_CKSEL_CKSEL_ClkSel_16M (1UL) /*!< CKSEL_16M */
#define RADIO_DECFIR1_CKSEL_CKSEL_ClkSel_8M (2UL) /*!< CKSEL_8M */
#define RADIO_DECFIR1_CKSEL_CKSEL_ClkSel_4M (3UL) /*!< CKSEL_4M */
#define RADIO_DECFIR1_CKSEL_CKSEL_ClkSel_2M (4UL) /*!< CKSEL_2M */
#define RADIO_DECFIR1_CKSEL_CKSEL_ClkSel_1M (5UL) /*!< CKSEL_1M */
#define RADIO_DECFIR1_CKSEL_CKSEL_ClkSel_500K (6UL) /*!< CKSEL_500K */
#define RADIO_DECFIR1_CKSEL_CKSEL_ClkSel_Bypass (7UL) /*!< CKSEL_BYPASS */

