adamkondraciuk/nrfx/mdk/nrf54lilium_network_bitfields.h
/* Register: RADIO_IIR0_COEFFS_B2 */
/* Description: Coefficient register B2 for the PUnit IIR0 of type IP_IIR2 */

/* Bits 9..0 : Signed filter coefficient B2 */
#define RADIO_IIR0_COEFFS_B2_COEFFS_B2_Pos (0UL) /*!< Position of COEFFS_B2 field. */
#define RADIO_IIR0_COEFFS_B2_COEFFS_B2_Msk (0x3FFUL << RADIO_IIR0_COEFFS_B2_COEFFS_B2_Pos) /*!< Bit mask of COEFFS_B2 field. */

/* Register: RADIO_IIR0_COEFFS_A1 */
/* Description: Coefficient register A1 for the PUnit IIR0 of type IP_IIR2 */

/* Bits 9..0 : Signed filter coefficient A1 */
#define RADIO_IIR0_COEFFS_A1_COEFFS_A1_Pos (0UL) /*!< Position of COEFFS_A1 field. */
#define RADIO_IIR0_COEFFS_A1_COEFFS_A1_Msk (0x3FFUL << RADIO_IIR0_COEFFS_A1_COEFFS_A1_Pos) /*!< Bit mask of COEFFS_A1 field. */

/* Register: RADIO_IIR0_COEFFS_A2 */
/* Description: Coefficient register A2 for the PUnit IIR0 of type IP_IIR2 */

/* Bits 9..0 : Signed filter coefficient A2 */
#define RADIO_IIR0_COEFFS_A2_COEFFS_A2_Pos (0UL) /*!< Position of COEFFS_A2 field. */
#define RADIO_IIR0_COEFFS_A2_COEFFS_A2_Msk (0x3FFUL << RADIO_IIR0_COEFFS_A2_COEFFS_A2_Pos) /*!< Bit mask of COEFFS_A2 field. */

/* Register: RADIO_IIR1_CKSEL */
/* Description: Clock select register for the PUnit IIR1 of type IP_IIR2 */

/* Bits 2..0 : Number of times to divide the base clock rate by 2. Exception: highest value gives BYPASS, ie. clock is disabled and data out is assigned directly from data in. */
#define RADIO_IIR1_CKSEL_CKSEL_Pos (0UL) /*!< Position of CKSEL field. */
#define RADIO_IIR1_CKSEL_CKSEL_Msk (0x7UL << RADIO_IIR1_CKSEL_CKSEL_Pos) /*!< Bit mask of CKSEL field. */
#define RADIO_IIR1_CKSEL_CKSEL_ClkSel_32M (0UL) /*!< CKSEL_32M */
#define RADIO_IIR1_CKSEL_CKSEL_ClkSel_16M (1UL) /*!< CKSEL_16M */
#define RADIO_IIR1_CKSEL_CKSEL_ClkSel_8M (2UL) /*!< CKSEL_8M */
#define RADIO_IIR1_CKSEL_CKSEL_ClkSel_4M (3UL) /*!< CKSEL_4M */
#define RADIO_IIR1_CKSEL_CKSEL_ClkSel_2M (4UL) /*!< CKSEL_2M */
#define RADIO_IIR1_CKSEL_CKSEL_ClkSel_1M (5UL) /*!< CKSEL_1M */
#define RADIO_IIR1_CKSEL_CKSEL_ClkSel_500K (6UL) /*!< CKSEL_500K */
#define RADIO_IIR1_CKSEL_CKSEL_ClkSel_Bypass (7UL) /*!< CKSEL_BYPASS */

/* Register: RADIO_IIR1_STATUS */
/* Description: Status register for the PUnit IIR1 of type IP_IIR2 */

/* Bits 1..0 : Saturation status for I/Q (bit 0/1) component (bitwise write 1 to clear) */
#define RADIO_IIR1_STATUS_SATURATION_IQ_Pos (0UL) /*!< Position of SATURATION_IQ field. */
#define RADIO_IIR1_STATUS_SATURATION_IQ_Msk (0x3UL << RADIO_IIR1_STATUS_SATURATION_IQ_Pos) /*!< Bit mask of SATURATION_IQ field. */

/* Register: RADIO_IIR1_COEFFS_B0 */
/* Description: Coefficient register B0 for the PUnit IIR1 of type IP_IIR2 */

/* Bits 8..0 : Signed filter coefficient B0 */
#define RADIO_IIR1_COEFFS_B0_COEFFS_B0_Pos (0UL) /*!< Position of COEFFS_B0 field. */
#define RADIO_IIR1_COEFFS_B0_COEFFS_B0_Msk (0x1FFUL << RADIO_IIR1_COEFFS_B0_COEFFS_B0_Pos) /*!< Bit mask of COEFFS_B0 field. */

/* Register: RADIO_IIR1_COEFFS_B1 */
/* Description: Coefficient register B1 for the PUnit IIR1 of type IP_IIR2 */

/* Bits 8..0 : Signed filter coefficient B1 */
#define RADIO_IIR1_COEFFS_B1_COEFFS_B1_Pos (0UL) /*!< Position of COEFFS_B1 field. */
#define RADIO_IIR1_COEFFS_B1_COEFFS_B1_Msk (0x1FFUL << RADIO_IIR1_COEFFS_B1_COEFFS_B1_Pos) /*!< Bit mask of COEFFS_B1 field. */

/* Register: RADIO_IIR1_COEFFS_B2 */
/* Description: Coefficient register B2 for the PUnit IIR1 of type IP_IIR2 */

/* Bits 8..0 : Signed filter coefficient B2 */
#define RADIO_IIR1_COEFFS_B2_COEFFS_B2_Pos (0UL) /*!< Position of COEFFS_B2 field. */
#define RADIO_IIR1_COEFFS_B2_COEFFS_B2_Msk (0x1FFUL << RADIO_IIR1_COEFFS_B2_COEFFS_B2_Pos) /*!< Bit mask of COEFFS_B2 field. */

/* Register: RADIO_IIR1_COEFFS_A1 */
/* Description: Coefficient register A1 for the PUnit IIR1 of type IP_IIR2 */

/* Bits 8..0 : Signed filter coefficient A1 */
#define RADIO_IIR1_COEFFS_A1_COEFFS_A1_Pos (0UL) /*!< Position of COEFFS_A1 field. */
#define RADIO_IIR1_COEFFS_A1_COEFFS_A1_Msk (0x1FFUL << RADIO_IIR1_COEFFS_A1_COEFFS_A1_Pos) /*!< Bit mask of COEFFS_A1 field. */

/* Register: RADIO_IIR1_COEFFS_A2 */
/* Description: Coefficient register A2 for the PUnit IIR1 of type IP_IIR2 */

/* Bits 8..0 : Signed filter coefficient A2 */
#define RADIO_IIR1_COEFFS_A2_COEFFS_A2_Pos (0UL) /*!< Position of COEFFS_A2 field. */
#define RADIO_IIR1_COEFFS_A2_COEFFS_A2_Msk (0x1FFUL << RADIO_IIR1_COEFFS_A2_COEFFS_A2_Pos) /*!< Bit mask of COEFFS_A2 field. */

/* Register: RADIO_NOTCHIIR0_CKSEL */
/* Description: Clock select register for the PUnit notchIIR0 of type IP_IIR2 */

/* Bits 2..0 : Number of times to divide the base clock rate by 2. Exception: highest value gives BYPASS, ie. clock is disabled and data out is assigned directly from data in. */
#define RADIO_NOTCHIIR0_CKSEL_CKSEL_Pos (0UL) /*!< Position of CKSEL field. */
#define RADIO_NOTCHIIR0_CKSEL_CKSEL_Msk (0x7UL << RADIO_NOTCHIIR0_CKSEL_CKSEL_Pos) /*!< Bit mask of CKSEL field. */
#define RADIO_NOTCHIIR0_CKSEL_CKSEL_ClkSel_32M (0UL) /*!< CKSEL_32M */
#define RADIO_NOTCHIIR0_CKSEL_CKSEL_ClkSel_16M (1UL) /*!< CKSEL_16M */
#define RADIO_NOTCHIIR0_CKSEL_CKSEL_ClkSel_8M (2UL) /*!< CKSEL_8M */
#define RADIO_NOTCHIIR0_CKSEL_CKSEL_ClkSel_4M (3UL) /*!< CKSEL_4M */
#define RADIO_NOTCHIIR0_CKSEL_CKSEL_ClkSel_2M (4UL) /*!< CKSEL_2M */
#define RADIO_NOTCHIIR0_CKSEL_CKSEL_ClkSel_1M (5UL) /*!< CKSEL_1M */
#define RADIO_NOTCHIIR0_CKSEL_CKSEL_ClkSel_500K (6UL) /*!< CKSEL_500K */
#define RADIO_NOTCHIIR0_CKSEL_CKSEL_ClkSel_Bypass (7UL) /*!< CKSEL_BYPASS */

/* Register: RADIO_NOTCHIIR0_SOURCE */
/* Description: Source select register for the PUnit notchIIR0 of type IP_IIR2 */

/* Bits 3..0 : Data source select */
#define RADIO_NOTCHIIR0_SOURCE_SOURCE_Pos (0UL) /*!< Position of SOURCE field. */
#define RADIO_NOTCHIIR0_SOURCE_SOURCE_Msk (0xFUL << RADIO_NOTCHIIR0_SOURCE_SOURCE_Pos) /*!< Bit mask of SOURCE field. */
#define RADIO_NOTCHIIR0_SOURCE_SOURCE_Src_IIR0 (0UL) /*!< SRC_IIR0 (NOT LEGAL) */
#define RADIO_NOTCHIIR0_SOURCE_SOURCE_Src_IIR1 (1UL) /*!< SRC_IIR1 (NOT LEGAL) */
#define RADIO_NOTCHIIR0_SOURCE_SOURCE_Src_NotChIIR0 (2UL) /*!< SRC_NOTCHIIR0 (NOT LEGAL) */
#define RADIO_NOTCHIIR0_SOURCE_SOURCE_Src_NotChIIR1 (3UL) /*!< SRC_NOTCHIIR1 */
#define RADIO_NOTCHIIR0_SOURCE_SOURCE_Src_DecFIR (4UL) /*!< SRC_DECFIR */
#define RADIO_NOTCHIIR0_SOURCE_SOURCE_Src_InMain (15UL) /*!< SRC_INMAIN (NOT LEGAL) */

/* Register: RADIO_NOTCHIIR0_STATUS */
/* Description: Status register for the PUnit notchIIR0 of type IP_IIR2 */

