adamkondraciuk/nrfx/mdk/nrf54lilium_network_bitfields.h
/* Bits 15..8 : Correlation threshold for double correlator used in BleLr mode to reject a later resync using DBCCORRTHSTRICT. */
#define RADIO_QOVERRIDE25_DBCCORRTHPREVREQUIR_Pos (8UL) /*!< Position of DBCCORRTHPREVREQUIR field. */
#define RADIO_QOVERRIDE25_DBCCORRTHPREVREQUIR_Msk (0xFFUL << RADIO_QOVERRIDE25_DBCCORRTHPREVREQUIR_Pos) /*!< Bit mask of DBCCORRTHPREVREQUIR field. */

/* Bits 7..0 : Correlation threshold for double correlator used in BleLr mode to resync to another preamble while already working on a previous preamble. */
#define RADIO_QOVERRIDE25_DBCCORRTHSTRICT_Pos (0UL) /*!< Position of DBCCORRTHSTRICT field. */
#define RADIO_QOVERRIDE25_DBCCORRTHSTRICT_Msk (0xFFUL << RADIO_QOVERRIDE25_DBCCORRTHSTRICT_Pos) /*!< Bit mask of DBCCORRTHSTRICT field. */

/* Register: RADIO_DBCPEAKDETTHR */
/* Description: Thresholds for each peak detector instance */

/* Bits 31..24 : Diff threshold 3 */
#define RADIO_DBCPEAKDETTHR_THR3_Pos (24UL) /*!< Position of THR3 field. */
#define RADIO_DBCPEAKDETTHR_THR3_Msk (0xFFUL << RADIO_DBCPEAKDETTHR_THR3_Pos) /*!< Bit mask of THR3 field. */

/* Bits 23..16 : Diff threshold 2 */
#define RADIO_DBCPEAKDETTHR_THR2_Pos (16UL) /*!< Position of THR2 field. */
#define RADIO_DBCPEAKDETTHR_THR2_Msk (0xFFUL << RADIO_DBCPEAKDETTHR_THR2_Pos) /*!< Bit mask of THR2 field. */

/* Bits 15..8 : Diff threshold 1 */
#define RADIO_DBCPEAKDETTHR_THR1_Pos (8UL) /*!< Position of THR1 field. */
#define RADIO_DBCPEAKDETTHR_THR1_Msk (0xFFUL << RADIO_DBCPEAKDETTHR_THR1_Pos) /*!< Bit mask of THR1 field. */

/* Bits 7..0 : Diff threshold 0 */
#define RADIO_DBCPEAKDETTHR_THR0_Pos (0UL) /*!< Position of THR0 field. */
#define RADIO_DBCPEAKDETTHR_THR0_Msk (0xFFUL << RADIO_DBCPEAKDETTHR_THR0_Pos) /*!< Bit mask of THR0 field. */

/* Register: RADIO_BITSLICER_STAT */
/* Description: Payload status */

/* Bits 27..16 : Number of received ones */
#define RADIO_BITSLICER_STAT_SUM_MAX_Pos (16UL) /*!< Position of SUM_MAX field. */
#define RADIO_BITSLICER_STAT_SUM_MAX_Msk (0xFFFUL << RADIO_BITSLICER_STAT_SUM_MAX_Pos) /*!< Bit mask of SUM_MAX field. */

/* Bits 11..0 : Number of received zeros */
#define RADIO_BITSLICER_STAT_SUM_MIN_Pos (0UL) /*!< Position of SUM_MIN field. */
#define RADIO_BITSLICER_STAT_SUM_MIN_Msk (0xFFFUL << RADIO_BITSLICER_STAT_SUM_MIN_Pos) /*!< Bit mask of SUM_MIN field. */

/* Register: RADIO_BBCTRL */
/* Description: Miscellaneous mode bits */

/* Bits 10..8 : Modulation index for RxDBCCoeffGen and RxMFB */
#define RADIO_BBCTRL_MODINDEX_Pos (8UL) /*!< Position of MODINDEX field. */
#define RADIO_BBCTRL_MODINDEX_Msk (0x7UL << RADIO_BBCTRL_MODINDEX_Pos) /*!< Bit mask of MODINDEX field. */
#define RADIO_BBCTRL_MODINDEX_ModIndex_0h25 (0UL) /*!< MODINDEX_0H25 */
#define RADIO_BBCTRL_MODINDEX_ModIndex_0h32 (1UL) /*!< MODINDEX_0H32 */
#define RADIO_BBCTRL_MODINDEX_ModIndex_0h5 (2UL) /*!< MODINDEX_0H5 */
#define RADIO_BBCTRL_MODINDEX_ModIndex_1h0 (3UL) /*!< MODINDEX_1H0 */
#define RADIO_BBCTRL_MODINDEX_ModIndex_2h0 (4UL) /*!< MODINDEX_2H0 */
#define RADIO_BBCTRL_MODINDEX_Reserved_5 (5UL) /*!< MODINDEX_RESERVED5 */
#define RADIO_BBCTRL_MODINDEX_Reserved_6 (6UL) /*!< MODINDEX_RESERVED6 */
#define RADIO_BBCTRL_MODINDEX_Reserved_7 (7UL) /*!< MODINDEX_RESERVED7 */

/* Bits 6..4 : Decimation mode in PantherDemodFilt */
#define RADIO_BBCTRL_DEMODFILTMODE_Pos (4UL) /*!< Position of DEMODFILTMODE field. */
#define RADIO_BBCTRL_DEMODFILTMODE_Msk (0x7UL << RADIO_BBCTRL_DEMODFILTMODE_Pos) /*!< Bit mask of DEMODFILTMODE field. */
#define RADIO_BBCTRL_DEMODFILTMODE_Decimation_2M (0UL) /*!< DEMODFILTMODE_2M */
#define RADIO_BBCTRL_DEMODFILTMODE_Decimation_1M (1UL) /*!< DEMODFILTMODE_1M */
#define RADIO_BBCTRL_DEMODFILTMODE_Reserved_2 (2UL) /*!< DEMODFILTMODE_RESERVED2 */
#define RADIO_BBCTRL_DEMODFILTMODE_Decimation_250K (3UL) /*!< DEMODFILTMODE_250K */
#define RADIO_BBCTRL_DEMODFILTMODE_Reserved_4 (4UL) /*!< DEMODFILTMODE_RESERVED4 */
#define RADIO_BBCTRL_DEMODFILTMODE_Reserved_5 (5UL) /*!< DEMODFILTMODE_RESERVED5 */
#define RADIO_BBCTRL_DEMODFILTMODE_Reserved_6 (6UL) /*!< DEMODFILTMODE_RESERVED6 */
#define RADIO_BBCTRL_DEMODFILTMODE_Reserved_7 (7UL) /*!< DEMODFILTMODE_RESERVED7 */

/* Bit 1 : Enable 15.4 mode (enabling both 15.4 and long range is not legal) */
#define RADIO_BBCTRL_IEEE802154_Pos (1UL) /*!< Position of IEEE802154 field. */
#define RADIO_BBCTRL_IEEE802154_Msk (0x1UL << RADIO_BBCTRL_IEEE802154_Pos) /*!< Bit mask of IEEE802154 field. */
#define RADIO_BBCTRL_IEEE802154_Disable (0UL) /*!< IEEE802154_NO */
#define RADIO_BBCTRL_IEEE802154_Enable (1UL) /*!< IEEE802154_YES */

/* Bit 0 : Enable long range mode (enabling both 15.4 and long range is not legal) */
#define RADIO_BBCTRL_BLELONGRANGE_Pos (0UL) /*!< Position of BLELONGRANGE field. */
#define RADIO_BBCTRL_BLELONGRANGE_Msk (0x1UL << RADIO_BBCTRL_BLELONGRANGE_Pos) /*!< Bit mask of BLELONGRANGE field. */
#define RADIO_BBCTRL_BLELONGRANGE_Disable (0UL) /*!< BLELONGRANGE_NO */
#define RADIO_BBCTRL_BLELONGRANGE_Enable (1UL) /*!< BLELONGRANGE_YES */

/* Register: RADIO_DBCCORR */
/* Description: Thresholds for the double correlator */

/* Bits 31..24 : Override value for address match timeout, [in bit periods] (hypermode). 0 means no timeout. If BALEN is 3, the actual value of DBCADDRTIMEOUT will be the value written to this register minus 8. */
#define RADIO_DBCCORR_ADDRTIMEOUT_Pos (24UL) /*!< Position of ADDRTIMEOUT field. */
#define RADIO_DBCCORR_ADDRTIMEOUT_Msk (0xFFUL << RADIO_DBCCORR_ADDRTIMEOUT_Pos) /*!< Bit mask of ADDRTIMEOUT field. */

/* Bits 23..16 : Correlation threshold for double correlator used in BleLr mode to reject a later resync using DBCCORRTHSTRICT. Also applies for Ieee 802.15.4 mode */
#define RADIO_DBCCORR_PREVREQUIR_Pos (16UL) /*!< Position of PREVREQUIR field. */
#define RADIO_DBCCORR_PREVREQUIR_Msk (0xFFUL << RADIO_DBCCORR_PREVREQUIR_Pos) /*!< Bit mask of PREVREQUIR field. */

/* Bits 15..8 : Correlation threshold for double correlator used in BleLr mode to resync to another preamble while already working on a previous preamble. Also applies for Ieee 802.15.4 mode */
#define RADIO_DBCCORR_STRICT_Pos (8UL) /*!< Position of STRICT field. */
#define RADIO_DBCCORR_STRICT_Msk (0xFFUL << RADIO_DBCCORR_STRICT_Pos) /*!< Bit mask of STRICT field. */

/* Bits 7..0 : Correlation threshold for double correlator in normal operation */
#define RADIO_DBCCORR_TH_Pos (0UL) /*!< Position of TH field. */
#define RADIO_DBCCORR_TH_Msk (0xFFUL << RADIO_DBCCORR_TH_Pos) /*!< Bit mask of TH field. */

/* Register: RADIO_DSSS */
/* Description: DSSS synchronizer trim values */

/* Bit 25 : Enable strobe time averaging */
#define RADIO_DSSS_ENSTAVE_Pos (25UL) /*!< Position of ENSTAVE field. */
#define RADIO_DSSS_ENSTAVE_Msk (0x1UL << RADIO_DSSS_ENSTAVE_Pos) /*!< Bit mask of ENSTAVE field. */

