adamkondraciuk/nrfx/mdk/nrf54lilium_network_bitfields.h
/* Bit 24 : Enable CFO averaging */
#define RADIO_DSSS_ENCFOAVE_Pos (24UL) /*!< Position of ENCFOAVE field. */
#define RADIO_DSSS_ENCFOAVE_Msk (0x1UL << RADIO_DSSS_ENCFOAVE_Pos) /*!< Bit mask of ENCFOAVE field. */

/* Bits 18..16 : Min number of peaks to detect before resyncing to another preamble while already working on a previous preamble in BleLrx. Also applies for Ieee 802.15.4 mode */
#define RADIO_DSSS_MINPEAKCOUNTSTRICT_Pos (16UL) /*!< Position of MINPEAKCOUNTSTRICT field. */
#define RADIO_DSSS_MINPEAKCOUNTSTRICT_Msk (0x7UL << RADIO_DSSS_MINPEAKCOUNTSTRICT_Pos) /*!< Bit mask of MINPEAKCOUNTSTRICT field. */

/* Bits 10..8 : Override for dsssMinPeakCount */
#define RADIO_DSSS_MINPEAKCOUNT_Pos (8UL) /*!< Position of MINPEAKCOUNT field. */
#define RADIO_DSSS_MINPEAKCOUNT_Msk (0x7UL << RADIO_DSSS_MINPEAKCOUNT_Pos) /*!< Bit mask of MINPEAKCOUNT field. */

/* Bits 2..0 : Override for dsssPeakDistanceTolerance */
#define RADIO_DSSS_PEAKDISTTOL_Pos (0UL) /*!< Position of PEAKDISTTOL field. */
#define RADIO_DSSS_PEAKDISTTOL_Msk (0x7UL << RADIO_DSSS_PEAKDISTTOL_Pos) /*!< Bit mask of PEAKDISTTOL field. */

/* Register: RADIO_BSCONFIG */
/* Description: Bitslicer configuration */

/* Bit 15 : Override for bsYlevAlg */
#define RADIO_BSCONFIG_YLEVALG_Pos (15UL) /*!< Position of YLEVALG field. */
#define RADIO_BSCONFIG_YLEVALG_Msk (0x1UL << RADIO_BSCONFIG_YLEVALG_Pos) /*!< Bit mask of YLEVALG field. */

/* Bits 14..12 : Override for bsStrobeDelay */
#define RADIO_BSCONFIG_STROBEDELAY_Pos (12UL) /*!< Position of STROBEDELAY field. */
#define RADIO_BSCONFIG_STROBEDELAY_Msk (0x7UL << RADIO_BSCONFIG_STROBEDELAY_Pos) /*!< Bit mask of STROBEDELAY field. */

/* Bit 11 : Override for bsStrobeDataIn */
#define RADIO_BSCONFIG_STROBEDATAIN_Pos (11UL) /*!< Position of STROBEDATAIN field. */
#define RADIO_BSCONFIG_STROBEDATAIN_Msk (0x1UL << RADIO_BSCONFIG_STROBEDATAIN_Pos) /*!< Bit mask of STROBEDATAIN field. */

/* Bits 10..4 : Override for bsDataPeak2Peak */
#define RADIO_BSCONFIG_DATAPEAK2PEAK_Pos (4UL) /*!< Position of DATAPEAK2PEAK field. */
#define RADIO_BSCONFIG_DATAPEAK2PEAK_Msk (0x7FUL << RADIO_BSCONFIG_DATAPEAK2PEAK_Pos) /*!< Bit mask of DATAPEAK2PEAK field. */

/* Bit 3 : Override for bsEnableThresholdAdjust */
#define RADIO_BSCONFIG_ENABLETHRESHOLDADJUST_Pos (3UL) /*!< Position of ENABLETHRESHOLDADJUST field. */
#define RADIO_BSCONFIG_ENABLETHRESHOLDADJUST_Msk (0x1UL << RADIO_BSCONFIG_ENABLETHRESHOLDADJUST_Pos) /*!< Bit mask of ENABLETHRESHOLDADJUST field. */

/* Bit 2 : Override for bsDisablePreambleBlock */
#define RADIO_BSCONFIG_DISABLEPREAMBLEBLOCK_Pos (2UL) /*!< Position of DISABLEPREAMBLEBLOCK field. */
#define RADIO_BSCONFIG_DISABLEPREAMBLEBLOCK_Msk (0x1UL << RADIO_BSCONFIG_DISABLEPREAMBLEBLOCK_Pos) /*!< Bit mask of DISABLEPREAMBLEBLOCK field. */

/* Bits 1..0 : Override for bsBitLengthToleranse */
#define RADIO_BSCONFIG_BITLENGTHTOLERANSE_Pos (0UL) /*!< Position of BITLENGTHTOLERANSE field. */
#define RADIO_BSCONFIG_BITLENGTHTOLERANSE_Msk (0x3UL << RADIO_BSCONFIG_BITLENGTHTOLERANSE_Pos) /*!< Bit mask of BITLENGTHTOLERANSE field. */

/* Register: RADIO_MFB */
/* Description: Matched Filter Bank (MFB) configuration */

/* Bit 7 : Bypass majority vote */
#define RADIO_MFB_BYPASSMAJVOTE_Pos (7UL) /*!< Position of BYPASSMAJVOTE field. */
#define RADIO_MFB_BYPASSMAJVOTE_Msk (0x1UL << RADIO_MFB_BYPASSMAJVOTE_Pos) /*!< Bit mask of BYPASSMAJVOTE field. */
#define RADIO_MFB_BYPASSMAJVOTE_PASS (0UL) /*!< Majority vite */
#define RADIO_MFB_BYPASSMAJVOTE_BYPASS (1UL) /*!< Bypass through majority vote */

/* Bits 2..0 : Override value for strobe offset */
#define RADIO_MFB_STRBOFFSET_Pos (0UL) /*!< Position of STRBOFFSET field. */
#define RADIO_MFB_STRBOFFSET_Msk (0x7UL << RADIO_MFB_STRBOFFSET_Pos) /*!< Bit mask of STRBOFFSET field. */

/* Register: RADIO_DRIFT1 */
/* Description: Drift Estimator configuration */

/* Bit 24 : Enable saturation in drift calculator for all modes */
#define RADIO_DRIFT1_SATENABLEALWAYS_Pos (24UL) /*!< Position of SATENABLEALWAYS field. */
#define RADIO_DRIFT1_SATENABLEALWAYS_Msk (0x1UL << RADIO_DRIFT1_SATENABLEALWAYS_Pos) /*!< Bit mask of SATENABLEALWAYS field. */

/* Bits 16..8 : Override value for driftValidTh, drift estimator (hypermode) */
#define RADIO_DRIFT1_VALIDTH_Pos (8UL) /*!< Position of VALIDTH field. */
#define RADIO_DRIFT1_VALIDTH_Msk (0x1FFUL << RADIO_DRIFT1_VALIDTH_Pos) /*!< Bit mask of VALIDTH field. */

/* Bits 7..0 : Override value for IIR feedback , drift estimator (hypermode) */
#define RADIO_DRIFT1_ALPHA_Pos (0UL) /*!< Position of ALPHA field. */
#define RADIO_DRIFT1_ALPHA_Msk (0xFFUL << RADIO_DRIFT1_ALPHA_Pos) /*!< Bit mask of ALPHA field. */

/* Register: RADIO_DRIFT2 */
/* Description: Drift Estimator configuration */

/* Bits 28..20 : Override value for driftDelayTh, drift estimator (hypermode) */
#define RADIO_DRIFT2_DELAYTH_Pos (20UL) /*!< Position of DELAYTH field. */
#define RADIO_DRIFT2_DELAYTH_Msk (0x1FFUL << RADIO_DRIFT2_DELAYTH_Pos) /*!< Bit mask of DELAYTH field. */

/* Bits 19..16 : Override value for driftMaxDist, drift estimator (hypermode) */
#define RADIO_DRIFT2_MAXDIST_Pos (16UL) /*!< Position of MAXDIST field. */
#define RADIO_DRIFT2_MAXDIST_Msk (0xFUL << RADIO_DRIFT2_MAXDIST_Pos) /*!< Bit mask of MAXDIST field. */

/* Bits 8..0 : Override value for driftLowTh, drift estimator (hypermode) */
#define RADIO_DRIFT2_LOWTH_Pos (0UL) /*!< Position of LOWTH field. */
#define RADIO_DRIFT2_LOWTH_Msk (0x1FFUL << RADIO_DRIFT2_LOWTH_Pos) /*!< Bit mask of LOWTH field. */

/* Register: RADIO_CN */
/* Description: Configuration for the CNRIPPLEWARN functionality used for BLE LR. Configuration is only enabled when OVRENCNRIPPLEWARNCFG in OVERRIDE23 is set */

/* Bits 31..16 : maximum baseline value before the peak at the double correlator output. if the baseline value is above the threshold, the following peak will be ignored. this value is ignored when CNABSMAXTHR is set to 0x0000. */
#define RADIO_CN_ABSMAXTHR_Pos (16UL) /*!< Position of ABSMAXTHR field. */
#define RADIO_CN_ABSMAXTHR_Msk (0xFFFFUL << RADIO_CN_ABSMAXTHR_Pos) /*!< Bit mask of ABSMAXTHR field. */

