adamkondraciuk/nrfx/mdk/nrf54lilium_network_bitfields.h
/* Bits 15..0 : Required peak height compared to baseline level measured just before the peak at the double correlator output. If the peak height is below the threshold, it will be ignored. This feature is disabled when CNPEAKMINTHR is set to 0x0000. */
#define RADIO_CN_PEAKMINTHR_Pos (0UL) /*!< Position of PEAKMINTHR field. */
#define RADIO_CN_PEAKMINTHR_Msk (0xFFFFUL << RADIO_CN_PEAKMINTHR_Pos) /*!< Bit mask of PEAKMINTHR field. */

/* Register: RADIO_PEAK */
/* Description: Peak detector configuration */

/* Bit 1 : Allow dual distance between peaks */
#define RADIO_PEAK_ENADUALDISTANCE_Pos (1UL) /*!< Position of ENADUALDISTANCE field. */
#define RADIO_PEAK_ENADUALDISTANCE_Msk (0x1UL << RADIO_PEAK_ENADUALDISTANCE_Pos) /*!< Bit mask of ENADUALDISTANCE field. */

/* Bit 0 : Ignore peaks from DBC which look like sidelobes */
#define RADIO_PEAK_ENMAYBESIDELOBE_Pos (0UL) /*!< Position of ENMAYBESIDELOBE field. */
#define RADIO_PEAK_ENMAYBESIDELOBE_Msk (0x1UL << RADIO_PEAK_ENMAYBESIDELOBE_Pos) /*!< Bit mask of ENMAYBESIDELOBE field. */

/* Register: RADIO_STTCNFG */
/* Description: Strobe time tracking Configuration (Symbol Timing) */

/* Bits 23..16 : Strobe time tracking: adjustment timeout (min distance in symbolperiods between strobe adjustments in same direction) */
#define RADIO_STTCNFG_STTTIMEOUT_Pos (16UL) /*!< Position of STTTIMEOUT field. */
#define RADIO_STTCNFG_STTTIMEOUT_Msk (0xFFUL << RADIO_STTCNFG_STTTIMEOUT_Pos) /*!< Bit mask of STTTIMEOUT field. */

/* Bits 15..8 : Strobe time tracking: strobe time error threshold */
#define RADIO_STTCNFG_STTERRORTH_Pos (8UL) /*!< Position of STTERRORTH field. */
#define RADIO_STTCNFG_STTERRORTH_Msk (0xFFUL << RADIO_STTCNFG_STTERRORTH_Pos) /*!< Bit mask of STTERRORTH field. */

/* Bits 7..0 : Strobe time tracking: IIR filter alpha */
#define RADIO_STTCNFG_STTALPHA_Pos (0UL) /*!< Position of STTALPHA field. */
#define RADIO_STTCNFG_STTALPHA_Msk (0xFFUL << RADIO_STTCNFG_STTALPHA_Pos) /*!< Bit mask of STTALPHA field. */

/* Register: RADIO_BBCKSEL */
/* Description: Clock rates */

/* Bits 14..12 : Hyper demod clock rate 2 */
#define RADIO_BBCKSEL_DIVND4_Pos (12UL) /*!< Position of DIVND4 field. */
#define RADIO_BBCKSEL_DIVND4_Msk (0x7UL << RADIO_BBCKSEL_DIVND4_Pos) /*!< Bit mask of DIVND4 field. */
#define RADIO_BBCKSEL_DIVND4_ClkSel_32M (0UL) /*!< CKSEL_32M */
#define RADIO_BBCKSEL_DIVND4_ClkSel_16M (1UL) /*!< CKSEL_16M */
#define RADIO_BBCKSEL_DIVND4_ClkSel_8M (2UL) /*!< CKSEL_8M */
#define RADIO_BBCKSEL_DIVND4_ClkSel_4M (3UL) /*!< CKSEL_4M */
#define RADIO_BBCKSEL_DIVND4_ClkSel_2M (4UL) /*!< CKSEL_2M */
#define RADIO_BBCKSEL_DIVND4_ClkSel_1M (5UL) /*!< CKSEL_1M */
#define RADIO_BBCKSEL_DIVND4_ClkSel_500K (6UL) /*!< CKSEL_500K */
#define RADIO_BBCKSEL_DIVND4_Disabled (7UL) /*!< CKSEL_OFF */

/* Bits 10..8 : Hyper demod clock rate 1 */
#define RADIO_BBCKSEL_DIVND3_Pos (8UL) /*!< Position of DIVND3 field. */
#define RADIO_BBCKSEL_DIVND3_Msk (0x7UL << RADIO_BBCKSEL_DIVND3_Pos) /*!< Bit mask of DIVND3 field. */
#define RADIO_BBCKSEL_DIVND3_ClkSel_32M (0UL) /*!< CKSEL_32M */
#define RADIO_BBCKSEL_DIVND3_ClkSel_16M (1UL) /*!< CKSEL_16M */
#define RADIO_BBCKSEL_DIVND3_ClkSel_8M (2UL) /*!< CKSEL_8M */
#define RADIO_BBCKSEL_DIVND3_ClkSel_4M (3UL) /*!< CKSEL_4M */
#define RADIO_BBCKSEL_DIVND3_ClkSel_2M (4UL) /*!< CKSEL_2M */
#define RADIO_BBCKSEL_DIVND3_ClkSel_1M (5UL) /*!< CKSEL_1M */
#define RADIO_BBCKSEL_DIVND3_ClkSel_500K (6UL) /*!< CKSEL_500K */
#define RADIO_BBCKSEL_DIVND3_Disabled (7UL) /*!< CKSEL_OFF */

/* Bits 6..4 : Standard demod clock rate 2 */
#define RADIO_BBCKSEL_DIVND2_Pos (4UL) /*!< Position of DIVND2 field. */
#define RADIO_BBCKSEL_DIVND2_Msk (0x7UL << RADIO_BBCKSEL_DIVND2_Pos) /*!< Bit mask of DIVND2 field. */
#define RADIO_BBCKSEL_DIVND2_ClkSel_32M (0UL) /*!< CKSEL_32M */
#define RADIO_BBCKSEL_DIVND2_ClkSel_16M (1UL) /*!< CKSEL_16M */
#define RADIO_BBCKSEL_DIVND2_ClkSel_8M (2UL) /*!< CKSEL_8M */
#define RADIO_BBCKSEL_DIVND2_ClkSel_4M (3UL) /*!< CKSEL_4M */
#define RADIO_BBCKSEL_DIVND2_ClkSel_2M (4UL) /*!< CKSEL_2M */
#define RADIO_BBCKSEL_DIVND2_ClkSel_1M (5UL) /*!< CKSEL_1M */
#define RADIO_BBCKSEL_DIVND2_ClkSel_500K (6UL) /*!< CKSEL_500K */
#define RADIO_BBCKSEL_DIVND2_Disabled (7UL) /*!< CKSEL_OFF */

/* Bits 2..0 : Standard demod clock rate 1 */
#define RADIO_BBCKSEL_DIVND1_Pos (0UL) /*!< Position of DIVND1 field. */
#define RADIO_BBCKSEL_DIVND1_Msk (0x7UL << RADIO_BBCKSEL_DIVND1_Pos) /*!< Bit mask of DIVND1 field. */
#define RADIO_BBCKSEL_DIVND1_ClkSel_32M (0UL) /*!< CKSEL_32M */
#define RADIO_BBCKSEL_DIVND1_ClkSel_16M (1UL) /*!< CKSEL_16M */
#define RADIO_BBCKSEL_DIVND1_ClkSel_8M (2UL) /*!< CKSEL_8M */
#define RADIO_BBCKSEL_DIVND1_ClkSel_4M (3UL) /*!< CKSEL_4M */
#define RADIO_BBCKSEL_DIVND1_ClkSel_2M (4UL) /*!< CKSEL_2M */
#define RADIO_BBCKSEL_DIVND1_ClkSel_1M (5UL) /*!< CKSEL_1M */
#define RADIO_BBCKSEL_DIVND1_ClkSel_500K (6UL) /*!< CKSEL_500K */
#define RADIO_BBCKSEL_DIVND1_ClkSel_Disabled (7UL) /*!< CKSEL_OFF */

/* Register: RADIO_DFESTATUS */
/* Description: DFE status information */

/* Bit 4 : Internal state of sampling state machine */
#define RADIO_DFESTATUS_SAMPLINGSTATE_Pos (4UL) /*!< Position of SAMPLINGSTATE field. */
#define RADIO_DFESTATUS_SAMPLINGSTATE_Msk (0x1UL << RADIO_DFESTATUS_SAMPLINGSTATE_Pos) /*!< Bit mask of SAMPLINGSTATE field. */
#define RADIO_DFESTATUS_SAMPLINGSTATE_Idle (0UL) /*!< Sampling state Idle */
#define RADIO_DFESTATUS_SAMPLINGSTATE_Sampling (1UL) /*!< Sampling state Sampling */

/* Bits 2..0 : Internal state of switching state machine */
#define RADIO_DFESTATUS_SWITCHINGSTATE_Pos (0UL) /*!< Position of SWITCHINGSTATE field. */
#define RADIO_DFESTATUS_SWITCHINGSTATE_Msk (0x7UL << RADIO_DFESTATUS_SWITCHINGSTATE_Pos) /*!< Bit mask of SWITCHINGSTATE field. */
#define RADIO_DFESTATUS_SWITCHINGSTATE_Idle (0UL) /*!< Switching state Idle */
#define RADIO_DFESTATUS_SWITCHINGSTATE_Offset (1UL) /*!< Switching state Offset */
#define RADIO_DFESTATUS_SWITCHINGSTATE_Guard (2UL) /*!< Switching state Guard */
#define RADIO_DFESTATUS_SWITCHINGSTATE_Ref (3UL) /*!< Switching state Ref */
#define RADIO_DFESTATUS_SWITCHINGSTATE_Switching (4UL) /*!< Switching state Switching */
#define RADIO_DFESTATUS_SWITCHINGSTATE_Ending (5UL) /*!< Switching state Ending */

/* Register: RADIO_DFEMODE */
/* Description: Whether to use Angle-of-Arrival (AOA) or Angle-of-Departure (AOD) */

/* Bits 1..0 : Direction finding operation mode */
#define RADIO_DFEMODE_DFEOPMODE_Pos (0UL) /*!< Position of DFEOPMODE field. */
#define RADIO_DFEMODE_DFEOPMODE_Msk (0x3UL << RADIO_DFEMODE_DFEOPMODE_Pos) /*!< Bit mask of DFEOPMODE field. */
#define RADIO_DFEMODE_DFEOPMODE_Disabled (0UL) /*!< Direction finding mode disabled */
#define RADIO_DFEMODE_DFEOPMODE_AoD (2UL) /*!< Direction finding mode set to AoD */
#define RADIO_DFEMODE_DFEOPMODE_AoA (3UL) /*!< Direction finding mode set to AoA */

/* Register: RADIO_DFECTRL1 */
/* Description: Various configuration for Direction finding */

/* Bits 27..24 : Gain will be lowered by the specified number of gain steps at the start of CTE */
#define RADIO_DFECTRL1_AGCBACKOFFGAIN_Pos (24UL) /*!< Position of AGCBACKOFFGAIN field. */
#define RADIO_DFECTRL1_AGCBACKOFFGAIN_Msk (0xFUL << RADIO_DFECTRL1_AGCBACKOFFGAIN_Pos) /*!< Bit mask of AGCBACKOFFGAIN field. */

/* Bits 23..20 : Repeat every antenna pattern N times. */
#define RADIO_DFECTRL1_REPEATPATTERN_Pos (20UL) /*!< Position of REPEATPATTERN field. */
#define RADIO_DFECTRL1_REPEATPATTERN_Msk (0xFUL << RADIO_DFECTRL1_REPEATPATTERN_Pos) /*!< Bit mask of REPEATPATTERN field. */
#define RADIO_DFECTRL1_REPEATPATTERN_NO_REPEAT (0UL) /*!< Do not repeat (1 time in total) */

/* Bits 18..16 : Interval between samples in the SWITCHING period when CTEINLINECTRLEN is 0 */
#define RADIO_DFECTRL1_TSAMPLESPACING_Pos (16UL) /*!< Position of TSAMPLESPACING field. */
#define RADIO_DFECTRL1_TSAMPLESPACING_Msk (0x7UL << RADIO_DFECTRL1_TSAMPLESPACING_Pos) /*!< Bit mask of TSAMPLESPACING field. */
#define RADIO_DFECTRL1_TSAMPLESPACING_4us (1UL) /*!< 4us */
#define RADIO_DFECTRL1_TSAMPLESPACING_2us (2UL) /*!< 2us */
#define RADIO_DFECTRL1_TSAMPLESPACING_1us (3UL) /*!< 1us */
#define RADIO_DFECTRL1_TSAMPLESPACING_500ns (4UL) /*!< 0.5us */
#define RADIO_DFECTRL1_TSAMPLESPACING_250ns (5UL) /*!< 0.25us */
#define RADIO_DFECTRL1_TSAMPLESPACING_125ns (6UL) /*!< 0.125us */

/* Bit 15 : Whether to sample I/Q or magnitude/phase */
#define RADIO_DFECTRL1_SAMPLETYPE_Pos (15UL) /*!< Position of SAMPLETYPE field. */
#define RADIO_DFECTRL1_SAMPLETYPE_Msk (0x1UL << RADIO_DFECTRL1_SAMPLETYPE_Pos) /*!< Bit mask of SAMPLETYPE field. */
#define RADIO_DFECTRL1_SAMPLETYPE_IQ (0UL) /*!< Complex samples in I and Q */
#define RADIO_DFECTRL1_SAMPLETYPE_MagPhase (1UL) /*!< Complex samples as magnitude and phase */

