adamkondraciuk/nrfx/mdk/nrf54lilium_network_bitfields.h
/* Bit 0 :   */
#define RADIO_TASK_TRIG_START_DFE_TASK_TRIG_START_DFE_Pos (0UL) /*!< Position of TASK_TRIG_START_DFE field. */
#define RADIO_TASK_TRIG_START_DFE_TASK_TRIG_START_DFE_Msk (0x1UL << RADIO_TASK_TRIG_START_DFE_TASK_TRIG_START_DFE_Pos) /*!< Bit mask of TASK_TRIG_START_DFE field. */

/* Register: RADIO_TASK_TRIG_STOP_DFE */
/* Description: Unspecified */

/* Bit 0 :   */
#define RADIO_TASK_TRIG_STOP_DFE_TASK_TRIG_STOP_DFE_Pos (0UL) /*!< Position of TASK_TRIG_STOP_DFE field. */
#define RADIO_TASK_TRIG_STOP_DFE_TASK_TRIG_STOP_DFE_Msk (0x1UL << RADIO_TASK_TRIG_STOP_DFE_TASK_TRIG_STOP_DFE_Pos) /*!< Bit mask of TASK_TRIG_STOP_DFE field. */

/* Register: RADIO_ENABLE_DFE */
/* Description: Unspecified */

/* Bit 0 :   */
#define RADIO_ENABLE_DFE_ENABLE_DFE_Pos (0UL) /*!< Position of ENABLE_DFE field. */
#define RADIO_ENABLE_DFE_ENABLE_DFE_Msk (0x1UL << RADIO_ENABLE_DFE_ENABLE_DFE_Pos) /*!< Bit mask of ENABLE_DFE field. */

/* Register: RADIO_PTRDFE */
/* Description: Data pointer */

/* Bit 29 :   */
#define RADIO_PTRDFE_BASE_Pos (29UL) /*!< Position of BASE field. */
#define RADIO_PTRDFE_BASE_Msk (0x1UL << RADIO_PTRDFE_BASE_Pos) /*!< Bit mask of BASE field. */

/* Bits 15..0 :   */
#define RADIO_PTRDFE_OFFSET_Pos (0UL) /*!< Position of OFFSET field. */
#define RADIO_PTRDFE_OFFSET_Msk (0xFFFFUL << RADIO_PTRDFE_OFFSET_Pos) /*!< Bit mask of OFFSET field. */

/* Register: RADIO_AMOUNTDFE */
/* Description: Number of samples transferred in the last transaction */

/* Bits 15..0 : Number of samples transferred in the last transaction */
#define RADIO_AMOUNTDFE_AMOUNTDFE_Pos (0UL) /*!< Position of AMOUNTDFE field. */
#define RADIO_AMOUNTDFE_AMOUNTDFE_Msk (0xFFFFUL << RADIO_AMOUNTDFE_AMOUNTDFE_Pos) /*!< Bit mask of AMOUNTDFE field. */

/* Register: RADIO_MAXCNTDFE */
/* Description: Maximum number of buffer words to transfer */

/* Bits 15..0 : Maximum number of buffer words to transfer */
#define RADIO_MAXCNTDFE_MAXCNTDFE_Pos (0UL) /*!< Position of MAXCNTDFE field. */
#define RADIO_MAXCNTDFE_MAXCNTDFE_Msk (0xFFFFUL << RADIO_MAXCNTDFE_MAXCNTDFE_Pos) /*!< Bit mask of MAXCNTDFE field. */

/* Register: RADIO_TASK_CNTSTART */
/* Description: Unspecified */

/* Bit 0 :   */
#define RADIO_TASK_CNTSTART_TASK_CNTSTART_Pos (0UL) /*!< Position of TASK_CNTSTART field. */
#define RADIO_TASK_CNTSTART_TASK_CNTSTART_Msk (0x1UL << RADIO_TASK_CNTSTART_TASK_CNTSTART_Pos) /*!< Bit mask of TASK_CNTSTART field. */

/* Register: RADIO_TASK_CNTSTOP */
/* Description: Unspecified */

/* Bit 0 :   */
#define RADIO_TASK_CNTSTOP_TASK_CNTSTOP_Pos (0UL) /*!< Position of TASK_CNTSTOP field. */
#define RADIO_TASK_CNTSTOP_TASK_CNTSTOP_Msk (0x1UL << RADIO_TASK_CNTSTOP_TASK_CNTSTOP_Pos) /*!< Bit mask of TASK_CNTSTOP field. */

/* Register: RADIO_TASK_CNTCLEAR */
/* Description: Unspecified */

/* Bit 0 :   */
#define RADIO_TASK_CNTCLEAR_TASK_CNTCLEAR_Pos (0UL) /*!< Position of TASK_CNTCLEAR field. */
#define RADIO_TASK_CNTCLEAR_TASK_CNTCLEAR_Msk (0x1UL << RADIO_TASK_CNTCLEAR_TASK_CNTCLEAR_Pos) /*!< Bit mask of TASK_CNTCLEAR field. */

/* Register: RADIO_CRCSTATUS */
/* Description: CRC status */

/* Bit 0 : CRC status of packet received */
#define RADIO_CRCSTATUS_CRCSTATUS_Pos (0UL) /*!< Position of CRCSTATUS field. */
#define RADIO_CRCSTATUS_CRCSTATUS_Msk (0x1UL << RADIO_CRCSTATUS_CRCSTATUS_Pos) /*!< Bit mask of CRCSTATUS field. */
#define RADIO_CRCSTATUS_CRCSTATUS_CRCError (0UL) /*!< Packet received with CRC error */
#define RADIO_CRCSTATUS_CRCSTATUS_CRCOk (1UL) /*!< Packet received with CRC ok */

/* Register: RADIO_RXMATCH */
/* Description: Received address */

/* Bits 2..0 : Received address */
#define RADIO_RXMATCH_RXMATCH_Pos (0UL) /*!< Position of RXMATCH field. */
#define RADIO_RXMATCH_RXMATCH_Msk (0x7UL << RADIO_RXMATCH_RXMATCH_Pos) /*!< Bit mask of RXMATCH field. */

/* Register: RADIO_RXCRC */
/* Description: CRC field of previously received packet */

/* Bits 23..0 : CRC field of previously received packet */
#define RADIO_RXCRC_RXCRC_Pos (0UL) /*!< Position of RXCRC field. */
#define RADIO_RXCRC_RXCRC_Msk (0xFFFFFFUL << RADIO_RXCRC_RXCRC_Pos) /*!< Bit mask of RXCRC field. */

/* Register: RADIO_DAI */
/* Description: Device address match index */

/* Bits 2..0 : Device address match index */
#define RADIO_DAI_DAI_Pos (0UL) /*!< Position of DAI field. */
#define RADIO_DAI_DAI_Msk (0x7UL << RADIO_DAI_DAI_Pos) /*!< Bit mask of DAI field. */

/* Register: RADIO_PDUSTAT */
/* Description: Payload status */

/* Bits 2..1 : Status on what rate packet is received with in Long Range */
#define RADIO_PDUSTAT_CISTAT_Pos (1UL) /*!< Position of CISTAT field. */
#define RADIO_PDUSTAT_CISTAT_Msk (0x3UL << RADIO_PDUSTAT_CISTAT_Pos) /*!< Bit mask of CISTAT field. */
#define RADIO_PDUSTAT_CISTAT_LR125kbit (0UL) /*!< Frame is received at 125 kbps */
#define RADIO_PDUSTAT_CISTAT_LR500kbit (1UL) /*!< Frame is received at 500 kbps */

/* Bit 0 : Status on payload length vs. PCNF1.MAXLEN */
#define RADIO_PDUSTAT_PDUSTAT_Pos (0UL) /*!< Position of PDUSTAT field. */
#define RADIO_PDUSTAT_PDUSTAT_Msk (0x1UL << RADIO_PDUSTAT_PDUSTAT_Pos) /*!< Bit mask of PDUSTAT field. */
#define RADIO_PDUSTAT_PDUSTAT_LessThan (0UL) /*!< Payload less than PCNF1.MAXLEN */
#define RADIO_PDUSTAT_PDUSTAT_GreaterThan (1UL) /*!< Payload greater than PCNF1.MAXLEN */

/* Register: RADIO_PCNF0 */
/* Description: Packet configuration register 0 */

/* Bits 30..29 : Length of TERM field in Long Range operation */
#define RADIO_PCNF0_TERMLEN_Pos (29UL) /*!< Position of TERMLEN field. */
#define RADIO_PCNF0_TERMLEN_Msk (0x3UL << RADIO_PCNF0_TERMLEN_Pos) /*!< Bit mask of TERMLEN field. */

/* Bit 28 : Preamble pattern */
#define RADIO_PCNF0_PREAMPTRN_Pos (28UL) /*!< Position of PREAMPTRN field. */
#define RADIO_PCNF0_PREAMPTRN_Msk (0x1UL << RADIO_PCNF0_PREAMPTRN_Pos) /*!< Bit mask of PREAMPTRN field. */

/* Bit 26 : Indicates if LENGTH field contains CRC or not */
#define RADIO_PCNF0_CRCINC_Pos (26UL) /*!< Position of CRCINC field. */
#define RADIO_PCNF0_CRCINC_Msk (0x1UL << RADIO_PCNF0_CRCINC_Pos) /*!< Bit mask of CRCINC field. */
#define RADIO_PCNF0_CRCINC_Exclude (0UL) /*!< LENGTH does not contain CRC */
#define RADIO_PCNF0_CRCINC_Include (1UL) /*!< LENGTH includes CRC */

