adamkondraciuk/nrfx/mdk/nrf54lilium_network_bitfields.h
/* Bits 25..24 : Length of preamble on air. Decision point: TASKS_START task */
#define RADIO_PCNF0_PLEN_Pos (24UL) /*!< Position of PLEN field. */
#define RADIO_PCNF0_PLEN_Msk (0x3UL << RADIO_PCNF0_PLEN_Pos) /*!< Bit mask of PLEN field. */
#define RADIO_PCNF0_PLEN_8bit (0UL) /*!< 8-bit preamble */
#define RADIO_PCNF0_PLEN_16bit (1UL) /*!< 16-bit preamble */
#define RADIO_PCNF0_PLEN_32bitZero (2UL) /*!< 32-bit zero preamble - used for IEEE 802.15.4 */
#define RADIO_PCNF0_PLEN_LongRange (3UL) /*!< Preamble - used for BLE long range */

/* Bits 23..22 : Length of code indicator - long range */
#define RADIO_PCNF0_CILEN_Pos (22UL) /*!< Position of CILEN field. */
#define RADIO_PCNF0_CILEN_Msk (0x3UL << RADIO_PCNF0_CILEN_Pos) /*!< Bit mask of CILEN field. */

/* Bit 20 : Include or exclude S1 field in RAM */
#define RADIO_PCNF0_S1INCL_Pos (20UL) /*!< Position of S1INCL field. */
#define RADIO_PCNF0_S1INCL_Msk (0x1UL << RADIO_PCNF0_S1INCL_Pos) /*!< Bit mask of S1INCL field. */
#define RADIO_PCNF0_S1INCL_Automatic (0UL) /*!< Include S1 field in RAM only if S1LEN &gt; 0 */
#define RADIO_PCNF0_S1INCL_Include (1UL) /*!< Always include S1 field in RAM independent of S1LEN */

/* Bits 19..16 : Length on air of S1 field in number of bits. */
#define RADIO_PCNF0_S1LEN_Pos (16UL) /*!< Position of S1LEN field. */
#define RADIO_PCNF0_S1LEN_Msk (0xFUL << RADIO_PCNF0_S1LEN_Pos) /*!< Bit mask of S1LEN field. */

/* Bit 12 : Include or exclude S0 field in RAM */
#define RADIO_PCNF0_S0INCL_Pos (12UL) /*!< Position of S0INCL field. */
#define RADIO_PCNF0_S0INCL_Msk (0x1UL << RADIO_PCNF0_S0INCL_Pos) /*!< Bit mask of S0INCL field. */
#define RADIO_PCNF0_S0INCL_Automatic (0UL) /*!< Include S0 field only if S0LEN &gt; 0 */

/* Bit 8 : Length on air of S0 field in number of bytes. */
#define RADIO_PCNF0_S0LEN_Pos (8UL) /*!< Position of S0LEN field. */
#define RADIO_PCNF0_S0LEN_Msk (0x1UL << RADIO_PCNF0_S0LEN_Pos) /*!< Bit mask of S0LEN field. */

/* Bit 4 : Include or exclude LENGTH field in RAM */
#define RADIO_PCNF0_LENGTHINCL_Pos (4UL) /*!< Position of LENGTHINCL field. */
#define RADIO_PCNF0_LENGTHINCL_Msk (0x1UL << RADIO_PCNF0_LENGTHINCL_Pos) /*!< Bit mask of LENGTHINCL field. */
#define RADIO_PCNF0_LENGTHINCL_Automatic (0UL) /*!< Include LENGTH field in RAM only if LFLEN &gt; 0 */

/* Bits 3..0 : Length on air of LENGTH field in number of bits. */
#define RADIO_PCNF0_LFLEN_Pos (0UL) /*!< Position of LFLEN field. */
#define RADIO_PCNF0_LFLEN_Msk (0xFUL << RADIO_PCNF0_LFLEN_Pos) /*!< Bit mask of LFLEN field. */

/* Register: RADIO_PCNF0SEC */
/* Description: Unspecified */

/* Bits 30..29 :   */
#define RADIO_PCNF0SEC_FIELD8_Pos (29UL) /*!< Position of FIELD8 field. */
#define RADIO_PCNF0SEC_FIELD8_Msk (0x3UL << RADIO_PCNF0SEC_FIELD8_Pos) /*!< Bit mask of FIELD8 field. */

/* Bit 28 :   */
#define RADIO_PCNF0SEC_FIELD7_Pos (28UL) /*!< Position of FIELD7 field. */
#define RADIO_PCNF0SEC_FIELD7_Msk (0x1UL << RADIO_PCNF0SEC_FIELD7_Pos) /*!< Bit mask of FIELD7 field. */

/* Bit 26 :   */
#define RADIO_PCNF0SEC_FIELD6_Pos (26UL) /*!< Position of FIELD6 field. */
#define RADIO_PCNF0SEC_FIELD6_Msk (0x1UL << RADIO_PCNF0SEC_FIELD6_Pos) /*!< Bit mask of FIELD6 field. */

/* Bits 25..24 :   */
#define RADIO_PCNF0SEC_FIELD5_Pos (24UL) /*!< Position of FIELD5 field. */
#define RADIO_PCNF0SEC_FIELD5_Msk (0x3UL << RADIO_PCNF0SEC_FIELD5_Pos) /*!< Bit mask of FIELD5 field. */

/* Bits 23..22 :   */
#define RADIO_PCNF0SEC_FIELD4_Pos (22UL) /*!< Position of FIELD4 field. */
#define RADIO_PCNF0SEC_FIELD4_Msk (0x3UL << RADIO_PCNF0SEC_FIELD4_Pos) /*!< Bit mask of FIELD4 field. */

/* Bits 21..20 :   */
#define RADIO_PCNF0SEC_FIELD3_Pos (20UL) /*!< Position of FIELD3 field. */
#define RADIO_PCNF0SEC_FIELD3_Msk (0x3UL << RADIO_PCNF0SEC_FIELD3_Pos) /*!< Bit mask of FIELD3 field. */

/* Bits 19..16 :   */
#define RADIO_PCNF0SEC_FIELD2_Pos (16UL) /*!< Position of FIELD2 field. */
#define RADIO_PCNF0SEC_FIELD2_Msk (0xFUL << RADIO_PCNF0SEC_FIELD2_Pos) /*!< Bit mask of FIELD2 field. */

/* Bit 8 :   */
#define RADIO_PCNF0SEC_FIELD1_Pos (8UL) /*!< Position of FIELD1 field. */
#define RADIO_PCNF0SEC_FIELD1_Msk (0x1UL << RADIO_PCNF0SEC_FIELD1_Pos) /*!< Bit mask of FIELD1 field. */

/* Bits 3..0 :   */
#define RADIO_PCNF0SEC_FIELD0_Pos (0UL) /*!< Position of FIELD0 field. */
#define RADIO_PCNF0SEC_FIELD0_Msk (0xFUL << RADIO_PCNF0SEC_FIELD0_Pos) /*!< Bit mask of FIELD0 field. */

/* Register: RADIO_PCNF1 */
/* Description: Packet configuration register 1 */

/* Bit 31 : Used to bypass PREAMBLE, ADDRESS, S0, LENGTH, S1 field and go straight to PAYLOAD state */
#define RADIO_PCNF1_TXFROMRAM_Pos (31UL) /*!< Position of TXFROMRAM field. */
#define RADIO_PCNF1_TXFROMRAM_Msk (0x1UL << RADIO_PCNF1_TXFROMRAM_Pos) /*!< Bit mask of TXFROMRAM field. */
#define RADIO_PCNF1_TXFROMRAM_Disabled (0UL) /*!< Disable */
#define RADIO_PCNF1_TXFROMRAM_Bypass (1UL) /*!< Bypass */

/* Bit 25 : Enable or disable packet whitening */
#define RADIO_PCNF1_WHITEEN_Pos (25UL) /*!< Position of WHITEEN field. */
#define RADIO_PCNF1_WHITEEN_Msk (0x1UL << RADIO_PCNF1_WHITEEN_Pos) /*!< Bit mask of WHITEEN field. */
#define RADIO_PCNF1_WHITEEN_Disabled (0UL) /*!< Disable */
#define RADIO_PCNF1_WHITEEN_Enabled (1UL) /*!< Enable */

/* Bit 24 : On-air endianness of packet, this applies to the S0, LENGTH, S1, and the PAYLOAD fields. */
#define RADIO_PCNF1_ENDIAN_Pos (24UL) /*!< Position of ENDIAN field. */
#define RADIO_PCNF1_ENDIAN_Msk (0x1UL << RADIO_PCNF1_ENDIAN_Pos) /*!< Bit mask of ENDIAN field. */
#define RADIO_PCNF1_ENDIAN_Little (0UL) /*!< Least significant bit on air first */
#define RADIO_PCNF1_ENDIAN_Big (1UL) /*!< Most significant bit on air first */

/* Bits 18..16 : Base address length in number of bytes */
#define RADIO_PCNF1_BALEN_Pos (16UL) /*!< Position of BALEN field. */
#define RADIO_PCNF1_BALEN_Msk (0x7UL << RADIO_PCNF1_BALEN_Pos) /*!< Bit mask of BALEN field. */

/* Bits 15..8 : Static length in number of bytes */
#define RADIO_PCNF1_STATLEN_Pos (8UL) /*!< Position of STATLEN field. */
#define RADIO_PCNF1_STATLEN_Msk (0xFFUL << RADIO_PCNF1_STATLEN_Pos) /*!< Bit mask of STATLEN field. */

