adamkondraciuk/nrfx/mdk/nrf54lilium_network_bitfields.h
/* Bit 1 : Enable or disable device address matching using device address 1 */
#define RADIO_DACNF_ENA1_Pos (1UL) /*!< Position of ENA1 field. */
#define RADIO_DACNF_ENA1_Msk (0x1UL << RADIO_DACNF_ENA1_Pos) /*!< Bit mask of ENA1 field. */
#define RADIO_DACNF_ENA1_Disabled (0UL) /*!< Disabled */
#define RADIO_DACNF_ENA1_Enabled (1UL) /*!< Enabled */

/* Bit 0 : Enable or disable device address matching using device address 0 */
#define RADIO_DACNF_ENA0_Pos (0UL) /*!< Position of ENA0 field. */
#define RADIO_DACNF_ENA0_Msk (0x1UL << RADIO_DACNF_ENA0_Pos) /*!< Bit mask of ENA0 field. */
#define RADIO_DACNF_ENA0_Disabled (0UL) /*!< Disabled */
#define RADIO_DACNF_ENA0_Enabled (1UL) /*!< Enabled */

/* Register: RADIO_BCC */
/* Description: Bit counter compare */

/* Bits 31..0 : Bit counter compare */
#define RADIO_BCC_BCC_Pos (0UL) /*!< Position of BCC field. */
#define RADIO_BCC_BCC_Msk (0xFFFFFFFFUL << RADIO_BCC_BCC_Pos) /*!< Bit mask of BCC field. */

/* Register: RADIO_AACHKOVERRIDE_TODO_FIX_NAMING */
/* Description: Unspecified */

/* Bits 29..28 :   */
#define RADIO_AACHKOVERRIDE_TODO_FIX_NAMING_FIELD8_Pos (28UL) /*!< Position of FIELD8 field. */
#define RADIO_AACHKOVERRIDE_TODO_FIX_NAMING_FIELD8_Msk (0x3UL << RADIO_AACHKOVERRIDE_TODO_FIX_NAMING_FIELD8_Pos) /*!< Bit mask of FIELD8 field. */

/* Bits 26..24 :   */
#define RADIO_AACHKOVERRIDE_TODO_FIX_NAMING_FIELD7_Pos (24UL) /*!< Position of FIELD7 field. */
#define RADIO_AACHKOVERRIDE_TODO_FIX_NAMING_FIELD7_Msk (0x7UL << RADIO_AACHKOVERRIDE_TODO_FIX_NAMING_FIELD7_Pos) /*!< Bit mask of FIELD7 field. */

/* Bit 22 :   */
#define RADIO_AACHKOVERRIDE_TODO_FIX_NAMING_FIELD6_Pos (22UL) /*!< Position of FIELD6 field. */
#define RADIO_AACHKOVERRIDE_TODO_FIX_NAMING_FIELD6_Msk (0x1UL << RADIO_AACHKOVERRIDE_TODO_FIX_NAMING_FIELD6_Pos) /*!< Bit mask of FIELD6 field. */

/* Bit 21 :   */
#define RADIO_AACHKOVERRIDE_TODO_FIX_NAMING_FIELD5_Pos (21UL) /*!< Position of FIELD5 field. */
#define RADIO_AACHKOVERRIDE_TODO_FIX_NAMING_FIELD5_Msk (0x1UL << RADIO_AACHKOVERRIDE_TODO_FIX_NAMING_FIELD5_Pos) /*!< Bit mask of FIELD5 field. */

/* Bit 20 :   */
#define RADIO_AACHKOVERRIDE_TODO_FIX_NAMING_FIELD4_Pos (20UL) /*!< Position of FIELD4 field. */
#define RADIO_AACHKOVERRIDE_TODO_FIX_NAMING_FIELD4_Msk (0x1UL << RADIO_AACHKOVERRIDE_TODO_FIX_NAMING_FIELD4_Pos) /*!< Bit mask of FIELD4 field. */

/* Bit 19 :   */
#define RADIO_AACHKOVERRIDE_TODO_FIX_NAMING_FIELD3_Pos (19UL) /*!< Position of FIELD3 field. */
#define RADIO_AACHKOVERRIDE_TODO_FIX_NAMING_FIELD3_Msk (0x1UL << RADIO_AACHKOVERRIDE_TODO_FIX_NAMING_FIELD3_Pos) /*!< Bit mask of FIELD3 field. */

/* Bit 18 :   */
#define RADIO_AACHKOVERRIDE_TODO_FIX_NAMING_FIELD2_Pos (18UL) /*!< Position of FIELD2 field. */
#define RADIO_AACHKOVERRIDE_TODO_FIX_NAMING_FIELD2_Msk (0x1UL << RADIO_AACHKOVERRIDE_TODO_FIX_NAMING_FIELD2_Pos) /*!< Bit mask of FIELD2 field. */

/* Bit 17 :   */
#define RADIO_AACHKOVERRIDE_TODO_FIX_NAMING_FIELD1_Pos (17UL) /*!< Position of FIELD1 field. */
#define RADIO_AACHKOVERRIDE_TODO_FIX_NAMING_FIELD1_Msk (0x1UL << RADIO_AACHKOVERRIDE_TODO_FIX_NAMING_FIELD1_Pos) /*!< Bit mask of FIELD1 field. */

/* Bits 9..0 :   */
#define RADIO_AACHKOVERRIDE_TODO_FIX_NAMING_FIELD0_Pos (0UL) /*!< Position of FIELD0 field. */
#define RADIO_AACHKOVERRIDE_TODO_FIX_NAMING_FIELD0_Msk (0x3FFUL << RADIO_AACHKOVERRIDE_TODO_FIX_NAMING_FIELD0_Pos) /*!< Bit mask of FIELD0 field. */

/* Register: RADIO_PACKETCNTR1 */
/* Description: Unspecified */

/* Bits 15..0 :   */
#define RADIO_PACKETCNTR1_FIELD0_Pos (0UL) /*!< Position of FIELD0 field. */
#define RADIO_PACKETCNTR1_FIELD0_Msk (0xFFFFUL << RADIO_PACKETCNTR1_FIELD0_Pos) /*!< Bit mask of FIELD0 field. */

/* Register: RADIO_PACKETCNTR2 */
/* Description: Unspecified */

/* Bits 31..16 :   */
#define RADIO_PACKETCNTR2_FIELD1_Pos (16UL) /*!< Position of FIELD1 field. */
#define RADIO_PACKETCNTR2_FIELD1_Msk (0xFFFFUL << RADIO_PACKETCNTR2_FIELD1_Pos) /*!< Bit mask of FIELD1 field. */

/* Bits 15..0 :   */
#define RADIO_PACKETCNTR2_FIELD0_Pos (0UL) /*!< Position of FIELD0 field. */
#define RADIO_PACKETCNTR2_FIELD0_Msk (0xFFFFUL << RADIO_PACKETCNTR2_FIELD0_Pos) /*!< Bit mask of FIELD0 field. */

/* Register: RADIO_CTESTATUS */
/* Description: CTEInfo parsed from received packet */

/* Bits 7..6 : CTEType parsed from packet */
#define RADIO_CTESTATUS_CTETYPE_Pos (6UL) /*!< Position of CTETYPE field. */
#define RADIO_CTESTATUS_CTETYPE_Msk (0x3UL << RADIO_CTESTATUS_CTETYPE_Pos) /*!< Bit mask of CTETYPE field. */

/* Bit 5 : RFU parsed from packet */
#define RADIO_CTESTATUS_RFU_Pos (5UL) /*!< Position of RFU field. */
#define RADIO_CTESTATUS_RFU_Msk (0x1UL << RADIO_CTESTATUS_RFU_Pos) /*!< Bit mask of RFU field. */

/* Bits 4..0 : CTETime parsed from packet */
#define RADIO_CTESTATUS_CTETIME_Pos (0UL) /*!< Position of CTETIME field. */
#define RADIO_CTESTATUS_CTETIME_Msk (0x1FUL << RADIO_CTESTATUS_CTETIME_Pos) /*!< Bit mask of CTETIME field. */

/* Register: RADIO_HYPSTDCHECKSTAT_TODO_FIX_NAMING */
/* Description: Unspecified */

/* Bits 24..16 :   */
#define RADIO_HYPSTDCHECKSTAT_TODO_FIX_NAMING_FIELD3_Pos (16UL) /*!< Position of FIELD3 field. */
#define RADIO_HYPSTDCHECKSTAT_TODO_FIX_NAMING_FIELD3_Msk (0x1FFUL << RADIO_HYPSTDCHECKSTAT_TODO_FIX_NAMING_FIELD3_Pos) /*!< Bit mask of FIELD3 field. */

/* Bits 11..8 :   */
#define RADIO_HYPSTDCHECKSTAT_TODO_FIX_NAMING_FIELD2_Pos (8UL) /*!< Position of FIELD2 field. */
#define RADIO_HYPSTDCHECKSTAT_TODO_FIX_NAMING_FIELD2_Msk (0xFUL << RADIO_HYPSTDCHECKSTAT_TODO_FIX_NAMING_FIELD2_Pos) /*!< Bit mask of FIELD2 field. */

/* Bits 7..4 :   */
#define RADIO_HYPSTDCHECKSTAT_TODO_FIX_NAMING_FIELD1_Pos (4UL) /*!< Position of FIELD1 field. */
#define RADIO_HYPSTDCHECKSTAT_TODO_FIX_NAMING_FIELD1_Msk (0xFUL << RADIO_HYPSTDCHECKSTAT_TODO_FIX_NAMING_FIELD1_Pos) /*!< Bit mask of FIELD1 field. */

/* Bits 3..0 :   */
#define RADIO_HYPSTDCHECKSTAT_TODO_FIX_NAMING_FIELD0_Pos (0UL) /*!< Position of FIELD0 field. */
#define RADIO_HYPSTDCHECKSTAT_TODO_FIX_NAMING_FIELD0_Msk (0xFUL << RADIO_HYPSTDCHECKSTAT_TODO_FIX_NAMING_FIELD0_Pos) /*!< Bit mask of FIELD0 field. */

/* Register: RADIO_HYPSTDAADIFFVEC_TODO_FIX_NAMING */
/* Description: Unspecified */

/* Bits 15..0 :   */
#define RADIO_HYPSTDAADIFFVEC_TODO_FIX_NAMING_FIELD0_Pos (0UL) /*!< Position of FIELD0 field. */
#define RADIO_HYPSTDAADIFFVEC_TODO_FIX_NAMING_FIELD0_Msk (0xFFFFUL << RADIO_HYPSTDAADIFFVEC_TODO_FIX_NAMING_FIELD0_Pos) /*!< Bit mask of FIELD0 field. */

/* Register: RADIO_ADDRSAFECONF */
/* Description: Unspecified */

