adamkondraciuk/nrfx/mdk/nrf54lilium_network_bitfields.h
/* Bit 3 : CTEInfo is S1 byte or not */
#define RADIO_CTEINLINECONF_CTEINFOINS1_Pos (3UL) /*!< Position of CTEINFOINS1 field. */
#define RADIO_CTEINLINECONF_CTEINFOINS1_Msk (0x1UL << RADIO_CTEINLINECONF_CTEINFOINS1_Pos) /*!< Bit mask of CTEINFOINS1 field. */
#define RADIO_CTEINLINECONF_CTEINFOINS1_NotInS1 (0UL) /*!< CTEInfo is NOT in S1 byte (advertising PDU) */
#define RADIO_CTEINLINECONF_CTEINFOINS1_InS1 (1UL) /*!< CTEInfo is in S1 byte (data PDU) */

/* Bit 0 : Enable parsing of CTEInfo from received packet in BLE modes */
#define RADIO_CTEINLINECONF_CTEINLINECTRLEN_Pos (0UL) /*!< Position of CTEINLINECTRLEN field. */
#define RADIO_CTEINLINECONF_CTEINLINECTRLEN_Msk (0x1UL << RADIO_CTEINLINECONF_CTEINLINECTRLEN_Pos) /*!< Bit mask of CTEINLINECTRLEN field. */
#define RADIO_CTEINLINECONF_CTEINLINECTRLEN_Disabled (0UL) /*!< Parsing of CTEInfo is disabled */
#define RADIO_CTEINLINECONF_CTEINLINECTRLEN_Enabled (1UL) /*!< Parsing of CTEInfo is enabled */

/* Register: RADIO_TASK_TRIG_START_CHAIN */
/* Description: Unspecified */

/* Bit 0 :   */
#define RADIO_TASK_TRIG_START_CHAIN_TASK_TRIG_START_CHAIN_Pos (0UL) /*!< Position of TASK_TRIG_START_CHAIN field. */
#define RADIO_TASK_TRIG_START_CHAIN_TASK_TRIG_START_CHAIN_Msk (0x1UL << RADIO_TASK_TRIG_START_CHAIN_TASK_TRIG_START_CHAIN_Pos) /*!< Bit mask of TASK_TRIG_START_CHAIN field. */

/* Register: RADIO_TASK_TRIG_STOP_CHAIN */
/* Description: Unspecified */

/* Bit 0 :   */
#define RADIO_TASK_TRIG_STOP_CHAIN_TASK_TRIG_STOP_CHAIN_Pos (0UL) /*!< Position of TASK_TRIG_STOP_CHAIN field. */
#define RADIO_TASK_TRIG_STOP_CHAIN_TASK_TRIG_STOP_CHAIN_Msk (0x1UL << RADIO_TASK_TRIG_STOP_CHAIN_TASK_TRIG_STOP_CHAIN_Pos) /*!< Bit mask of TASK_TRIG_STOP_CHAIN field. */

/* Register: RADIO_ENABLE_CHAIN */
/* Description: Unspecified */

/* Bit 0 :   */
#define RADIO_ENABLE_CHAIN_ENABLE_CHAIN_Pos (0UL) /*!< Position of ENABLE_CHAIN field. */
#define RADIO_ENABLE_CHAIN_ENABLE_CHAIN_Msk (0x1UL << RADIO_ENABLE_CHAIN_ENABLE_CHAIN_Pos) /*!< Bit mask of ENABLE_CHAIN field. */

/* Register: RADIO_PACKETPTR */
/* Description: Packet pointer */

/* Bit 29 :   */
#define RADIO_PACKETPTR_BASE_Pos (29UL) /*!< Position of BASE field. */
#define RADIO_PACKETPTR_BASE_Msk (0x1UL << RADIO_PACKETPTR_BASE_Pos) /*!< Bit mask of BASE field. */

/* Bits 15..0 :   */
#define RADIO_PACKETPTR_OFFSET_Pos (0UL) /*!< Position of OFFSET field. */
#define RADIO_PACKETPTR_OFFSET_Msk (0xFFFFUL << RADIO_PACKETPTR_OFFSET_Pos) /*!< Bit mask of OFFSET field. */

/* Register: RADIO_AMOUNT_CHAIN */
/* Description: Unspecified */

/* Bit 0 :   */
#define RADIO_AMOUNT_CHAIN_AMOUNT_CHAIN_Pos (0UL) /*!< Position of AMOUNT_CHAIN field. */
#define RADIO_AMOUNT_CHAIN_AMOUNT_CHAIN_Msk (0x1UL << RADIO_AMOUNT_CHAIN_AMOUNT_CHAIN_Pos) /*!< Bit mask of AMOUNT_CHAIN field. */

/* Register: RADIO_MAXCNT_CHAIN */
/* Description: Unspecified */

/* Bit 0 :   */
#define RADIO_MAXCNT_CHAIN_MAXCNT_CHAIN_Pos (0UL) /*!< Position of MAXCNT_CHAIN field. */
#define RADIO_MAXCNT_CHAIN_MAXCNT_CHAIN_Msk (0x1UL << RADIO_MAXCNT_CHAIN_MAXCNT_CHAIN_Pos) /*!< Bit mask of MAXCNT_CHAIN field. */

/* Register: RADIO_TXCONFIG */
/* Description: Tx configuration- */

/* Bit 29 : Enable long range mode (Do not enable both IEEE802154 and BLELONGRANGE) */
#define RADIO_TXCONFIG_BLELONGRANGE_Pos (29UL) /*!< Position of BLELONGRANGE field. */
#define RADIO_TXCONFIG_BLELONGRANGE_Msk (0x1UL << RADIO_TXCONFIG_BLELONGRANGE_Pos) /*!< Bit mask of BLELONGRANGE field. */
#define RADIO_TXCONFIG_BLELONGRANGE_Disable (0UL) /*!< BLELONGRANGE_NO */
#define RADIO_TXCONFIG_BLELONGRANGE_Enable (1UL) /*!< BLELONGRANGE_YES */

/* Bit 28 : Enable 15.4 mode (Do not enable both IEEE802154 and BLELONGRANGE) */
#define RADIO_TXCONFIG_IEEE802154_Pos (28UL) /*!< Position of IEEE802154 field. */
#define RADIO_TXCONFIG_IEEE802154_Msk (0x1UL << RADIO_TXCONFIG_IEEE802154_Pos) /*!< Bit mask of IEEE802154 field. */
#define RADIO_TXCONFIG_IEEE802154_Disable (0UL) /*!< IEEE802154_NO */
#define RADIO_TXCONFIG_IEEE802154_Enable (1UL) /*!< IEEE802154_YES */

/* Bits 27..25 : IQMOD modulation index. */
#define RADIO_TXCONFIG_IQMODINDEX_Pos (25UL) /*!< Position of IQMODINDEX field. */
#define RADIO_TXCONFIG_IQMODINDEX_Msk (0x7UL << RADIO_TXCONFIG_IQMODINDEX_Pos) /*!< Bit mask of IQMODINDEX field. */
#define RADIO_TXCONFIG_IQMODINDEX_ModIndex_0h25 (0UL) /*!< MODINDEX_0H25 */
#define RADIO_TXCONFIG_IQMODINDEX_ModIndex_0h32 (1UL) /*!< MODINDEX_0H32 */
#define RADIO_TXCONFIG_IQMODINDEX_ModIndex_0h5 (2UL) /*!< MODINDEX_0H5 */
#define RADIO_TXCONFIG_IQMODINDEX_ModIndex_1h0 (3UL) /*!< MODINDEX_1H0 */
#define RADIO_TXCONFIG_IQMODINDEX_ModIndex_2h0 (4UL) /*!< MODINDEX_2H0 */
#define RADIO_TXCONFIG_IQMODINDEX_Reserved_5 (5UL) /*!< MODINDEX_RESERVED5 */
#define RADIO_TXCONFIG_IQMODINDEX_Reserved_6 (6UL) /*!< MODINDEX_RESERVED6 */
#define RADIO_TXCONFIG_IQMODINDEX_Reserved_7 (7UL) /*!< MODINDEX_RESERVED7 */

/* Bits 23..22 : IQMOD GFSK bandwidth. */
#define RADIO_TXCONFIG_IQMODBT_Pos (22UL) /*!< Position of IQMODBT field. */
#define RADIO_TXCONFIG_IQMODBT_Msk (0x3UL << RADIO_TXCONFIG_IQMODBT_Pos) /*!< Bit mask of IQMODBT field. */
#define RADIO_TXCONFIG_IQMODBT_0bt55 (0UL) /*!< 0bt55 */
#define RADIO_TXCONFIG_IQMODBT_0bt60 (1UL) /*!< 0bt60 */
#define RADIO_TXCONFIG_IQMODBT_Reserved_2 (2UL) /*!< MODBT_RESERVED2 */

/* Bits 21..19 : IQMOD additional symbol mapping not set by MODE. */
#define RADIO_TXCONFIG_IQMODSYMBOL_Pos (19UL) /*!< Position of IQMODSYMBOL field. */
#define RADIO_TXCONFIG_IQMODSYMBOL_Msk (0x7UL << RADIO_TXCONFIG_IQMODSYMBOL_Pos) /*!< Bit mask of IQMODSYMBOL field. */

/* Bit 18 : Enable IQ modulator. */
#define RADIO_TXCONFIG_IQMODENABLE_Pos (18UL) /*!< Position of IQMODENABLE field. */
#define RADIO_TXCONFIG_IQMODENABLE_Msk (0x1UL << RADIO_TXCONFIG_IQMODENABLE_Pos) /*!< Bit mask of IQMODENABLE field. */

/* Bit 17 : Bypass MSK precoding. */
#define RADIO_TXCONFIG_BYPASSPRECODE_Pos (17UL) /*!< Position of BYPASSPRECODE field. */
#define RADIO_TXCONFIG_BYPASSPRECODE_Msk (0x1UL << RADIO_TXCONFIG_BYPASSPRECODE_Pos) /*!< Bit mask of BYPASSPRECODE field. */

