adamkondraciuk/nrfx/mdk/nrf54lilium_network_bitfields.h
/* Bit 16 : Swap pattern mapping. Default 0, 0 is mapped to a 0011 sequence, 1 is mapped to a 1100 sequence. If swap bit is set, 1 is mapped to a 0011 sequence, 0 is mapped to a 1100 sequence. */
#define RADIO_TXCONFIG_LRSPREADSWAP_Pos (16UL) /*!< Position of LRSPREADSWAP field. */
#define RADIO_TXCONFIG_LRSPREADSWAP_Msk (0x1UL << RADIO_TXCONFIG_LRSPREADSWAP_Pos) /*!< Bit mask of LRSPREADSWAP field. */

/* Bits 14..8 : Code polynomial 1 */
#define RADIO_TXCONFIG_CODEPOLY1_Pos (8UL) /*!< Position of CODEPOLY1 field. */
#define RADIO_TXCONFIG_CODEPOLY1_Msk (0x7FUL << RADIO_TXCONFIG_CODEPOLY1_Pos) /*!< Bit mask of CODEPOLY1 field. */

/* Bits 6..0 : Code polynomial 0 */
#define RADIO_TXCONFIG_CODEPOLY0_Pos (0UL) /*!< Position of CODEPOLY0 field. */
#define RADIO_TXCONFIG_CODEPOLY0_Msk (0x7FUL << RADIO_TXCONFIG_CODEPOLY0_Pos) /*!< Bit mask of CODEPOLY0 field. */

/* Register: RADIO_ADPLLCOMMAND */
/* Description: Send or receive command directly to the AdPll digital island. Only write to this register when FSASYNCBUSBUSY returns 0 */

/* Bit 31 : When 1, a read transaction is initiated. When the event COMPLETETRANS is set, read back this register */
#define RADIO_ADPLLCOMMAND_READ_Pos (31UL) /*!< Position of READ field. */
#define RADIO_ADPLLCOMMAND_READ_Msk (0x1UL << RADIO_ADPLLCOMMAND_READ_Pos) /*!< Bit mask of READ field. */

/* Bits 27..0 : Controls the asynch interface, bits[27:16] are address, bits [15:0] are command/data field */
#define RADIO_ADPLLCOMMAND_ADPLLCOMMAND_Pos (0UL) /*!< Position of ADPLLCOMMAND field. */
#define RADIO_ADPLLCOMMAND_ADPLLCOMMAND_Msk (0xFFFFFFFUL << RADIO_ADPLLCOMMAND_ADPLLCOMMAND_Pos) /*!< Bit mask of ADPLLCOMMAND field. */

/* Register: RADIO_FSFREQFINETUNE */
/* Description: For finetuning the frequency */

/* Bits 12..0 : 2-complement number for fine-tuning the frequency in steps of 488.28 Hz */
#define RADIO_FSFREQFINETUNE_FSFREQFINETUNE_Pos (0UL) /*!< Position of FSFREQFINETUNE field. */
#define RADIO_FSFREQFINETUNE_FSFREQFINETUNE_Msk (0x1FFFUL << RADIO_FSFREQFINETUNE_FSFREQFINETUNE_Pos) /*!< Bit mask of FSFREQFINETUNE field. */

/* Register: RADIO_DEVIATION */
/* Description: Frequency deviation for modulation */

/* Bits 9..0 : Frequency deviation for modulation */
#define RADIO_DEVIATION_DEVIATION_Pos (0UL) /*!< Position of DEVIATION field. */
#define RADIO_DEVIATION_DEVIATION_Msk (0x3FFUL << RADIO_DEVIATION_DEVIATION_Pos) /*!< Bit mask of DEVIATION field. */

/* Register: RADIO_MODRATE */
/* Description: Select modulation rate */

/* Bits 2..0 : Select modulation rate */
#define RADIO_MODRATE_MODRATE_Pos (0UL) /*!< Position of MODRATE field. */
#define RADIO_MODRATE_MODRATE_Msk (0x7UL << RADIO_MODRATE_MODRATE_Pos) /*!< Bit mask of MODRATE field. */
#define RADIO_MODRATE_MODRATE_250k (0UL) /*!< 250 kbps */
#define RADIO_MODRATE_MODRATE_500k (1UL) /*!< 500 kbps */
#define RADIO_MODRATE_MODRATE_1M (2UL) /*!< 1 Mbps */
#define RADIO_MODRATE_MODRATE_2M (3UL) /*!< 2 Mbps */
#define RADIO_MODRATE_MODRATE_4M (4UL) /*!< 4 Mbps */

/* Register: RADIO_MODFILTERING */
/* Description: Select gaussian filtering mode */

/* Bits 1..0 : Select gaussian filtering mode */
#define RADIO_MODFILTERING_MODFILTERING_Pos (0UL) /*!< Position of MODFILTERING field. */
#define RADIO_MODFILTERING_MODFILTERING_Msk (0x3UL << RADIO_MODFILTERING_MODFILTERING_Pos) /*!< Bit mask of MODFILTERING field. */
#define RADIO_MODFILTERING_MODFILTERING_None (0UL) /*!< No filtering */
#define RADIO_MODFILTERING_MODFILTERING_0bt55 (1UL) /*!< Gfsk Bt=0.55 */
#define RADIO_MODFILTERING_MODFILTERING_0bt60 (2UL) /*!< Gfsk Bt=0.60 */

/* Register: RADIO_CUSTOMMODULATION */
/* Description: Enable reading from memory and passing data over to AdPll */

/* Bit 0 : Enable reading from memory and passing data over to AdPll */
#define RADIO_CUSTOMMODULATION_ENABLE_Pos (0UL) /*!< Position of ENABLE field. */
#define RADIO_CUSTOMMODULATION_ENABLE_Msk (0x1UL << RADIO_CUSTOMMODULATION_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Register: RADIO_FSCLOCKSELECT */
/* Description: Set the clock source for the AdPll digital island */

/* Bit 31 : Override enable for setting the clock switch. If 0, fsStart decides which clock to use. If 1, FSCLOCKSELECT.OVRVAL selects which clock to use */
#define RADIO_FSCLOCKSELECT_OVREN_Pos (31UL) /*!< Position of OVREN field. */
#define RADIO_FSCLOCKSELECT_OVREN_Msk (0x1UL << RADIO_FSCLOCKSELECT_OVREN_Pos) /*!< Bit mask of OVREN field. */

/* Bit 30 : Used instead of 'fsStart' if FSCLOCKSELECT.OVREN is set */
#define RADIO_FSCLOCKSELECT_OVRVAL_Pos (30UL) /*!< Position of OVRVAL field. */
#define RADIO_FSCLOCKSELECT_OVRVAL_Msk (0x1UL << RADIO_FSCLOCKSELECT_OVRVAL_Pos) /*!< Bit mask of OVRVAL field. */

/* Bit 8 : Force-stopping the clock internally in the AdPll island */
#define RADIO_FSCLOCKSELECT_STOP_Pos (8UL) /*!< Position of STOP field. */
#define RADIO_FSCLOCKSELECT_STOP_Msk (0x1UL << RADIO_FSCLOCKSELECT_STOP_Pos) /*!< Bit mask of STOP field. */

/* Bits 3..2 : Set the clock source for the AdPll digital island when fsStart is low */
#define RADIO_FSCLOCKSELECT_CORE_Pos (2UL) /*!< Position of CORE field. */
#define RADIO_FSCLOCKSELECT_CORE_Msk (0x3UL << RADIO_FSCLOCKSELECT_CORE_Pos) /*!< Bit mask of CORE field. */

/* Bits 1..0 : Set the clock source for the AdPll digital island when fsStart is high */
#define RADIO_FSCLOCKSELECT_INTERNAL_Pos (0UL) /*!< Position of INTERNAL field. */
#define RADIO_FSCLOCKSELECT_INTERNAL_Msk (0x3UL << RADIO_FSCLOCKSELECT_INTERNAL_Pos) /*!< Bit mask of INTERNAL field. */

/* Register: RADIO_FSUNITRIGCALVAL */
/* Description: Read the calibrated value for the universal trigger */

/* Bits 4..0 : Read the calibrated value for the universal trigger */
#define RADIO_FSUNITRIGCALVAL_FSUNITRIGCALVAL_Pos (0UL) /*!< Position of FSUNITRIGCALVAL field. */
#define RADIO_FSUNITRIGCALVAL_FSUNITRIGCALVAL_Msk (0x1FUL << RADIO_FSUNITRIGCALVAL_FSUNITRIGCALVAL_Pos) /*!< Bit mask of FSUNITRIGCALVAL field. */

/* Register: RADIO_FSUNITRIGMANUAL */
/* Description: Manual control of the uni trigger signals. Note that fsUniTriggerCalWord is controlled by writing to the separate register FSUNITRIGCALVAL */

/* Bits 13..8 : The fsUniTriggerCalSrc signal when using manual control */
#define RADIO_FSUNITRIGMANUAL_FSUNITRIGGERSRC_Pos (8UL) /*!< Position of FSUNITRIGGERSRC field. */
#define RADIO_FSUNITRIGMANUAL_FSUNITRIGGERSRC_Msk (0x3FUL << RADIO_FSUNITRIGMANUAL_FSUNITRIGGERSRC_Pos) /*!< Bit mask of FSUNITRIGGERSRC field. */

/* Bit 2 : The fsUniTriggerCalEn signal when using manual control */
#define RADIO_FSUNITRIGMANUAL_FSUNITRIGGERCALEN_Pos (2UL) /*!< Position of FSUNITRIGGERCALEN field. */
#define RADIO_FSUNITRIGMANUAL_FSUNITRIGGERCALEN_Msk (0x1UL << RADIO_FSUNITRIGMANUAL_FSUNITRIGGERCALEN_Pos) /*!< Bit mask of FSUNITRIGGERCALEN field. */

/* Bit 1 : The fsUniTrigger signal when using manual control */
#define RADIO_FSUNITRIGMANUAL_FSUNITRIGGER_Pos (1UL) /*!< Position of FSUNITRIGGER field. */
#define RADIO_FSUNITRIGMANUAL_FSUNITRIGGER_Msk (0x1UL << RADIO_FSUNITRIGMANUAL_FSUNITRIGGER_Pos) /*!< Bit mask of FSUNITRIGGER field. */

/* Bit 0 : Enable manual control */
#define RADIO_FSUNITRIGMANUAL_ENABLEMANUAL_Pos (0UL) /*!< Position of ENABLEMANUAL field. */
#define RADIO_FSUNITRIGMANUAL_ENABLEMANUAL_Msk (0x1UL << RADIO_FSUNITRIGMANUAL_ENABLEMANUAL_Pos) /*!< Bit mask of ENABLEMANUAL field. */

/* Register: RADIO_FSUNITRIGCALOUT */
/* Description: Read the signal directly from fsUniTriggerCalOut */

/* Bits 1..0 : Read the raw fsUniTriggerCalOut value */
#define RADIO_FSUNITRIGCALOUT_FSUNITRIGCALOUT_Pos (0UL) /*!< Position of FSUNITRIGCALOUT field. */
#define RADIO_FSUNITRIGCALOUT_FSUNITRIGCALOUT_Msk (0x3UL << RADIO_FSUNITRIGCALOUT_FSUNITRIGCALOUT_Pos) /*!< Bit mask of FSUNITRIGCALOUT field. */

/* Register: RADIO_FSASYNCBUSCONF */
/* Description: Some special settings for the asynchronous bus configuration */

/* Bit 3 : The bus scheduler will not wait for AdPll to say clockStarted */
#define RADIO_FSASYNCBUSCONF_IGNORE_CLOCK_STARTED_Pos (3UL) /*!< Position of IGNORE_CLOCK_STARTED field. */
#define RADIO_FSASYNCBUSCONF_IGNORE_CLOCK_STARTED_Msk (0x1UL << RADIO_FSASYNCBUSCONF_IGNORE_CLOCK_STARTED_Pos) /*!< Bit mask of IGNORE_CLOCK_STARTED field. */

/* Bit 2 : When 1, check the first transaction during sending auto. If errorenous stop the state machine */
#define RADIO_FSASYNCBUSCONF_CHECKSTATUS_AUTO_Pos (2UL) /*!< Position of CHECKSTATUS_AUTO field. */
#define RADIO_FSASYNCBUSCONF_CHECKSTATUS_AUTO_Msk (0x1UL << RADIO_FSASYNCBUSCONF_CHECKSTATUS_AUTO_Pos) /*!< Bit mask of CHECKSTATUS_AUTO field. */

