adamkondraciuk/nrfx/mdk/nrf54lilium_network_bitfields.h
/* Bit 1 : Do not send settings at the beginning to AdPll */
#define RADIO_FSASYNCBUSCONF_DISABLE_AUTO_SETTING_Pos (1UL) /*!< Position of DISABLE_AUTO_SETTING field. */
#define RADIO_FSASYNCBUSCONF_DISABLE_AUTO_SETTING_Msk (0x1UL << RADIO_FSASYNCBUSCONF_DISABLE_AUTO_SETTING_Pos) /*!< Bit mask of DISABLE_AUTO_SETTING field. */

/* Bit 0 : When 1, every transaction uses 8 x 32 MHz clock cycles instead of 4 x 32 MHz clock cycles. Confirmation is received whether the transaction was actually received by AdPll. */
#define RADIO_FSASYNCBUSCONF_CHECKSTATUS_Pos (0UL) /*!< Position of CHECKSTATUS field. */
#define RADIO_FSASYNCBUSCONF_CHECKSTATUS_Msk (0x1UL << RADIO_FSASYNCBUSCONF_CHECKSTATUS_Pos) /*!< Bit mask of CHECKSTATUS field. */

/* Register: RADIO_FSASYNCBUSBUSY */
/* Description: Status bit indicating whether the bus is currently busy or not */

/* Bit 0 : Whether the bus is currently busy or not */
#define RADIO_FSASYNCBUSBUSY_FSASYNCBUSBUSY_Pos (0UL) /*!< Position of FSASYNCBUSBUSY field. */
#define RADIO_FSASYNCBUSBUSY_FSASYNCBUSBUSY_Msk (0x1UL << RADIO_FSASYNCBUSBUSY_FSASYNCBUSBUSY_Pos) /*!< Bit mask of FSASYNCBUSBUSY field. */

/* Register: RADIO_VARIOUS_BACKDOORS */
/* Description: This value is written to the AdPll when powering up the digital island */

/* Bits 9..8 : 0: no relock, 1: first gear of TRK, 2: back to ACQ, 3: back to full lock */
#define RADIO_VARIOUS_BACKDOORS_RELOAD_FREQ_WILL_TRIGGER_Pos (8UL) /*!< Position of RELOAD_FREQ_WILL_TRIGGER field. */
#define RADIO_VARIOUS_BACKDOORS_RELOAD_FREQ_WILL_TRIGGER_Msk (0x3UL << RADIO_VARIOUS_BACKDOORS_RELOAD_FREQ_WILL_TRIGGER_Pos) /*!< Bit mask of RELOAD_FREQ_WILL_TRIGGER field. */

/* Bits 5..4 : 0: no relock, 1: first gear of TRK, 2: back to ACQ, 3: back to full lock */
#define RADIO_VARIOUS_BACKDOORS_ON_THE_FLY_WILL_TRIGGER_Pos (4UL) /*!< Position of ON_THE_FLY_WILL_TRIGGER field. */
#define RADIO_VARIOUS_BACKDOORS_ON_THE_FLY_WILL_TRIGGER_Msk (0x3UL << RADIO_VARIOUS_BACKDOORS_ON_THE_FLY_WILL_TRIGGER_Pos) /*!< Bit mask of ON_THE_FLY_WILL_TRIGGER field. */

/* Bit 3 : Whether ck32MCore is active or not when OVR_EN_CK32MCORE is set. See also description of OVR_EN_CK32MCORE */
#define RADIO_VARIOUS_BACKDOORS_OVR_VAL_CK32MCORE_Pos (3UL) /*!< Position of OVR_VAL_CK32MCORE field. */
#define RADIO_VARIOUS_BACKDOORS_OVR_VAL_CK32MCORE_Msk (0x1UL << RADIO_VARIOUS_BACKDOORS_OVR_VAL_CK32MCORE_Pos) /*!< Bit mask of OVR_VAL_CK32MCORE field. */

/* Bit 2 : Make it possible to manually control whether ck32MCore is sent to the AdPll digital island. Needed to test complete clock silence in the AdPll island. It can also be used to enable the clock activity on the clock net even when the clock is not selected. */
#define RADIO_VARIOUS_BACKDOORS_OVR_EN_CK32MCORE_Pos (2UL) /*!< Position of OVR_EN_CK32MCORE field. */
#define RADIO_VARIOUS_BACKDOORS_OVR_EN_CK32MCORE_Msk (0x1UL << RADIO_VARIOUS_BACKDOORS_OVR_EN_CK32MCORE_Pos) /*!< Bit mask of OVR_EN_CK32MCORE field. */

/* Bit 1 : In normal operation we request clock when pwrupFsLdoDig0 is set. By setting this to 1, we will request clock even when pwrupFsLdoDig0. This may be useful for current measurements of FS_DIG */
#define RADIO_VARIOUS_BACKDOORS_REQUEST_CLOCK_OVERRIDE_Pos (1UL) /*!< Position of REQUEST_CLOCK_OVERRIDE field. */
#define RADIO_VARIOUS_BACKDOORS_REQUEST_CLOCK_OVERRIDE_Msk (0x1UL << RADIO_VARIOUS_BACKDOORS_REQUEST_CLOCK_OVERRIDE_Pos) /*!< Bit mask of REQUEST_CLOCK_OVERRIDE field. */

/* Bit 0 : If 0, we flip the interpretation of the sSel signal (to work around a bug if we have managed to flip it somewhere in the design process) */
#define RADIO_VARIOUS_BACKDOORS_FLIP_SSEL_Pos (0UL) /*!< Position of FLIP_SSEL field. */
#define RADIO_VARIOUS_BACKDOORS_FLIP_SSEL_Msk (0x1UL << RADIO_VARIOUS_BACKDOORS_FLIP_SSEL_Pos) /*!< Bit mask of FLIP_SSEL field. */

/* Register: RADIO_EXPECTEDPVTTOTRATIO */
/* Description: This value is written to the AdPll when powering up the digital island */

/* Bit 31 : When 1, we do not transfer this word to AdPll at power up */
#define RADIO_EXPECTEDPVTTOTRATIO_DONOTTRANSFER_Pos (31UL) /*!< Position of DONOTTRANSFER field. */
#define RADIO_EXPECTEDPVTTOTRATIO_DONOTTRANSFER_Msk (0x1UL << RADIO_EXPECTEDPVTTOTRATIO_DONOTTRANSFER_Pos) /*!< Bit mask of DONOTTRANSFER field. */

/* Bits 8..0 : The ratio between PVT and the total cap ratio. Used for Estkmod, Estkdtc and TdcReadout */
#define RADIO_EXPECTEDPVTTOTRATIO_EXPECTEDPVTTOTRATIO_Pos (0UL) /*!< Position of EXPECTEDPVTTOTRATIO field. */
#define RADIO_EXPECTEDPVTTOTRATIO_EXPECTEDPVTTOTRATIO_Msk (0x1FFUL << RADIO_EXPECTEDPVTTOTRATIO_EXPECTEDPVTTOTRATIO_Pos) /*!< Bit mask of EXPECTEDPVTTOTRATIO field. */

/* Register: RADIO_ESTKDTCVAL */
/* Description: This value is written to the AdPll when powering up the digital island */

/* Bit 31 : When 1, we do not transfer this word to AdPll at power up */
#define RADIO_ESTKDTCVAL_DONOTTRANSFER_Pos (31UL) /*!< Position of DONOTTRANSFER field. */
#define RADIO_ESTKDTCVAL_DONOTTRANSFER_Msk (0x1UL << RADIO_ESTKDTCVAL_DONOTTRANSFER_Pos) /*!< Bit mask of DONOTTRANSFER field. */

/* Bits 11..0 : The estimated kDTV value in typical */
#define RADIO_ESTKDTCVAL_ESTKDTVAL_Pos (0UL) /*!< Position of ESTKDTVAL field. */
#define RADIO_ESTKDTCVAL_ESTKDTVAL_Msk (0xFFFUL << RADIO_ESTKDTCVAL_ESTKDTVAL_Pos) /*!< Bit mask of ESTKDTVAL field. */

/* Register: RADIO_TXINTERFACEHFGAIN */
/* Description: This value is written to the AdPll when powering up the digital island */

/* Bit 31 : When 1, we do not transfer this word to AdPll at power up */
#define RADIO_TXINTERFACEHFGAIN_DONOTTRANSFER_Pos (31UL) /*!< Position of DONOTTRANSFER field. */
#define RADIO_TXINTERFACEHFGAIN_DONOTTRANSFER_Msk (0x1UL << RADIO_TXINTERFACEHFGAIN_DONOTTRANSFER_Pos) /*!< Bit mask of DONOTTRANSFER field. */

/* Bits 9..0 : The gain for the HF path */
#define RADIO_TXINTERFACEHFGAIN_TXINTERFACEHFGAIN_Pos (0UL) /*!< Position of TXINTERFACEHFGAIN field. */
#define RADIO_TXINTERFACEHFGAIN_TXINTERFACEHFGAIN_Msk (0x3FFUL << RADIO_TXINTERFACEHFGAIN_TXINTERFACEHFGAIN_Pos) /*!< Bit mask of TXINTERFACEHFGAIN field. */

/* Register: RADIO_TRACING */
/* Description: Enable tracing from AdPll */

/* Bit 0 : Enable tracing from AdPll */
#define RADIO_TRACING_ENABLE_Pos (0UL) /*!< Position of ENABLE field. */
#define RADIO_TRACING_ENABLE_Msk (0x1UL << RADIO_TRACING_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Register: RADIO_IFFREQ */
/* Description: Select between two different IF frequencies */

/* Bit 0 : Select between two different IF frequencies */
#define RADIO_IFFREQ_HIGHIF_Pos (0UL) /*!< Position of HIGHIF field. */
#define RADIO_IFFREQ_HIGHIF_Msk (0x1UL << RADIO_IFFREQ_HIGHIF_Pos) /*!< Bit mask of HIGHIF field. */
#define RADIO_IFFREQ_HIGHIF_1MHz (0UL) /*!< 1 MHz IF */
#define RADIO_IFFREQ_HIGHIF_2MHz (1UL) /*!< 2 MHz IF */

/* Register: RADIO_ADPLLCOMPANIONSTATE */
/* Description: State in the AdPllCompanion state machines */

/* Bits 14..12 : The state of the universal trigger calibration routine */
#define RADIO_ADPLLCOMPANIONSTATE_UNITRIGCALSTATE_Pos (12UL) /*!< Position of UNITRIGCALSTATE field. */
#define RADIO_ADPLLCOMPANIONSTATE_UNITRIGCALSTATE_Msk (0x7UL << RADIO_ADPLLCOMPANIONSTATE_UNITRIGCALSTATE_Pos) /*!< Bit mask of UNITRIGCALSTATE field. */

/* Bits 9..8 : The state of the clock switching state machine */
#define RADIO_ADPLLCOMPANIONSTATE_CLOCKSWITCHSTATE_Pos (8UL) /*!< Position of CLOCKSWITCHSTATE field. */
#define RADIO_ADPLLCOMPANIONSTATE_CLOCKSWITCHSTATE_Msk (0x3UL << RADIO_ADPLLCOMPANIONSTATE_CLOCKSWITCHSTATE_Pos) /*!< Bit mask of CLOCKSWITCHSTATE field. */

/* Bits 5..4 : The state of the async bus master */
#define RADIO_ADPLLCOMPANIONSTATE_BUSMASTERSTATE_Pos (4UL) /*!< Position of BUSMASTERSTATE field. */
#define RADIO_ADPLLCOMPANIONSTATE_BUSMASTERSTATE_Msk (0x3UL << RADIO_ADPLLCOMPANIONSTATE_BUSMASTERSTATE_Pos) /*!< Bit mask of BUSMASTERSTATE field. */

/* Bits 2..0 : The state of the state machine which sends commands automatically at startup */
#define RADIO_ADPLLCOMPANIONSTATE_BUSSCHEDULERSTATE_Pos (0UL) /*!< Position of BUSSCHEDULERSTATE field. */
#define RADIO_ADPLLCOMPANIONSTATE_BUSSCHEDULERSTATE_Msk (0x7UL << RADIO_ADPLLCOMPANIONSTATE_BUSSCHEDULERSTATE_Pos) /*!< Bit mask of BUSSCHEDULERSTATE field. */

/* Register: RADIO_RELOADFREQ */
/* Description: Non-official task: AdPll will reread the frequency input signal */

