adamkondraciuk/nrfx/mdk/nrf54lilium_network_bitfields.h
/* Bit 0 :   */
#define RADIO_RELOADFREQ_TRIGGER_Pos (0UL) /*!< Position of TRIGGER field. */
#define RADIO_RELOADFREQ_TRIGGER_Msk (0x1UL << RADIO_RELOADFREQ_TRIGGER_Pos) /*!< Bit mask of TRIGGER field. */

/* Register: RADIO_UNITRIGCALSTART */
/* Description: Non-official task: Start automatic universal trigger calibration */

/* Bit 0 :   */
#define RADIO_UNITRIGCALSTART_TRIGGER_Pos (0UL) /*!< Position of TRIGGER field. */
#define RADIO_UNITRIGCALSTART_TRIGGER_Msk (0x1UL << RADIO_UNITRIGCALSTART_TRIGGER_Pos) /*!< Bit mask of TRIGGER field. */

/* Register: RADIO_FSSENDSETTINGS */
/* Description: Non-official task: Send the auto-settings to AdPll again. This also happens at every startup */

/* Bit 0 :   */
#define RADIO_FSSENDSETTINGS_TRIGGER_Pos (0UL) /*!< Position of TRIGGER field. */
#define RADIO_FSSENDSETTINGS_TRIGGER_Msk (0x1UL << RADIO_FSSENDSETTINGS_TRIGGER_Pos) /*!< Bit mask of TRIGGER field. */

/* Register: RADIO_UNITRIGCALDONE */
/* Description: Non-official event: Start automatic universal trigger calibration */

/* Bit 0 :   */
#define RADIO_UNITRIGCALDONE_VAL_Pos (0UL) /*!< Position of VAL field. */
#define RADIO_UNITRIGCALDONE_VAL_Msk (0x1UL << RADIO_UNITRIGCALDONE_VAL_Pos) /*!< Bit mask of VAL field. */

/* Register: RADIO_REJECTEDTRANS */
/* Description: Non-official event: The command written to AdPll was rejected because of an ongoing transaction */

/* Bit 0 :   */
#define RADIO_REJECTEDTRANS_VAL_Pos (0UL) /*!< Position of VAL field. */
#define RADIO_REJECTEDTRANS_VAL_Msk (0x1UL << RADIO_REJECTEDTRANS_VAL_Pos) /*!< Bit mask of VAL field. */

/* Register: RADIO_COMPLETETRANS */
/* Description: Non-official event: Completed a transaction to AdPll successfully ((only when CHECKSTATUS is set) */

/* Bit 0 :   */
#define RADIO_COMPLETETRANS_VAL_Pos (0UL) /*!< Position of VAL field. */
#define RADIO_COMPLETETRANS_VAL_Msk (0x1UL << RADIO_COMPLETETRANS_VAL_Pos) /*!< Bit mask of VAL field. */

/* Register: RADIO_FAILEDTRANS */
/* Description: Non-official event: Did not successfully complete a transaction to AdPll. (only when CHECKSTATUS is set) */

/* Bit 0 :   */
#define RADIO_FAILEDTRANS_VAL_Pos (0UL) /*!< Position of VAL field. */
#define RADIO_FAILEDTRANS_VAL_Msk (0x1UL << RADIO_FAILEDTRANS_VAL_Pos) /*!< Bit mask of VAL field. */

/* Register: RADIO_ADPLL_STARTUP_COMMAND0 */
/* Description: This value is written to the AdPll when powering up the digital island */

/* Bit 31 : When 1, we do not transfer this word to AdPll at power up */
#define RADIO_ADPLL_STARTUP_COMMAND0_DONOTTRANSFER_Pos (31UL) /*!< Position of DONOTTRANSFER field. */
#define RADIO_ADPLL_STARTUP_COMMAND0_DONOTTRANSFER_Msk (0x1UL << RADIO_ADPLL_STARTUP_COMMAND0_DONOTTRANSFER_Pos) /*!< Bit mask of DONOTTRANSFER field. */

/* Bits 27..16 : The address of the digital island to write to */
#define RADIO_ADPLL_STARTUP_COMMAND0_ADDRESS_Pos (16UL) /*!< Position of ADDRESS field. */
#define RADIO_ADPLL_STARTUP_COMMAND0_ADDRESS_Msk (0xFFFUL << RADIO_ADPLL_STARTUP_COMMAND0_ADDRESS_Pos) /*!< Bit mask of ADDRESS field. */

/* Bits 15..0 : The value to be written the register in the digital island */
#define RADIO_ADPLL_STARTUP_COMMAND0_VALUE_Pos (0UL) /*!< Position of VALUE field. */
#define RADIO_ADPLL_STARTUP_COMMAND0_VALUE_Msk (0xFFFFUL << RADIO_ADPLL_STARTUP_COMMAND0_VALUE_Pos) /*!< Bit mask of VALUE field. */

/* Register: RADIO_ADPLL_STARTUP_COMMAND1 */
/* Description: This value is written to the AdPll when powering up the digital island */

/* Bit 31 : When 1, we do not transfer this word to AdPll at power up */
#define RADIO_ADPLL_STARTUP_COMMAND1_DONOTTRANSFER_Pos (31UL) /*!< Position of DONOTTRANSFER field. */
#define RADIO_ADPLL_STARTUP_COMMAND1_DONOTTRANSFER_Msk (0x1UL << RADIO_ADPLL_STARTUP_COMMAND1_DONOTTRANSFER_Pos) /*!< Bit mask of DONOTTRANSFER field. */

/* Bits 27..16 : The address of the digital island to write to */
#define RADIO_ADPLL_STARTUP_COMMAND1_ADDRESS_Pos (16UL) /*!< Position of ADDRESS field. */
#define RADIO_ADPLL_STARTUP_COMMAND1_ADDRESS_Msk (0xFFFUL << RADIO_ADPLL_STARTUP_COMMAND1_ADDRESS_Pos) /*!< Bit mask of ADDRESS field. */

/* Bits 15..0 : The value to be written the register in the digital island */
#define RADIO_ADPLL_STARTUP_COMMAND1_VALUE_Pos (0UL) /*!< Position of VALUE field. */
#define RADIO_ADPLL_STARTUP_COMMAND1_VALUE_Msk (0xFFFFUL << RADIO_ADPLL_STARTUP_COMMAND1_VALUE_Pos) /*!< Bit mask of VALUE field. */

/* Register: RADIO_ADPLL_STARTUP_COMMAND2 */
/* Description: This value is written to the AdPll when powering up the digital island */

/* Bit 31 : When 1, we do not transfer this word to AdPll at power up */
#define RADIO_ADPLL_STARTUP_COMMAND2_DONOTTRANSFER_Pos (31UL) /*!< Position of DONOTTRANSFER field. */
#define RADIO_ADPLL_STARTUP_COMMAND2_DONOTTRANSFER_Msk (0x1UL << RADIO_ADPLL_STARTUP_COMMAND2_DONOTTRANSFER_Pos) /*!< Bit mask of DONOTTRANSFER field. */

/* Bits 27..16 : The address of the digital island to write to */
#define RADIO_ADPLL_STARTUP_COMMAND2_ADDRESS_Pos (16UL) /*!< Position of ADDRESS field. */
#define RADIO_ADPLL_STARTUP_COMMAND2_ADDRESS_Msk (0xFFFUL << RADIO_ADPLL_STARTUP_COMMAND2_ADDRESS_Pos) /*!< Bit mask of ADDRESS field. */

/* Bits 15..0 : The value to be written the register in the digital island */
#define RADIO_ADPLL_STARTUP_COMMAND2_VALUE_Pos (0UL) /*!< Position of VALUE field. */
#define RADIO_ADPLL_STARTUP_COMMAND2_VALUE_Msk (0xFFFFUL << RADIO_ADPLL_STARTUP_COMMAND2_VALUE_Pos) /*!< Bit mask of VALUE field. */

/* Register: RADIO_ADPLL_STARTUP_COMMAND3 */
/* Description: This value is written to the AdPll when powering up the digital island */

/* Bit 31 : When 1, we do not transfer this word to AdPll at power up */
#define RADIO_ADPLL_STARTUP_COMMAND3_DONOTTRANSFER_Pos (31UL) /*!< Position of DONOTTRANSFER field. */
#define RADIO_ADPLL_STARTUP_COMMAND3_DONOTTRANSFER_Msk (0x1UL << RADIO_ADPLL_STARTUP_COMMAND3_DONOTTRANSFER_Pos) /*!< Bit mask of DONOTTRANSFER field. */

/* Bits 27..16 : The address of the digital island to write to */
#define RADIO_ADPLL_STARTUP_COMMAND3_ADDRESS_Pos (16UL) /*!< Position of ADDRESS field. */
#define RADIO_ADPLL_STARTUP_COMMAND3_ADDRESS_Msk (0xFFFUL << RADIO_ADPLL_STARTUP_COMMAND3_ADDRESS_Pos) /*!< Bit mask of ADDRESS field. */

/* Bits 15..0 : The value to be written the register in the digital island */
#define RADIO_ADPLL_STARTUP_COMMAND3_VALUE_Pos (0UL) /*!< Position of VALUE field. */
#define RADIO_ADPLL_STARTUP_COMMAND3_VALUE_Msk (0xFFFFUL << RADIO_ADPLL_STARTUP_COMMAND3_VALUE_Pos) /*!< Bit mask of VALUE field. */

/* Register: RADIO_ADPLL_STARTUP_COMMAND4 */
/* Description: This value is written to the AdPll when powering up the digital island */

/* Bit 31 : When 1, we do not transfer this word to AdPll at power up */
#define RADIO_ADPLL_STARTUP_COMMAND4_DONOTTRANSFER_Pos (31UL) /*!< Position of DONOTTRANSFER field. */
#define RADIO_ADPLL_STARTUP_COMMAND4_DONOTTRANSFER_Msk (0x1UL << RADIO_ADPLL_STARTUP_COMMAND4_DONOTTRANSFER_Pos) /*!< Bit mask of DONOTTRANSFER field. */

