adamkondraciuk/nrfx/mdk/nrf54lilium_network_bitfields.h
/* Bits 27..16 : The address of the digital island to write to */
#define RADIO_ADPLL_STARTUP_COMMAND4_ADDRESS_Pos (16UL) /*!< Position of ADDRESS field. */
#define RADIO_ADPLL_STARTUP_COMMAND4_ADDRESS_Msk (0xFFFUL << RADIO_ADPLL_STARTUP_COMMAND4_ADDRESS_Pos) /*!< Bit mask of ADDRESS field. */

/* Bits 15..0 : The value to be written the register in the digital island */
#define RADIO_ADPLL_STARTUP_COMMAND4_VALUE_Pos (0UL) /*!< Position of VALUE field. */
#define RADIO_ADPLL_STARTUP_COMMAND4_VALUE_Msk (0xFFFFUL << RADIO_ADPLL_STARTUP_COMMAND4_VALUE_Pos) /*!< Bit mask of VALUE field. */

/* Register: RADIO_ADPLL_STARTUP_COMMAND5 */
/* Description: This value is written to the AdPll when powering up the digital island */

/* Bit 31 : When 1, we do not transfer this word to AdPll at power up */
#define RADIO_ADPLL_STARTUP_COMMAND5_DONOTTRANSFER_Pos (31UL) /*!< Position of DONOTTRANSFER field. */
#define RADIO_ADPLL_STARTUP_COMMAND5_DONOTTRANSFER_Msk (0x1UL << RADIO_ADPLL_STARTUP_COMMAND5_DONOTTRANSFER_Pos) /*!< Bit mask of DONOTTRANSFER field. */

/* Bits 27..16 : The address of the digital island to write to */
#define RADIO_ADPLL_STARTUP_COMMAND5_ADDRESS_Pos (16UL) /*!< Position of ADDRESS field. */
#define RADIO_ADPLL_STARTUP_COMMAND5_ADDRESS_Msk (0xFFFUL << RADIO_ADPLL_STARTUP_COMMAND5_ADDRESS_Pos) /*!< Bit mask of ADDRESS field. */

/* Bits 15..0 : The value to be written the register in the digital island */
#define RADIO_ADPLL_STARTUP_COMMAND5_VALUE_Pos (0UL) /*!< Position of VALUE field. */
#define RADIO_ADPLL_STARTUP_COMMAND5_VALUE_Msk (0xFFFFUL << RADIO_ADPLL_STARTUP_COMMAND5_VALUE_Pos) /*!< Bit mask of VALUE field. */

/* Register: RADIO_ADPLL_STARTUP_COMMAND6 */
/* Description: This value is written to the AdPll when powering up the digital island */

/* Bit 31 : When 1, we do not transfer this word to AdPll at power up */
#define RADIO_ADPLL_STARTUP_COMMAND6_DONOTTRANSFER_Pos (31UL) /*!< Position of DONOTTRANSFER field. */
#define RADIO_ADPLL_STARTUP_COMMAND6_DONOTTRANSFER_Msk (0x1UL << RADIO_ADPLL_STARTUP_COMMAND6_DONOTTRANSFER_Pos) /*!< Bit mask of DONOTTRANSFER field. */

/* Bits 27..16 : The address of the digital island to write to */
#define RADIO_ADPLL_STARTUP_COMMAND6_ADDRESS_Pos (16UL) /*!< Position of ADDRESS field. */
#define RADIO_ADPLL_STARTUP_COMMAND6_ADDRESS_Msk (0xFFFUL << RADIO_ADPLL_STARTUP_COMMAND6_ADDRESS_Pos) /*!< Bit mask of ADDRESS field. */

/* Bits 15..0 : The value to be written the register in the digital island */
#define RADIO_ADPLL_STARTUP_COMMAND6_VALUE_Pos (0UL) /*!< Position of VALUE field. */
#define RADIO_ADPLL_STARTUP_COMMAND6_VALUE_Msk (0xFFFFUL << RADIO_ADPLL_STARTUP_COMMAND6_VALUE_Pos) /*!< Bit mask of VALUE field. */

/* Register: RADIO_ADPLL_STARTUP_COMMAND7 */
/* Description: This value is written to the AdPll when powering up the digital island */

/* Bit 31 : When 1, we do not transfer this word to AdPll at power up */
#define RADIO_ADPLL_STARTUP_COMMAND7_DONOTTRANSFER_Pos (31UL) /*!< Position of DONOTTRANSFER field. */
#define RADIO_ADPLL_STARTUP_COMMAND7_DONOTTRANSFER_Msk (0x1UL << RADIO_ADPLL_STARTUP_COMMAND7_DONOTTRANSFER_Pos) /*!< Bit mask of DONOTTRANSFER field. */

/* Bits 27..16 : The address of the digital island to write to */
#define RADIO_ADPLL_STARTUP_COMMAND7_ADDRESS_Pos (16UL) /*!< Position of ADDRESS field. */
#define RADIO_ADPLL_STARTUP_COMMAND7_ADDRESS_Msk (0xFFFUL << RADIO_ADPLL_STARTUP_COMMAND7_ADDRESS_Pos) /*!< Bit mask of ADDRESS field. */

/* Bits 15..0 : The value to be written the register in the digital island */
#define RADIO_ADPLL_STARTUP_COMMAND7_VALUE_Pos (0UL) /*!< Position of VALUE field. */
#define RADIO_ADPLL_STARTUP_COMMAND7_VALUE_Msk (0xFFFFUL << RADIO_ADPLL_STARTUP_COMMAND7_VALUE_Pos) /*!< Bit mask of VALUE field. */

/* Register: RADIO_ADPLLCOMPANION_INTEN */
/* Description: Unspecified */

/* Bits 3..0 :   */
#define RADIO_ADPLLCOMPANION_INTEN_ADPLLCOMPANION_INTEN_Pos (0UL) /*!< Position of ADPLLCOMPANION_INTEN field. */
#define RADIO_ADPLLCOMPANION_INTEN_ADPLLCOMPANION_INTEN_Msk (0xFUL << RADIO_ADPLLCOMPANION_INTEN_ADPLLCOMPANION_INTEN_Pos) /*!< Bit mask of ADPLLCOMPANION_INTEN field. */

/* Register: RADIO_ADPLLCOMPANION_INTENSET */
/* Description: Unspecified */

/* Bits 3..0 :   */
#define RADIO_ADPLLCOMPANION_INTENSET_ADPLLCOMPANION_INTENSET_Pos (0UL) /*!< Position of ADPLLCOMPANION_INTENSET field. */
#define RADIO_ADPLLCOMPANION_INTENSET_ADPLLCOMPANION_INTENSET_Msk (0xFUL << RADIO_ADPLLCOMPANION_INTENSET_ADPLLCOMPANION_INTENSET_Pos) /*!< Bit mask of ADPLLCOMPANION_INTENSET field. */

/* Register: RADIO_ADPLLCOMPANION_INTENCLR */
/* Description: Unspecified */

/* Bits 3..0 :   */
#define RADIO_ADPLLCOMPANION_INTENCLR_ADPLLCOMPANION_INTENCLR_Pos (0UL) /*!< Position of ADPLLCOMPANION_INTENCLR field. */
#define RADIO_ADPLLCOMPANION_INTENCLR_ADPLLCOMPANION_INTENCLR_Msk (0xFUL << RADIO_ADPLLCOMPANION_INTENCLR_ADPLLCOMPANION_INTENCLR_Pos) /*!< Bit mask of ADPLLCOMPANION_INTENCLR field. */

/* Register: RADIO_ADPLLCOMPANION_INTPEND */
/* Description: Unspecified */

/* Bits 3..0 :   */
#define RADIO_ADPLLCOMPANION_INTPEND_ADPLLCOMPANION_INTPEND_Pos (0UL) /*!< Position of ADPLLCOMPANION_INTPEND field. */
#define RADIO_ADPLLCOMPANION_INTPEND_ADPLLCOMPANION_INTPEND_Msk (0xFUL << RADIO_ADPLLCOMPANION_INTPEND_ADPLLCOMPANION_INTPEND_Pos) /*!< Bit mask of ADPLLCOMPANION_INTPEND field. */

/* Register: RADIO_SUBSCRIBE_TXEN */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_TXEN_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_SUBSCRIBE_TXEN_ENABLE_Msk (0x1UL << RADIO_SUBSCRIBE_TXEN_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_SUBSCRIBE_TXEN_TASK_Pos (0UL) /*!< Position of TASK field. */
#define RADIO_SUBSCRIBE_TXEN_TASK_Msk (0xFFUL << RADIO_SUBSCRIBE_TXEN_TASK_Pos) /*!< Bit mask of TASK field. */

/* Register: RADIO_SUBSCRIBE_RXEN */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_RXEN_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_SUBSCRIBE_RXEN_ENABLE_Msk (0x1UL << RADIO_SUBSCRIBE_RXEN_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_SUBSCRIBE_RXEN_TASK_Pos (0UL) /*!< Position of TASK field. */
#define RADIO_SUBSCRIBE_RXEN_TASK_Msk (0xFFUL << RADIO_SUBSCRIBE_RXEN_TASK_Pos) /*!< Bit mask of TASK field. */

/* Register: RADIO_SUBSCRIBE_START */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_START_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_SUBSCRIBE_START_ENABLE_Msk (0x1UL << RADIO_SUBSCRIBE_START_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_SUBSCRIBE_START_TASK_Pos (0UL) /*!< Position of TASK field. */
#define RADIO_SUBSCRIBE_START_TASK_Msk (0xFFUL << RADIO_SUBSCRIBE_START_TASK_Pos) /*!< Bit mask of TASK field. */

