adamkondraciuk/nrfx/mdk/nrf54lilium_network_bitfields.h
/* Register: RADIO_SUBSCRIBE_STOP */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_STOP_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_SUBSCRIBE_STOP_ENABLE_Msk (0x1UL << RADIO_SUBSCRIBE_STOP_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_SUBSCRIBE_STOP_TASK_Pos (0UL) /*!< Position of TASK field. */
#define RADIO_SUBSCRIBE_STOP_TASK_Msk (0xFFUL << RADIO_SUBSCRIBE_STOP_TASK_Pos) /*!< Bit mask of TASK field. */

/* Register: RADIO_SUBSCRIBE_DISABLE */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_DISABLE_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_SUBSCRIBE_DISABLE_ENABLE_Msk (0x1UL << RADIO_SUBSCRIBE_DISABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_SUBSCRIBE_DISABLE_TASK_Pos (0UL) /*!< Position of TASK field. */
#define RADIO_SUBSCRIBE_DISABLE_TASK_Msk (0xFFUL << RADIO_SUBSCRIBE_DISABLE_TASK_Pos) /*!< Bit mask of TASK field. */

/* Register: RADIO_SUBSCRIBE_RSSISTART */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_RSSISTART_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_SUBSCRIBE_RSSISTART_ENABLE_Msk (0x1UL << RADIO_SUBSCRIBE_RSSISTART_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_SUBSCRIBE_RSSISTART_TASK_Pos (0UL) /*!< Position of TASK field. */
#define RADIO_SUBSCRIBE_RSSISTART_TASK_Msk (0xFFUL << RADIO_SUBSCRIBE_RSSISTART_TASK_Pos) /*!< Bit mask of TASK field. */

/* Register: RADIO_SUBSCRIBE_BCSTART */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_BCSTART_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_SUBSCRIBE_BCSTART_ENABLE_Msk (0x1UL << RADIO_SUBSCRIBE_BCSTART_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_SUBSCRIBE_BCSTART_TASK_Pos (0UL) /*!< Position of TASK field. */
#define RADIO_SUBSCRIBE_BCSTART_TASK_Msk (0xFFUL << RADIO_SUBSCRIBE_BCSTART_TASK_Pos) /*!< Bit mask of TASK field. */

/* Register: RADIO_SUBSCRIBE_BCSTOP */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_BCSTOP_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_SUBSCRIBE_BCSTOP_ENABLE_Msk (0x1UL << RADIO_SUBSCRIBE_BCSTOP_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_SUBSCRIBE_BCSTOP_TASK_Pos (0UL) /*!< Position of TASK field. */
#define RADIO_SUBSCRIBE_BCSTOP_TASK_Msk (0xFFUL << RADIO_SUBSCRIBE_BCSTOP_TASK_Pos) /*!< Bit mask of TASK field. */

/* Register: RADIO_SUBSCRIBE_EDSTART */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_EDSTART_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_SUBSCRIBE_EDSTART_ENABLE_Msk (0x1UL << RADIO_SUBSCRIBE_EDSTART_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_SUBSCRIBE_EDSTART_TASK_Pos (0UL) /*!< Position of TASK field. */
#define RADIO_SUBSCRIBE_EDSTART_TASK_Msk (0xFFUL << RADIO_SUBSCRIBE_EDSTART_TASK_Pos) /*!< Bit mask of TASK field. */

/* Register: RADIO_SUBSCRIBE_EDSTOP */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_EDSTOP_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_SUBSCRIBE_EDSTOP_ENABLE_Msk (0x1UL << RADIO_SUBSCRIBE_EDSTOP_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_SUBSCRIBE_EDSTOP_TASK_Pos (0UL) /*!< Position of TASK field. */
#define RADIO_SUBSCRIBE_EDSTOP_TASK_Msk (0xFFUL << RADIO_SUBSCRIBE_EDSTOP_TASK_Pos) /*!< Bit mask of TASK field. */

/* Register: RADIO_SUBSCRIBE_CCASTART */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_CCASTART_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_SUBSCRIBE_CCASTART_ENABLE_Msk (0x1UL << RADIO_SUBSCRIBE_CCASTART_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_SUBSCRIBE_CCASTART_TASK_Pos (0UL) /*!< Position of TASK field. */
#define RADIO_SUBSCRIBE_CCASTART_TASK_Msk (0xFFUL << RADIO_SUBSCRIBE_CCASTART_TASK_Pos) /*!< Bit mask of TASK field. */

/* Register: RADIO_SUBSCRIBE_CCASTOP */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_CCASTOP_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_SUBSCRIBE_CCASTOP_ENABLE_Msk (0x1UL << RADIO_SUBSCRIBE_CCASTOP_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_SUBSCRIBE_CCASTOP_TASK_Pos (0UL) /*!< Position of TASK field. */
#define RADIO_SUBSCRIBE_CCASTOP_TASK_Msk (0xFFUL << RADIO_SUBSCRIBE_CCASTOP_TASK_Pos) /*!< Bit mask of TASK field. */

/* Register: RADIO_SUBSCRIBE_DFESTART */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_DFESTART_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_SUBSCRIBE_DFESTART_ENABLE_Msk (0x1UL << RADIO_SUBSCRIBE_DFESTART_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_SUBSCRIBE_DFESTART_TASK_Pos (0UL) /*!< Position of TASK field. */
#define RADIO_SUBSCRIBE_DFESTART_TASK_Msk (0xFFUL << RADIO_SUBSCRIBE_DFESTART_TASK_Pos) /*!< Bit mask of TASK field. */

/* Register: RADIO_SUBSCRIBE_DFESTOP */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_DFESTOP_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_SUBSCRIBE_DFESTOP_ENABLE_Msk (0x1UL << RADIO_SUBSCRIBE_DFESTOP_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_SUBSCRIBE_DFESTOP_TASK_Pos (0UL) /*!< Position of TASK field. */
#define RADIO_SUBSCRIBE_DFESTOP_TASK_Msk (0xFFUL << RADIO_SUBSCRIBE_DFESTOP_TASK_Pos) /*!< Bit mask of TASK field. */

/* Register: RADIO_SUBSCRIBE_ACQINJ0DMASTART */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_ACQINJ0DMASTART_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_SUBSCRIBE_ACQINJ0DMASTART_ENABLE_Msk (0x1UL << RADIO_SUBSCRIBE_ACQINJ0DMASTART_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_SUBSCRIBE_ACQINJ0DMASTART_TASK_Pos (0UL) /*!< Position of TASK field. */
#define RADIO_SUBSCRIBE_ACQINJ0DMASTART_TASK_Msk (0xFFUL << RADIO_SUBSCRIBE_ACQINJ0DMASTART_TASK_Pos) /*!< Bit mask of TASK field. */

/* Register: RADIO_SUBSCRIBE_ACQINJ0DMASTOP */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_ACQINJ0DMASTOP_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_SUBSCRIBE_ACQINJ0DMASTOP_ENABLE_Msk (0x1UL << RADIO_SUBSCRIBE_ACQINJ0DMASTOP_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_SUBSCRIBE_ACQINJ0DMASTOP_TASK_Pos (0UL) /*!< Position of TASK field. */
#define RADIO_SUBSCRIBE_ACQINJ0DMASTOP_TASK_Msk (0xFFUL << RADIO_SUBSCRIBE_ACQINJ0DMASTOP_TASK_Pos) /*!< Bit mask of TASK field. */

/* Register: RADIO_SUBSCRIBE_ACQINJ1DMASTART */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_ACQINJ1DMASTART_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_SUBSCRIBE_ACQINJ1DMASTART_ENABLE_Msk (0x1UL << RADIO_SUBSCRIBE_ACQINJ1DMASTART_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_SUBSCRIBE_ACQINJ1DMASTART_TASK_Pos (0UL) /*!< Position of TASK field. */
#define RADIO_SUBSCRIBE_ACQINJ1DMASTART_TASK_Msk (0xFFUL << RADIO_SUBSCRIBE_ACQINJ1DMASTART_TASK_Pos) /*!< Bit mask of TASK field. */

/* Register: RADIO_SUBSCRIBE_ACQINJ1DMASTOP */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_ACQINJ1DMASTOP_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_SUBSCRIBE_ACQINJ1DMASTOP_ENABLE_Msk (0x1UL << RADIO_SUBSCRIBE_ACQINJ1DMASTOP_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_SUBSCRIBE_ACQINJ1DMASTOP_TASK_Pos (0UL) /*!< Position of TASK field. */
#define RADIO_SUBSCRIBE_ACQINJ1DMASTOP_TASK_Msk (0xFFUL << RADIO_SUBSCRIBE_ACQINJ1DMASTOP_TASK_Pos) /*!< Bit mask of TASK field. */

