adamkondraciuk/nrfx/mdk/nrf54lilium_network_bitfields.h
/* Register: RADIO_SUBSCRIBE_CNTPSTART */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_CNTPSTART_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_SUBSCRIBE_CNTPSTART_ENABLE_Msk (0x1UL << RADIO_SUBSCRIBE_CNTPSTART_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_SUBSCRIBE_CNTPSTART_TASK_Pos (0UL) /*!< Position of TASK field. */
#define RADIO_SUBSCRIBE_CNTPSTART_TASK_Msk (0xFFUL << RADIO_SUBSCRIBE_CNTPSTART_TASK_Pos) /*!< Bit mask of TASK field. */

/* Register: RADIO_SUBSCRIBE_CNTPSTOP */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_CNTPSTOP_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_SUBSCRIBE_CNTPSTOP_ENABLE_Msk (0x1UL << RADIO_SUBSCRIBE_CNTPSTOP_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_SUBSCRIBE_CNTPSTOP_TASK_Pos (0UL) /*!< Position of TASK field. */
#define RADIO_SUBSCRIBE_CNTPSTOP_TASK_Msk (0xFFUL << RADIO_SUBSCRIBE_CNTPSTOP_TASK_Pos) /*!< Bit mask of TASK field. */

/* Register: RADIO_SUBSCRIBE_CNTPCLEAR */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_CNTPCLEAR_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_SUBSCRIBE_CNTPCLEAR_ENABLE_Msk (0x1UL << RADIO_SUBSCRIBE_CNTPCLEAR_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_SUBSCRIBE_CNTPCLEAR_TASK_Pos (0UL) /*!< Position of TASK field. */
#define RADIO_SUBSCRIBE_CNTPCLEAR_TASK_Msk (0xFFUL << RADIO_SUBSCRIBE_CNTPCLEAR_TASK_Pos) /*!< Bit mask of TASK field. */

/* Register: RADIO_SUBSCRIBE_LOOPBACKEN */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_LOOPBACKEN_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_SUBSCRIBE_LOOPBACKEN_ENABLE_Msk (0x1UL << RADIO_SUBSCRIBE_LOOPBACKEN_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_SUBSCRIBE_LOOPBACKEN_TASK_Pos (0UL) /*!< Position of TASK field. */
#define RADIO_SUBSCRIBE_LOOPBACKEN_TASK_Msk (0xFFUL << RADIO_SUBSCRIBE_LOOPBACKEN_TASK_Pos) /*!< Bit mask of TASK field. */

/* Register: RADIO_SUBSCRIBE_CALSTART */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_CALSTART_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_SUBSCRIBE_CALSTART_ENABLE_Msk (0x1UL << RADIO_SUBSCRIBE_CALSTART_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_SUBSCRIBE_CALSTART_TASK_Pos (0UL) /*!< Position of TASK field. */
#define RADIO_SUBSCRIBE_CALSTART_TASK_Msk (0xFFUL << RADIO_SUBSCRIBE_CALSTART_TASK_Pos) /*!< Bit mask of TASK field. */

/* Register: RADIO_SUBSCRIBE_CALSTOP */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_CALSTOP_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_SUBSCRIBE_CALSTOP_ENABLE_Msk (0x1UL << RADIO_SUBSCRIBE_CALSTOP_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_SUBSCRIBE_CALSTOP_TASK_Pos (0UL) /*!< Position of TASK field. */
#define RADIO_SUBSCRIBE_CALSTOP_TASK_Msk (0xFFUL << RADIO_SUBSCRIBE_CALSTOP_TASK_Pos) /*!< Bit mask of TASK field. */

/* Register: RADIO_SUBSCRIBE_PATESTSTART */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_PATESTSTART_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_SUBSCRIBE_PATESTSTART_ENABLE_Msk (0x1UL << RADIO_SUBSCRIBE_PATESTSTART_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_SUBSCRIBE_PATESTSTART_TASK_Pos (0UL) /*!< Position of TASK field. */
#define RADIO_SUBSCRIBE_PATESTSTART_TASK_Msk (0xFFUL << RADIO_SUBSCRIBE_PATESTSTART_TASK_Pos) /*!< Bit mask of TASK field. */

/* Register: RADIO_SUBSCRIBE_PATESTSTOP */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_PATESTSTOP_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_SUBSCRIBE_PATESTSTOP_ENABLE_Msk (0x1UL << RADIO_SUBSCRIBE_PATESTSTOP_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_SUBSCRIBE_PATESTSTOP_TASK_Pos (0UL) /*!< Position of TASK field. */
#define RADIO_SUBSCRIBE_PATESTSTOP_TASK_Msk (0xFFUL << RADIO_SUBSCRIBE_PATESTSTOP_TASK_Pos) /*!< Bit mask of TASK field. */

/* Register: RADIO_SUBSCRIBE_CHNOINCR */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_CHNOINCR_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_SUBSCRIBE_CHNOINCR_ENABLE_Msk (0x1UL << RADIO_SUBSCRIBE_CHNOINCR_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_SUBSCRIBE_CHNOINCR_TASK_Pos (0UL) /*!< Position of TASK field. */
#define RADIO_SUBSCRIBE_CHNOINCR_TASK_Msk (0xFFUL << RADIO_SUBSCRIBE_CHNOINCR_TASK_Pos) /*!< Bit mask of TASK field. */

/* Register: RADIO_SUBSCRIBE_DMASTART */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_DMASTART_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_SUBSCRIBE_DMASTART_ENABLE_Msk (0x1UL << RADIO_SUBSCRIBE_DMASTART_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_SUBSCRIBE_DMASTART_TASK_Pos (0UL) /*!< Position of TASK field. */
#define RADIO_SUBSCRIBE_DMASTART_TASK_Msk (0xFFUL << RADIO_SUBSCRIBE_DMASTART_TASK_Pos) /*!< Bit mask of TASK field. */

/* Register: RADIO_SUBSCRIBE_DMASTOP */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_DMASTOP_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_SUBSCRIBE_DMASTOP_ENABLE_Msk (0x1UL << RADIO_SUBSCRIBE_DMASTOP_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_SUBSCRIBE_DMASTOP_TASK_Pos (0UL) /*!< Position of TASK field. */
#define RADIO_SUBSCRIBE_DMASTOP_TASK_Msk (0xFFUL << RADIO_SUBSCRIBE_DMASTOP_TASK_Pos) /*!< Bit mask of TASK field. */

/* Register: RADIO_SUBSCRIBE_DFEDMASTART */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_DFEDMASTART_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_SUBSCRIBE_DFEDMASTART_ENABLE_Msk (0x1UL << RADIO_SUBSCRIBE_DFEDMASTART_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_SUBSCRIBE_DFEDMASTART_TASK_Pos (0UL) /*!< Position of TASK field. */
#define RADIO_SUBSCRIBE_DFEDMASTART_TASK_Msk (0xFFUL << RADIO_SUBSCRIBE_DFEDMASTART_TASK_Pos) /*!< Bit mask of TASK field. */

/* Register: RADIO_SUBSCRIBE_DFEDMASTOP */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_DFEDMASTOP_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_SUBSCRIBE_DFEDMASTOP_ENABLE_Msk (0x1UL << RADIO_SUBSCRIBE_DFEDMASTOP_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_SUBSCRIBE_DFEDMASTOP_TASK_Pos (0UL) /*!< Position of TASK field. */
#define RADIO_SUBSCRIBE_DFEDMASTOP_TASK_Msk (0xFFUL << RADIO_SUBSCRIBE_DFEDMASTOP_TASK_Pos) /*!< Bit mask of TASK field. */

/* Register: RADIO_SUBSCRIBE_RESERVED31 */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_RESERVED31_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_SUBSCRIBE_RESERVED31_ENABLE_Msk (0x1UL << RADIO_SUBSCRIBE_RESERVED31_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_SUBSCRIBE_RESERVED31_TASK_Pos (0UL) /*!< Position of TASK field. */
#define RADIO_SUBSCRIBE_RESERVED31_TASK_Msk (0xFFUL << RADIO_SUBSCRIBE_RESERVED31_TASK_Pos) /*!< Bit mask of TASK field. */

/* Register: RADIO_SUBSCRIBE_GETNEXTDETECT */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_GETNEXTDETECT_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_SUBSCRIBE_GETNEXTDETECT_ENABLE_Msk (0x1UL << RADIO_SUBSCRIBE_GETNEXTDETECT_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_SUBSCRIBE_GETNEXTDETECT_TASK_Pos (0UL) /*!< Position of TASK field. */
#define RADIO_SUBSCRIBE_GETNEXTDETECT_TASK_Msk (0xFFUL << RADIO_SUBSCRIBE_GETNEXTDETECT_TASK_Pos) /*!< Bit mask of TASK field. */

/* Register: RADIO_SUBSCRIBE_CLEARDETECTFIFO */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_CLEARDETECTFIFO_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_SUBSCRIBE_CLEARDETECTFIFO_ENABLE_Msk (0x1UL << RADIO_SUBSCRIBE_CLEARDETECTFIFO_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_SUBSCRIBE_CLEARDETECTFIFO_TASK_Pos (0UL) /*!< Position of TASK field. */
#define RADIO_SUBSCRIBE_CLEARDETECTFIFO_TASK_Msk (0xFFUL << RADIO_SUBSCRIBE_CLEARDETECTFIFO_TASK_Pos) /*!< Bit mask of TASK field. */

/* Register: RADIO_SUBSCRIBE_RESETDEMODCTRL */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_RESETDEMODCTRL_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_SUBSCRIBE_RESETDEMODCTRL_ENABLE_Msk (0x1UL << RADIO_SUBSCRIBE_RESETDEMODCTRL_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_SUBSCRIBE_RESETDEMODCTRL_TASK_Pos (0UL) /*!< Position of TASK field. */
#define RADIO_SUBSCRIBE_RESETDEMODCTRL_TASK_Msk (0xFFUL << RADIO_SUBSCRIBE_RESETDEMODCTRL_TASK_Pos) /*!< Bit mask of TASK field. */

/* Register: RADIO_SUBSCRIBE_DEMODCTRLSTARTTIMER */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_DEMODCTRLSTARTTIMER_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_SUBSCRIBE_DEMODCTRLSTARTTIMER_ENABLE_Msk (0x1UL << RADIO_SUBSCRIBE_DEMODCTRLSTARTTIMER_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_SUBSCRIBE_DEMODCTRLSTARTTIMER_TASK_Pos (0UL) /*!< Position of TASK field. */
#define RADIO_SUBSCRIBE_DEMODCTRLSTARTTIMER_TASK_Msk (0xFFUL << RADIO_SUBSCRIBE_DEMODCTRLSTARTTIMER_TASK_Pos) /*!< Bit mask of TASK field. */

/* Register: RADIO_SUBSCRIBE_DEMODCTRLSTOPTIMER */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_DEMODCTRLSTOPTIMER_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_SUBSCRIBE_DEMODCTRLSTOPTIMER_ENABLE_Msk (0x1UL << RADIO_SUBSCRIBE_DEMODCTRLSTOPTIMER_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_SUBSCRIBE_DEMODCTRLSTOPTIMER_TASK_Pos (0UL) /*!< Position of TASK field. */
#define RADIO_SUBSCRIBE_DEMODCTRLSTOPTIMER_TASK_Msk (0xFFUL << RADIO_SUBSCRIBE_DEMODCTRLSTOPTIMER_TASK_Pos) /*!< Bit mask of TASK field. */

/* Register: RADIO_SUBSCRIBE_DEMODCTRLCONDEN0 */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_DEMODCTRLCONDEN0_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_SUBSCRIBE_DEMODCTRLCONDEN0_ENABLE_Msk (0x1UL << RADIO_SUBSCRIBE_DEMODCTRLCONDEN0_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_SUBSCRIBE_DEMODCTRLCONDEN0_TASK_Pos (0UL) /*!< Position of TASK field. */
#define RADIO_SUBSCRIBE_DEMODCTRLCONDEN0_TASK_Msk (0xFFUL << RADIO_SUBSCRIBE_DEMODCTRLCONDEN0_TASK_Pos) /*!< Bit mask of TASK field. */

