adamkondraciuk/nrfx/mdk/nrf54lilium_network_bitfields.h
/* Register: RADIO_SUBSCRIBE_DEMODCTRLCONDEN1 */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_DEMODCTRLCONDEN1_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_SUBSCRIBE_DEMODCTRLCONDEN1_ENABLE_Msk (0x1UL << RADIO_SUBSCRIBE_DEMODCTRLCONDEN1_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_SUBSCRIBE_DEMODCTRLCONDEN1_TASK_Pos (0UL) /*!< Position of TASK field. */
#define RADIO_SUBSCRIBE_DEMODCTRLCONDEN1_TASK_Msk (0xFFUL << RADIO_SUBSCRIBE_DEMODCTRLCONDEN1_TASK_Pos) /*!< Bit mask of TASK field. */

/* Register: RADIO_SUBSCRIBE_DEMODCTRLCONDEN2 */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_DEMODCTRLCONDEN2_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_SUBSCRIBE_DEMODCTRLCONDEN2_ENABLE_Msk (0x1UL << RADIO_SUBSCRIBE_DEMODCTRLCONDEN2_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_SUBSCRIBE_DEMODCTRLCONDEN2_TASK_Pos (0UL) /*!< Position of TASK field. */
#define RADIO_SUBSCRIBE_DEMODCTRLCONDEN2_TASK_Msk (0xFFUL << RADIO_SUBSCRIBE_DEMODCTRLCONDEN2_TASK_Pos) /*!< Bit mask of TASK field. */

/* Register: RADIO_PUBLISH_READY */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_PUBLISH_READY_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_PUBLISH_READY_ENABLE_Msk (0x1UL << RADIO_PUBLISH_READY_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_PUBLISH_READY_EVENT_Pos (0UL) /*!< Position of EVENT field. */
#define RADIO_PUBLISH_READY_EVENT_Msk (0xFFUL << RADIO_PUBLISH_READY_EVENT_Pos) /*!< Bit mask of EVENT field. */

/* Register: RADIO_PUBLISH_TXREADY */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_PUBLISH_TXREADY_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_PUBLISH_TXREADY_ENABLE_Msk (0x1UL << RADIO_PUBLISH_TXREADY_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_PUBLISH_TXREADY_EVENT_Pos (0UL) /*!< Position of EVENT field. */
#define RADIO_PUBLISH_TXREADY_EVENT_Msk (0xFFUL << RADIO_PUBLISH_TXREADY_EVENT_Pos) /*!< Bit mask of EVENT field. */

/* Register: RADIO_PUBLISH_RXREADY */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_PUBLISH_RXREADY_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_PUBLISH_RXREADY_ENABLE_Msk (0x1UL << RADIO_PUBLISH_RXREADY_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_PUBLISH_RXREADY_EVENT_Pos (0UL) /*!< Position of EVENT field. */
#define RADIO_PUBLISH_RXREADY_EVENT_Msk (0xFFUL << RADIO_PUBLISH_RXREADY_EVENT_Pos) /*!< Bit mask of EVENT field. */

/* Register: RADIO_PUBLISH_ADDRESS */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_PUBLISH_ADDRESS_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_PUBLISH_ADDRESS_ENABLE_Msk (0x1UL << RADIO_PUBLISH_ADDRESS_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_PUBLISH_ADDRESS_EVENT_Pos (0UL) /*!< Position of EVENT field. */
#define RADIO_PUBLISH_ADDRESS_EVENT_Msk (0xFFUL << RADIO_PUBLISH_ADDRESS_EVENT_Pos) /*!< Bit mask of EVENT field. */

/* Register: RADIO_PUBLISH_FRAMESTART */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_PUBLISH_FRAMESTART_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_PUBLISH_FRAMESTART_ENABLE_Msk (0x1UL << RADIO_PUBLISH_FRAMESTART_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_PUBLISH_FRAMESTART_EVENT_Pos (0UL) /*!< Position of EVENT field. */
#define RADIO_PUBLISH_FRAMESTART_EVENT_Msk (0xFFUL << RADIO_PUBLISH_FRAMESTART_EVENT_Pos) /*!< Bit mask of EVENT field. */

/* Register: RADIO_PUBLISH_PAYLOAD */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_PUBLISH_PAYLOAD_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_PUBLISH_PAYLOAD_ENABLE_Msk (0x1UL << RADIO_PUBLISH_PAYLOAD_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_PUBLISH_PAYLOAD_EVENT_Pos (0UL) /*!< Position of EVENT field. */
#define RADIO_PUBLISH_PAYLOAD_EVENT_Msk (0xFFUL << RADIO_PUBLISH_PAYLOAD_EVENT_Pos) /*!< Bit mask of EVENT field. */

/* Register: RADIO_PUBLISH_END */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_PUBLISH_END_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_PUBLISH_END_ENABLE_Msk (0x1UL << RADIO_PUBLISH_END_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_PUBLISH_END_EVENT_Pos (0UL) /*!< Position of EVENT field. */
#define RADIO_PUBLISH_END_EVENT_Msk (0xFFUL << RADIO_PUBLISH_END_EVENT_Pos) /*!< Bit mask of EVENT field. */

/* Register: RADIO_PUBLISH_PHYEND */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_PUBLISH_PHYEND_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_PUBLISH_PHYEND_ENABLE_Msk (0x1UL << RADIO_PUBLISH_PHYEND_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_PUBLISH_PHYEND_EVENT_Pos (0UL) /*!< Position of EVENT field. */
#define RADIO_PUBLISH_PHYEND_EVENT_Msk (0xFFUL << RADIO_PUBLISH_PHYEND_EVENT_Pos) /*!< Bit mask of EVENT field. */

/* Register: RADIO_PUBLISH_DISABLED */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_PUBLISH_DISABLED_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_PUBLISH_DISABLED_ENABLE_Msk (0x1UL << RADIO_PUBLISH_DISABLED_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_PUBLISH_DISABLED_EVENT_Pos (0UL) /*!< Position of EVENT field. */
#define RADIO_PUBLISH_DISABLED_EVENT_Msk (0xFFUL << RADIO_PUBLISH_DISABLED_EVENT_Pos) /*!< Bit mask of EVENT field. */

/* Register: RADIO_PUBLISH_DEVMATCH */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_PUBLISH_DEVMATCH_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_PUBLISH_DEVMATCH_ENABLE_Msk (0x1UL << RADIO_PUBLISH_DEVMATCH_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_PUBLISH_DEVMATCH_EVENT_Pos (0UL) /*!< Position of EVENT field. */
#define RADIO_PUBLISH_DEVMATCH_EVENT_Msk (0xFFUL << RADIO_PUBLISH_DEVMATCH_EVENT_Pos) /*!< Bit mask of EVENT field. */

/* Register: RADIO_PUBLISH_DEVMISS */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_PUBLISH_DEVMISS_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_PUBLISH_DEVMISS_ENABLE_Msk (0x1UL << RADIO_PUBLISH_DEVMISS_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_PUBLISH_DEVMISS_EVENT_Pos (0UL) /*!< Position of EVENT field. */
#define RADIO_PUBLISH_DEVMISS_EVENT_Msk (0xFFUL << RADIO_PUBLISH_DEVMISS_EVENT_Pos) /*!< Bit mask of EVENT field. */

/* Register: RADIO_PUBLISH_CRCOK */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_PUBLISH_CRCOK_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_PUBLISH_CRCOK_ENABLE_Msk (0x1UL << RADIO_PUBLISH_CRCOK_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_PUBLISH_CRCOK_EVENT_Pos (0UL) /*!< Position of EVENT field. */
#define RADIO_PUBLISH_CRCOK_EVENT_Msk (0xFFUL << RADIO_PUBLISH_CRCOK_EVENT_Pos) /*!< Bit mask of EVENT field. */

/* Register: RADIO_PUBLISH_CRCERROR */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_PUBLISH_CRCERROR_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_PUBLISH_CRCERROR_ENABLE_Msk (0x1UL << RADIO_PUBLISH_CRCERROR_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_PUBLISH_CRCERROR_EVENT_Pos (0UL) /*!< Position of EVENT field. */
#define RADIO_PUBLISH_CRCERROR_EVENT_Msk (0xFFUL << RADIO_PUBLISH_CRCERROR_EVENT_Pos) /*!< Bit mask of EVENT field. */

/* Register: RADIO_PUBLISH_RESERVED13 */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_PUBLISH_RESERVED13_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_PUBLISH_RESERVED13_ENABLE_Msk (0x1UL << RADIO_PUBLISH_RESERVED13_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_PUBLISH_RESERVED13_EVENT_Pos (0UL) /*!< Position of EVENT field. */
#define RADIO_PUBLISH_RESERVED13_EVENT_Msk (0xFFUL << RADIO_PUBLISH_RESERVED13_EVENT_Pos) /*!< Bit mask of EVENT field. */

/* Register: RADIO_PUBLISH_BCMATCH */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_PUBLISH_BCMATCH_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_PUBLISH_BCMATCH_ENABLE_Msk (0x1UL << RADIO_PUBLISH_BCMATCH_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_PUBLISH_BCMATCH_EVENT_Pos (0UL) /*!< Position of EVENT field. */
#define RADIO_PUBLISH_BCMATCH_EVENT_Msk (0xFFUL << RADIO_PUBLISH_BCMATCH_EVENT_Pos) /*!< Bit mask of EVENT field. */

/* Register: RADIO_PUBLISH_EDEND */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_PUBLISH_EDEND_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_PUBLISH_EDEND_ENABLE_Msk (0x1UL << RADIO_PUBLISH_EDEND_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_PUBLISH_EDEND_EVENT_Pos (0UL) /*!< Position of EVENT field. */
#define RADIO_PUBLISH_EDEND_EVENT_Msk (0xFFUL << RADIO_PUBLISH_EDEND_EVENT_Pos) /*!< Bit mask of EVENT field. */

