adamkondraciuk/nrfx/mdk/nrf54lilium_network_bitfields.h
/* Register: RADIO_PUBLISH_EDSTOPPED */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_PUBLISH_EDSTOPPED_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_PUBLISH_EDSTOPPED_ENABLE_Msk (0x1UL << RADIO_PUBLISH_EDSTOPPED_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_PUBLISH_EDSTOPPED_EVENT_Pos (0UL) /*!< Position of EVENT field. */
#define RADIO_PUBLISH_EDSTOPPED_EVENT_Msk (0xFFUL << RADIO_PUBLISH_EDSTOPPED_EVENT_Pos) /*!< Bit mask of EVENT field. */

/* Register: RADIO_PUBLISH_CCAIDLE */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_PUBLISH_CCAIDLE_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_PUBLISH_CCAIDLE_ENABLE_Msk (0x1UL << RADIO_PUBLISH_CCAIDLE_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_PUBLISH_CCAIDLE_EVENT_Pos (0UL) /*!< Position of EVENT field. */
#define RADIO_PUBLISH_CCAIDLE_EVENT_Msk (0xFFUL << RADIO_PUBLISH_CCAIDLE_EVENT_Pos) /*!< Bit mask of EVENT field. */

/* Register: RADIO_PUBLISH_CCABUSY */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_PUBLISH_CCABUSY_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_PUBLISH_CCABUSY_ENABLE_Msk (0x1UL << RADIO_PUBLISH_CCABUSY_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_PUBLISH_CCABUSY_EVENT_Pos (0UL) /*!< Position of EVENT field. */
#define RADIO_PUBLISH_CCABUSY_EVENT_Msk (0xFFUL << RADIO_PUBLISH_CCABUSY_EVENT_Pos) /*!< Bit mask of EVENT field. */

/* Register: RADIO_PUBLISH_CCASTOPPED */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_PUBLISH_CCASTOPPED_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_PUBLISH_CCASTOPPED_ENABLE_Msk (0x1UL << RADIO_PUBLISH_CCASTOPPED_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_PUBLISH_CCASTOPPED_EVENT_Pos (0UL) /*!< Position of EVENT field. */
#define RADIO_PUBLISH_CCASTOPPED_EVENT_Msk (0xFFUL << RADIO_PUBLISH_CCASTOPPED_EVENT_Pos) /*!< Bit mask of EVENT field. */

/* Register: RADIO_PUBLISH_RATEBOOST */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_PUBLISH_RATEBOOST_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_PUBLISH_RATEBOOST_ENABLE_Msk (0x1UL << RADIO_PUBLISH_RATEBOOST_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_PUBLISH_RATEBOOST_EVENT_Pos (0UL) /*!< Position of EVENT field. */
#define RADIO_PUBLISH_RATEBOOST_EVENT_Msk (0xFFUL << RADIO_PUBLISH_RATEBOOST_EVENT_Pos) /*!< Bit mask of EVENT field. */

/* Register: RADIO_PUBLISH_MHRMATCH */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_PUBLISH_MHRMATCH_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_PUBLISH_MHRMATCH_ENABLE_Msk (0x1UL << RADIO_PUBLISH_MHRMATCH_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_PUBLISH_MHRMATCH_EVENT_Pos (0UL) /*!< Position of EVENT field. */
#define RADIO_PUBLISH_MHRMATCH_EVENT_Msk (0xFFUL << RADIO_PUBLISH_MHRMATCH_EVENT_Pos) /*!< Bit mask of EVENT field. */

/* Register: RADIO_PUBLISH_SYNC */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_PUBLISH_SYNC_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_PUBLISH_SYNC_ENABLE_Msk (0x1UL << RADIO_PUBLISH_SYNC_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_PUBLISH_SYNC_EVENT_Pos (0UL) /*!< Position of EVENT field. */
#define RADIO_PUBLISH_SYNC_EVENT_Msk (0xFFUL << RADIO_PUBLISH_SYNC_EVENT_Pos) /*!< Bit mask of EVENT field. */

/* Register: RADIO_PUBLISH_CTEPRESENT */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_PUBLISH_CTEPRESENT_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_PUBLISH_CTEPRESENT_ENABLE_Msk (0x1UL << RADIO_PUBLISH_CTEPRESENT_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_PUBLISH_CTEPRESENT_EVENT_Pos (0UL) /*!< Position of EVENT field. */
#define RADIO_PUBLISH_CTEPRESENT_EVENT_Msk (0xFFUL << RADIO_PUBLISH_CTEPRESENT_EVENT_Pos) /*!< Bit mask of EVENT field. */

/* Register: RADIO_PUBLISH_CTEWARNING */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_PUBLISH_CTEWARNING_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_PUBLISH_CTEWARNING_ENABLE_Msk (0x1UL << RADIO_PUBLISH_CTEWARNING_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_PUBLISH_CTEWARNING_EVENT_Pos (0UL) /*!< Position of EVENT field. */
#define RADIO_PUBLISH_CTEWARNING_EVENT_Msk (0xFFUL << RADIO_PUBLISH_CTEWARNING_EVENT_Pos) /*!< Bit mask of EVENT field. */

/* Register: RADIO_PUBLISH_DFEEND */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_PUBLISH_DFEEND_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_PUBLISH_DFEEND_ENABLE_Msk (0x1UL << RADIO_PUBLISH_DFEEND_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_PUBLISH_DFEEND_EVENT_Pos (0UL) /*!< Position of EVENT field. */
#define RADIO_PUBLISH_DFEEND_EVENT_Msk (0xFFUL << RADIO_PUBLISH_DFEEND_EVENT_Pos) /*!< Bit mask of EVENT field. */

/* Register: RADIO_PUBLISH_MODEWRITTEN */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_PUBLISH_MODEWRITTEN_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_PUBLISH_MODEWRITTEN_ENABLE_Msk (0x1UL << RADIO_PUBLISH_MODEWRITTEN_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_PUBLISH_MODEWRITTEN_EVENT_Pos (0UL) /*!< Position of EVENT field. */
#define RADIO_PUBLISH_MODEWRITTEN_EVENT_Msk (0xFFUL << RADIO_PUBLISH_MODEWRITTEN_EVENT_Pos) /*!< Bit mask of EVENT field. */

/* Register: RADIO_PUBLISH_MODEREADY */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_PUBLISH_MODEREADY_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_PUBLISH_MODEREADY_ENABLE_Msk (0x1UL << RADIO_PUBLISH_MODEREADY_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_PUBLISH_MODEREADY_EVENT_Pos (0UL) /*!< Position of EVENT field. */
#define RADIO_PUBLISH_MODEREADY_EVENT_Msk (0xFFUL << RADIO_PUBLISH_MODEREADY_EVENT_Pos) /*!< Bit mask of EVENT field. */

/* Register: RADIO_PUBLISH_CTEEND */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_PUBLISH_CTEEND_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_PUBLISH_CTEEND_ENABLE_Msk (0x1UL << RADIO_PUBLISH_CTEEND_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_PUBLISH_CTEEND_EVENT_Pos (0UL) /*!< Position of EVENT field. */
#define RADIO_PUBLISH_CTEEND_EVENT_Msk (0xFFUL << RADIO_PUBLISH_CTEEND_EVENT_Pos) /*!< Bit mask of EVENT field. */

/* Register: RADIO_PUBLISH_LBREADY */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_PUBLISH_LBREADY_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_PUBLISH_LBREADY_ENABLE_Msk (0x1UL << RADIO_PUBLISH_LBREADY_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_PUBLISH_LBREADY_EVENT_Pos (0UL) /*!< Position of EVENT field. */
#define RADIO_PUBLISH_LBREADY_EVENT_Msk (0xFFUL << RADIO_PUBLISH_LBREADY_EVENT_Pos) /*!< Bit mask of EVENT field. */

/* Register: RADIO_PUBLISH_CALDONE */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_PUBLISH_CALDONE_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_PUBLISH_CALDONE_ENABLE_Msk (0x1UL << RADIO_PUBLISH_CALDONE_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_PUBLISH_CALDONE_EVENT_Pos (0UL) /*!< Position of EVENT field. */
#define RADIO_PUBLISH_CALDONE_EVENT_Msk (0xFFUL << RADIO_PUBLISH_CALDONE_EVENT_Pos) /*!< Bit mask of EVENT field. */

