adamkondraciuk/nrfx/mdk/nrf54lilium_network_bitfields.h
/* Register: RADIO_PUBLISH_CHNOUPDATED */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_PUBLISH_CHNOUPDATED_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_PUBLISH_CHNOUPDATED_ENABLE_Msk (0x1UL << RADIO_PUBLISH_CHNOUPDATED_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_PUBLISH_CHNOUPDATED_EVENT_Pos (0UL) /*!< Position of EVENT field. */
#define RADIO_PUBLISH_CHNOUPDATED_EVENT_Msk (0xFFUL << RADIO_PUBLISH_CHNOUPDATED_EVENT_Pos) /*!< Bit mask of EVENT field. */

/* Register: RADIO_PUBLISH_DBCTIMEOUT */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_PUBLISH_DBCTIMEOUT_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_PUBLISH_DBCTIMEOUT_ENABLE_Msk (0x1UL << RADIO_PUBLISH_DBCTIMEOUT_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_PUBLISH_DBCTIMEOUT_EVENT_Pos (0UL) /*!< Position of EVENT field. */
#define RADIO_PUBLISH_DBCTIMEOUT_EVENT_Msk (0xFFUL << RADIO_PUBLISH_DBCTIMEOUT_EVENT_Pos) /*!< Bit mask of EVENT field. */

/* Register: RADIO_PUBLISH_TXTIMERMATCH */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_PUBLISH_TXTIMERMATCH_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_PUBLISH_TXTIMERMATCH_ENABLE_Msk (0x1UL << RADIO_PUBLISH_TXTIMERMATCH_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_PUBLISH_TXTIMERMATCH_EVENT_Pos (0UL) /*!< Position of EVENT field. */
#define RADIO_PUBLISH_TXTIMERMATCH_EVENT_Msk (0xFFUL << RADIO_PUBLISH_TXTIMERMATCH_EVENT_Pos) /*!< Bit mask of EVENT field. */

/* Register: RADIO_PUBLISH_RXTIMERMATCH */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_PUBLISH_RXTIMERMATCH_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_PUBLISH_RXTIMERMATCH_ENABLE_Msk (0x1UL << RADIO_PUBLISH_RXTIMERMATCH_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_PUBLISH_RXTIMERMATCH_EVENT_Pos (0UL) /*!< Position of EVENT field. */
#define RADIO_PUBLISH_RXTIMERMATCH_EVENT_Msk (0xFFUL << RADIO_PUBLISH_RXTIMERMATCH_EVENT_Pos) /*!< Bit mask of EVENT field. */

/* Register: RADIO_PUBLISH_RESERVED35 */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_PUBLISH_RESERVED35_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_PUBLISH_RESERVED35_ENABLE_Msk (0x1UL << RADIO_PUBLISH_RESERVED35_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_PUBLISH_RESERVED35_EVENT_Pos (0UL) /*!< Position of EVENT field. */
#define RADIO_PUBLISH_RESERVED35_EVENT_Msk (0xFFUL << RADIO_PUBLISH_RESERVED35_EVENT_Pos) /*!< Bit mask of EVENT field. */

/* Register: RADIO_PUBLISH_RXDIGEN */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_PUBLISH_RXDIGEN_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_PUBLISH_RXDIGEN_ENABLE_Msk (0x1UL << RADIO_PUBLISH_RXDIGEN_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_PUBLISH_RXDIGEN_EVENT_Pos (0UL) /*!< Position of EVENT field. */
#define RADIO_PUBLISH_RXDIGEN_EVENT_Msk (0xFFUL << RADIO_PUBLISH_RXDIGEN_EVENT_Pos) /*!< Bit mask of EVENT field. */

/* Register: RADIO_PUBLISH_RAWDETECT */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_PUBLISH_RAWDETECT_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_PUBLISH_RAWDETECT_ENABLE_Msk (0x1UL << RADIO_PUBLISH_RAWDETECT_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_PUBLISH_RAWDETECT_EVENT_Pos (0UL) /*!< Position of EVENT field. */
#define RADIO_PUBLISH_RAWDETECT_EVENT_Msk (0xFFUL << RADIO_PUBLISH_RAWDETECT_EVENT_Pos) /*!< Bit mask of EVENT field. */

/* Register: RADIO_PUBLISH_DETECTFIFOFULL */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_PUBLISH_DETECTFIFOFULL_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_PUBLISH_DETECTFIFOFULL_ENABLE_Msk (0x1UL << RADIO_PUBLISH_DETECTFIFOFULL_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_PUBLISH_DETECTFIFOFULL_EVENT_Pos (0UL) /*!< Position of EVENT field. */
#define RADIO_PUBLISH_DETECTFIFOFULL_EVENT_Msk (0xFFUL << RADIO_PUBLISH_DETECTFIFOFULL_EVENT_Pos) /*!< Bit mask of EVENT field. */

/* Register: RADIO_PUBLISH_TIMERWRAPS */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_PUBLISH_TIMERWRAPS_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_PUBLISH_TIMERWRAPS_ENABLE_Msk (0x1UL << RADIO_PUBLISH_TIMERWRAPS_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_PUBLISH_TIMERWRAPS_EVENT_Pos (0UL) /*!< Position of EVENT field. */
#define RADIO_PUBLISH_TIMERWRAPS_EVENT_Msk (0xFFUL << RADIO_PUBLISH_TIMERWRAPS_EVENT_Pos) /*!< Bit mask of EVENT field. */

/* Register: RADIO_PUBLISH_STROBETIMETRACKUPDATED */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_PUBLISH_STROBETIMETRACKUPDATED_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_PUBLISH_STROBETIMETRACKUPDATED_ENABLE_Msk (0x1UL << RADIO_PUBLISH_STROBETIMETRACKUPDATED_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_PUBLISH_STROBETIMETRACKUPDATED_EVENT_Pos (0UL) /*!< Position of EVENT field. */
#define RADIO_PUBLISH_STROBETIMETRACKUPDATED_EVENT_Msk (0xFFUL << RADIO_PUBLISH_STROBETIMETRACKUPDATED_EVENT_Pos) /*!< Bit mask of EVENT field. */

/* Register: RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED0 */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED0_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED0_ENABLE_Msk (0x1UL << RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED0_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED0_EVENT_Pos (0UL) /*!< Position of EVENT field. */
#define RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED0_EVENT_Msk (0xFFUL << RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED0_EVENT_Pos) /*!< Bit mask of EVENT field. */

/* Register: RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED1 */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED1_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED1_ENABLE_Msk (0x1UL << RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED1_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED1_EVENT_Pos (0UL) /*!< Position of EVENT field. */
#define RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED1_EVENT_Msk (0xFFUL << RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED1_EVENT_Pos) /*!< Bit mask of EVENT field. */

/* Register: RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED2 */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED2_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED2_ENABLE_Msk (0x1UL << RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED2_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED2_EVENT_Pos (0UL) /*!< Position of EVENT field. */
#define RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED2_EVENT_Msk (0xFFUL << RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED2_EVENT_Pos) /*!< Bit mask of EVENT field. */

