adamkondraciuk/nrfx/mdk/nrf54lilium_network_bitfields.h
/* Register: RADIO_PUBLISH_RESERVED44 */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_PUBLISH_RESERVED44_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_PUBLISH_RESERVED44_ENABLE_Msk (0x1UL << RADIO_PUBLISH_RESERVED44_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_PUBLISH_RESERVED44_EVENT_Pos (0UL) /*!< Position of EVENT field. */
#define RADIO_PUBLISH_RESERVED44_EVENT_Msk (0xFFUL << RADIO_PUBLISH_RESERVED44_EVENT_Pos) /*!< Bit mask of EVENT field. */

/* Register: RADIO_PUBLISH_RESERVED45 */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_PUBLISH_RESERVED45_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_PUBLISH_RESERVED45_ENABLE_Msk (0x1UL << RADIO_PUBLISH_RESERVED45_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_PUBLISH_RESERVED45_EVENT_Pos (0UL) /*!< Position of EVENT field. */
#define RADIO_PUBLISH_RESERVED45_EVENT_Msk (0xFFUL << RADIO_PUBLISH_RESERVED45_EVENT_Pos) /*!< Bit mask of EVENT field. */

/* Register: RADIO_PUBLISH_RESERVED46 */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_PUBLISH_RESERVED46_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_PUBLISH_RESERVED46_ENABLE_Msk (0x1UL << RADIO_PUBLISH_RESERVED46_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_PUBLISH_RESERVED46_EVENT_Pos (0UL) /*!< Position of EVENT field. */
#define RADIO_PUBLISH_RESERVED46_EVENT_Msk (0xFFUL << RADIO_PUBLISH_RESERVED46_EVENT_Pos) /*!< Bit mask of EVENT field. */

/* Register: RADIO_PUBLISH_RESERVED47 */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_PUBLISH_RESERVED47_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_PUBLISH_RESERVED47_ENABLE_Msk (0x1UL << RADIO_PUBLISH_RESERVED47_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_PUBLISH_RESERVED47_EVENT_Pos (0UL) /*!< Position of EVENT field. */
#define RADIO_PUBLISH_RESERVED47_EVENT_Msk (0xFFUL << RADIO_PUBLISH_RESERVED47_EVENT_Pos) /*!< Bit mask of EVENT field. */

/* Register: RADIO_PUBLISH_ACQINJ0DMAEND */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_PUBLISH_ACQINJ0DMAEND_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_PUBLISH_ACQINJ0DMAEND_ENABLE_Msk (0x1UL << RADIO_PUBLISH_ACQINJ0DMAEND_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_PUBLISH_ACQINJ0DMAEND_EVENT_Pos (0UL) /*!< Position of EVENT field. */
#define RADIO_PUBLISH_ACQINJ0DMAEND_EVENT_Msk (0xFFUL << RADIO_PUBLISH_ACQINJ0DMAEND_EVENT_Pos) /*!< Bit mask of EVENT field. */

/* Register: RADIO_PUBLISH_ACQINJ1DMAEND */
/* Description: Unspecified */

/* Bit 31 :   */
#define RADIO_PUBLISH_ACQINJ1DMAEND_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define RADIO_PUBLISH_ACQINJ1DMAEND_ENABLE_Msk (0x1UL << RADIO_PUBLISH_ACQINJ1DMAEND_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Bits 7..0 :   */
#define RADIO_PUBLISH_ACQINJ1DMAEND_EVENT_Pos (0UL) /*!< Position of EVENT field. */
#define RADIO_PUBLISH_ACQINJ1DMAEND_EVENT_Msk (0xFFUL << RADIO_PUBLISH_ACQINJ1DMAEND_EVENT_Pos) /*!< Bit mask of EVENT field. */

/* Register: RADIO_TASK_TRIG_ZERO_PENALTY_PCP_4 */
/* Description: Unspecified */

/* Bit 0 :   */
#define RADIO_TASK_TRIG_ZERO_PENALTY_PCP_4_TASK_TRIG_ZERO_PENALTY_PCP_4_Pos (0UL) /*!< Position of TASK_TRIG_ZERO_PENALTY_PCP_4 field. */
#define RADIO_TASK_TRIG_ZERO_PENALTY_PCP_4_TASK_TRIG_ZERO_PENALTY_PCP_4_Msk (0x1UL << RADIO_TASK_TRIG_ZERO_PENALTY_PCP_4_TASK_TRIG_ZERO_PENALTY_PCP_4_Pos) /*!< Bit mask of TASK_TRIG_ZERO_PENALTY_PCP_4 field. */

/* Register: RADIO_TASK_TRIG_FULL_PENALTY_PCP_4 */
/* Description: Unspecified */

/* Bit 0 :   */
#define RADIO_TASK_TRIG_FULL_PENALTY_PCP_4_TASK_TRIG_FULL_PENALTY_PCP_4_Pos (0UL) /*!< Position of TASK_TRIG_FULL_PENALTY_PCP_4 field. */
#define RADIO_TASK_TRIG_FULL_PENALTY_PCP_4_TASK_TRIG_FULL_PENALTY_PCP_4_Msk (0x1UL << RADIO_TASK_TRIG_FULL_PENALTY_PCP_4_TASK_TRIG_FULL_PENALTY_PCP_4_Pos) /*!< Bit mask of TASK_TRIG_FULL_PENALTY_PCP_4 field. */

/* Register: RADIO_TASK_TRIG_ZERO_PENALTY_PCP_3 */
/* Description: Unspecified */

/* Bit 0 :   */
#define RADIO_TASK_TRIG_ZERO_PENALTY_PCP_3_TASK_TRIG_ZERO_PENALTY_PCP_3_Pos (0UL) /*!< Position of TASK_TRIG_ZERO_PENALTY_PCP_3 field. */
#define RADIO_TASK_TRIG_ZERO_PENALTY_PCP_3_TASK_TRIG_ZERO_PENALTY_PCP_3_Msk (0x1UL << RADIO_TASK_TRIG_ZERO_PENALTY_PCP_3_TASK_TRIG_ZERO_PENALTY_PCP_3_Pos) /*!< Bit mask of TASK_TRIG_ZERO_PENALTY_PCP_3 field. */

/* Register: RADIO_TASK_TRIG_FULL_PENALTY_PCP_3 */
/* Description: Unspecified */

/* Bit 0 :   */
#define RADIO_TASK_TRIG_FULL_PENALTY_PCP_3_TASK_TRIG_FULL_PENALTY_PCP_3_Pos (0UL) /*!< Position of TASK_TRIG_FULL_PENALTY_PCP_3 field. */
#define RADIO_TASK_TRIG_FULL_PENALTY_PCP_3_TASK_TRIG_FULL_PENALTY_PCP_3_Msk (0x1UL << RADIO_TASK_TRIG_FULL_PENALTY_PCP_3_TASK_TRIG_FULL_PENALTY_PCP_3_Pos) /*!< Bit mask of TASK_TRIG_FULL_PENALTY_PCP_3 field. */

/* Register: RADIO_TASK_TRIG_ZERO_PENALTY_PCP_2 */
/* Description: Unspecified */

/* Bit 0 :   */
#define RADIO_TASK_TRIG_ZERO_PENALTY_PCP_2_TASK_TRIG_ZERO_PENALTY_PCP_2_Pos (0UL) /*!< Position of TASK_TRIG_ZERO_PENALTY_PCP_2 field. */
#define RADIO_TASK_TRIG_ZERO_PENALTY_PCP_2_TASK_TRIG_ZERO_PENALTY_PCP_2_Msk (0x1UL << RADIO_TASK_TRIG_ZERO_PENALTY_PCP_2_TASK_TRIG_ZERO_PENALTY_PCP_2_Pos) /*!< Bit mask of TASK_TRIG_ZERO_PENALTY_PCP_2 field. */

/* Register: RADIO_TASK_TRIG_FULL_PENALTY_PCP_2 */
/* Description: Unspecified */

/* Bit 0 :   */
#define RADIO_TASK_TRIG_FULL_PENALTY_PCP_2_TASK_TRIG_FULL_PENALTY_PCP_2_Pos (0UL) /*!< Position of TASK_TRIG_FULL_PENALTY_PCP_2 field. */
#define RADIO_TASK_TRIG_FULL_PENALTY_PCP_2_TASK_TRIG_FULL_PENALTY_PCP_2_Msk (0x1UL << RADIO_TASK_TRIG_FULL_PENALTY_PCP_2_TASK_TRIG_FULL_PENALTY_PCP_2_Pos) /*!< Bit mask of TASK_TRIG_FULL_PENALTY_PCP_2 field. */

/* Register: RADIO_TASK_TRIG_ZERO_PENALTY_PCP_1 */
/* Description: Unspecified */

/* Bit 0 :   */
#define RADIO_TASK_TRIG_ZERO_PENALTY_PCP_1_TASK_TRIG_ZERO_PENALTY_PCP_1_Pos (0UL) /*!< Position of TASK_TRIG_ZERO_PENALTY_PCP_1 field. */
#define RADIO_TASK_TRIG_ZERO_PENALTY_PCP_1_TASK_TRIG_ZERO_PENALTY_PCP_1_Msk (0x1UL << RADIO_TASK_TRIG_ZERO_PENALTY_PCP_1_TASK_TRIG_ZERO_PENALTY_PCP_1_Pos) /*!< Bit mask of TASK_TRIG_ZERO_PENALTY_PCP_1 field. */

/* Register: RADIO_TASK_TRIG_FULL_PENALTY_PCP_1 */
/* Description: Unspecified */

