adamkondraciuk/nrfx/mdk/nrf54lilium_network_bitfields.h
/* Bit 0 :   */
#define RADIO_TASK_TRIG_FULL_PENALTY_PCP_1_TASK_TRIG_FULL_PENALTY_PCP_1_Pos (0UL) /*!< Position of TASK_TRIG_FULL_PENALTY_PCP_1 field. */
#define RADIO_TASK_TRIG_FULL_PENALTY_PCP_1_TASK_TRIG_FULL_PENALTY_PCP_1_Msk (0x1UL << RADIO_TASK_TRIG_FULL_PENALTY_PCP_1_TASK_TRIG_FULL_PENALTY_PCP_1_Pos) /*!< Bit mask of TASK_TRIG_FULL_PENALTY_PCP_1 field. */

/* Register: RADIO_TASK_TRIG_ZERO_PENALTY_PCP_0 */
/* Description: Unspecified */

/* Bit 0 :   */
#define RADIO_TASK_TRIG_ZERO_PENALTY_PCP_0_TASK_TRIG_ZERO_PENALTY_PCP_0_Pos (0UL) /*!< Position of TASK_TRIG_ZERO_PENALTY_PCP_0 field. */
#define RADIO_TASK_TRIG_ZERO_PENALTY_PCP_0_TASK_TRIG_ZERO_PENALTY_PCP_0_Msk (0x1UL << RADIO_TASK_TRIG_ZERO_PENALTY_PCP_0_TASK_TRIG_ZERO_PENALTY_PCP_0_Pos) /*!< Bit mask of TASK_TRIG_ZERO_PENALTY_PCP_0 field. */

/* Register: RADIO_TASK_TRIG_FULL_PENALTY_PCP_0 */
/* Description: Unspecified */

/* Bit 0 :   */
#define RADIO_TASK_TRIG_FULL_PENALTY_PCP_0_TASK_TRIG_FULL_PENALTY_PCP_0_Pos (0UL) /*!< Position of TASK_TRIG_FULL_PENALTY_PCP_0 field. */
#define RADIO_TASK_TRIG_FULL_PENALTY_PCP_0_TASK_TRIG_FULL_PENALTY_PCP_0_Msk (0x1UL << RADIO_TASK_TRIG_FULL_PENALTY_PCP_0_TASK_TRIG_FULL_PENALTY_PCP_0_Pos) /*!< Bit mask of TASK_TRIG_FULL_PENALTY_PCP_0 field. */

/* Register: RADIO_PENALTY_RG_PCP_0 */
/* Description: Unspecified */

/* Bits 31..0 :   */
#define RADIO_PENALTY_RG_PCP_0_FIELD0_Pos (0UL) /*!< Position of FIELD0 field. */
#define RADIO_PENALTY_RG_PCP_0_FIELD0_Msk (0xFFFFFFFFUL << RADIO_PENALTY_RG_PCP_0_FIELD0_Pos) /*!< Bit mask of FIELD0 field. */

/* Register: RADIO_PENALTY_RG_PCP_1 */
/* Description: Unspecified */

/* Bits 31..0 :   */
#define RADIO_PENALTY_RG_PCP_1_FIELD0_Pos (0UL) /*!< Position of FIELD0 field. */
#define RADIO_PENALTY_RG_PCP_1_FIELD0_Msk (0xFFFFFFFFUL << RADIO_PENALTY_RG_PCP_1_FIELD0_Pos) /*!< Bit mask of FIELD0 field. */

/* Register: RADIO_PENALTY_RG_PCP_2 */
/* Description: Unspecified */

/* Bits 31..0 :   */
#define RADIO_PENALTY_RG_PCP_2_FIELD0_Pos (0UL) /*!< Position of FIELD0 field. */
#define RADIO_PENALTY_RG_PCP_2_FIELD0_Msk (0xFFFFFFFFUL << RADIO_PENALTY_RG_PCP_2_FIELD0_Pos) /*!< Bit mask of FIELD0 field. */

/* Register: RADIO_PENALTY_RG_PCP_3 */
/* Description: Unspecified */

/* Bits 31..0 :   */
#define RADIO_PENALTY_RG_PCP_3_FIELD0_Pos (0UL) /*!< Position of FIELD0 field. */
#define RADIO_PENALTY_RG_PCP_3_FIELD0_Msk (0xFFFFFFFFUL << RADIO_PENALTY_RG_PCP_3_FIELD0_Pos) /*!< Bit mask of FIELD0 field. */

/* Register: RADIO_PENALTY_RG_PCP_4 */
/* Description: Unspecified */

/* Bits 31..0 :   */
#define RADIO_PENALTY_RG_PCP_4_FIELD0_Pos (0UL) /*!< Position of FIELD0 field. */
#define RADIO_PENALTY_RG_PCP_4_FIELD0_Msk (0xFFFFFFFFUL << RADIO_PENALTY_RG_PCP_4_FIELD0_Pos) /*!< Bit mask of FIELD0 field. */

/* Register: RADIO_TURN_OFF_AUTO_CLOCKSOURCE_REQ */
/* Description: Unspecified */

/* Bits 4..0 :   */
#define RADIO_TURN_OFF_AUTO_CLOCKSOURCE_REQ_FIELD0_Pos (0UL) /*!< Position of FIELD0 field. */
#define RADIO_TURN_OFF_AUTO_CLOCKSOURCE_REQ_FIELD0_Msk (0x1FUL << RADIO_TURN_OFF_AUTO_CLOCKSOURCE_REQ_FIELD0_Pos) /*!< Bit mask of FIELD0 field. */

/* Register: RADIO_FORCE_OVERRIDE_PCP_0 */
/* Description: Unspecified */

/* Bit 7 :   */
#define RADIO_FORCE_OVERRIDE_PCP_0_FIELD1_Pos (7UL) /*!< Position of FIELD1 field. */
#define RADIO_FORCE_OVERRIDE_PCP_0_FIELD1_Msk (0x1UL << RADIO_FORCE_OVERRIDE_PCP_0_FIELD1_Pos) /*!< Bit mask of FIELD1 field. */

/* Bit 1 :   */
#define RADIO_FORCE_OVERRIDE_PCP_0_FIELD0_Pos (1UL) /*!< Position of FIELD0 field. */
#define RADIO_FORCE_OVERRIDE_PCP_0_FIELD0_Msk (0x1UL << RADIO_FORCE_OVERRIDE_PCP_0_FIELD0_Pos) /*!< Bit mask of FIELD0 field. */

/* Register: RADIO_FORCE_OVERRIDE_PCP_1 */
/* Description: Unspecified */

/* Bit 7 :   */
#define RADIO_FORCE_OVERRIDE_PCP_1_FIELD1_Pos (7UL) /*!< Position of FIELD1 field. */
#define RADIO_FORCE_OVERRIDE_PCP_1_FIELD1_Msk (0x1UL << RADIO_FORCE_OVERRIDE_PCP_1_FIELD1_Pos) /*!< Bit mask of FIELD1 field. */

/* Bit 1 :   */
#define RADIO_FORCE_OVERRIDE_PCP_1_FIELD0_Pos (1UL) /*!< Position of FIELD0 field. */
#define RADIO_FORCE_OVERRIDE_PCP_1_FIELD0_Msk (0x1UL << RADIO_FORCE_OVERRIDE_PCP_1_FIELD0_Pos) /*!< Bit mask of FIELD0 field. */

/* Register: RADIO_FORCE_OVERRIDE_PCP_2 */
/* Description: Unspecified */

/* Bit 7 :   */
#define RADIO_FORCE_OVERRIDE_PCP_2_FIELD1_Pos (7UL) /*!< Position of FIELD1 field. */
#define RADIO_FORCE_OVERRIDE_PCP_2_FIELD1_Msk (0x1UL << RADIO_FORCE_OVERRIDE_PCP_2_FIELD1_Pos) /*!< Bit mask of FIELD1 field. */

/* Bit 1 :   */
#define RADIO_FORCE_OVERRIDE_PCP_2_FIELD0_Pos (1UL) /*!< Position of FIELD0 field. */
#define RADIO_FORCE_OVERRIDE_PCP_2_FIELD0_Msk (0x1UL << RADIO_FORCE_OVERRIDE_PCP_2_FIELD0_Pos) /*!< Bit mask of FIELD0 field. */

/* Register: RADIO_FORCE_OVERRIDE_PCP_3 */
/* Description: Unspecified */

/* Bit 7 :   */
#define RADIO_FORCE_OVERRIDE_PCP_3_FIELD1_Pos (7UL) /*!< Position of FIELD1 field. */
#define RADIO_FORCE_OVERRIDE_PCP_3_FIELD1_Msk (0x1UL << RADIO_FORCE_OVERRIDE_PCP_3_FIELD1_Pos) /*!< Bit mask of FIELD1 field. */

/* Bit 1 :   */
#define RADIO_FORCE_OVERRIDE_PCP_3_FIELD0_Pos (1UL) /*!< Position of FIELD0 field. */
#define RADIO_FORCE_OVERRIDE_PCP_3_FIELD0_Msk (0x1UL << RADIO_FORCE_OVERRIDE_PCP_3_FIELD0_Pos) /*!< Bit mask of FIELD0 field. */

/* Register: RADIO_FORCE_OVERRIDE_PCP_4 */
/* Description: Unspecified */

/* Bit 7 :   */
#define RADIO_FORCE_OVERRIDE_PCP_4_FIELD1_Pos (7UL) /*!< Position of FIELD1 field. */
#define RADIO_FORCE_OVERRIDE_PCP_4_FIELD1_Msk (0x1UL << RADIO_FORCE_OVERRIDE_PCP_4_FIELD1_Pos) /*!< Bit mask of FIELD1 field. */

/* Bit 1 :   */
#define RADIO_FORCE_OVERRIDE_PCP_4_FIELD0_Pos (1UL) /*!< Position of FIELD0 field. */
#define RADIO_FORCE_OVERRIDE_PCP_4_FIELD0_Msk (0x1UL << RADIO_FORCE_OVERRIDE_PCP_4_FIELD0_Pos) /*!< Bit mask of FIELD0 field. */


/* Peripheral: SAADC */
/* Description: Analog to Digital Converter */

/* Register: SAADC_TASKS_START */
/* Description: Start the ADC and prepare the result buffer in RAM */

/* Bit 0 : Start the ADC and prepare the result buffer in RAM */
#define SAADC_TASKS_START_TASKS_START_Pos (0UL) /*!< Position of TASKS_START field. */
#define SAADC_TASKS_START_TASKS_START_Msk (0x1UL << SAADC_TASKS_START_TASKS_START_Pos) /*!< Bit mask of TASKS_START field. */
#define SAADC_TASKS_START_TASKS_START_Trigger (1UL) /*!< Trigger task */

/* Register: SAADC_TASKS_SAMPLE */
/* Description: Take one ADC sample, if scan is enabled all channels are sampled */

/* Bit 0 : Take one ADC sample, if scan is enabled all channels are sampled */
#define SAADC_TASKS_SAMPLE_TASKS_SAMPLE_Pos (0UL) /*!< Position of TASKS_SAMPLE field. */
#define SAADC_TASKS_SAMPLE_TASKS_SAMPLE_Msk (0x1UL << SAADC_TASKS_SAMPLE_TASKS_SAMPLE_Pos) /*!< Bit mask of TASKS_SAMPLE field. */
#define SAADC_TASKS_SAMPLE_TASKS_SAMPLE_Trigger (1UL) /*!< Trigger task */

/* Register: SAADC_TASKS_STOP */
/* Description: Stop the ADC and terminate any on-going conversion */

/* Bit 0 : Stop the ADC and terminate any on-going conversion */
#define SAADC_TASKS_STOP_TASKS_STOP_Pos (0UL) /*!< Position of TASKS_STOP field. */
#define SAADC_TASKS_STOP_TASKS_STOP_Msk (0x1UL << SAADC_TASKS_STOP_TASKS_STOP_Pos) /*!< Bit mask of TASKS_STOP field. */
#define SAADC_TASKS_STOP_TASKS_STOP_Trigger (1UL) /*!< Trigger task */

