adamkondraciuk/nrfx/mdk/nrf54lilium_network_bitfields.h
/* Bits 4..0 : Analog positive input channel */
#define SAADC_CH_PSELP_PSELP_Pos (0UL) /*!< Position of PSELP field. */
#define SAADC_CH_PSELP_PSELP_Msk (0x1FUL << SAADC_CH_PSELP_PSELP_Pos) /*!< Bit mask of PSELP field. */
#define SAADC_CH_PSELP_PSELP_NC (0UL) /*!< Not connected */
#define SAADC_CH_PSELP_PSELP_AnalogInput0 (1UL) /*!< AIN0 */
#define SAADC_CH_PSELP_PSELP_AnalogInput1 (2UL) /*!< AIN1 */
#define SAADC_CH_PSELP_PSELP_AnalogInput2 (3UL) /*!< AIN2 */
#define SAADC_CH_PSELP_PSELP_AnalogInput3 (4UL) /*!< AIN3 */
#define SAADC_CH_PSELP_PSELP_AnalogInput4 (5UL) /*!< AIN4 */
#define SAADC_CH_PSELP_PSELP_AnalogInput5 (6UL) /*!< AIN5 */
#define SAADC_CH_PSELP_PSELP_AnalogInput6 (7UL) /*!< AIN6 */
#define SAADC_CH_PSELP_PSELP_AnalogInput7 (8UL) /*!< AIN7 */
#define SAADC_CH_PSELP_PSELP_ATB0 (9UL) /*!< ATB0 */
#define SAADC_CH_PSELP_PSELP_ATB1 (0xAUL) /*!< ATB1 */
#define SAADC_CH_PSELP_PSELP_VDD_TEST0 (0xBUL) /*!< Connected to VDD_AO_1V8 */
#define SAADC_CH_PSELP_PSELP_VDD_TEST1 (0xCUL) /*!< Connected to VDD_AO_0V8 */
#define SAADC_CH_PSELP_PSELP_VDD_TEST2 (0xDUL) /*!< Connected to VDD_IO_1V2 */
#define SAADC_CH_PSELP_PSELP_VDD_TEST3 (0xEUL) /*!< Connected to VDD_1V0 */
#define SAADC_CH_PSELP_PSELP_AVSS (0xFUL) /*!< AVSS */
#define SAADC_CH_PSELP_PSELP_SELREF (0x10UL) /*!< Selected reference, voltage determined by PADC_REFSEL */

/* Register: SAADC_CH_PSELN */
/* Description: Description cluster: Input negative pin selection for CH[n] */

/* Bits 4..0 : Analog negative input, enables differential channel */
#define SAADC_CH_PSELN_PSELN_Pos (0UL) /*!< Position of PSELN field. */
#define SAADC_CH_PSELN_PSELN_Msk (0x1FUL << SAADC_CH_PSELN_PSELN_Pos) /*!< Bit mask of PSELN field. */
#define SAADC_CH_PSELN_PSELN_NC (0UL) /*!< Not connected */
#define SAADC_CH_PSELN_PSELN_AnalogInput0 (1UL) /*!< AIN0 */
#define SAADC_CH_PSELN_PSELN_AnalogInput1 (2UL) /*!< AIN1 */
#define SAADC_CH_PSELN_PSELN_AnalogInput2 (3UL) /*!< AIN2 */
#define SAADC_CH_PSELN_PSELN_AnalogInput3 (4UL) /*!< AIN3 */
#define SAADC_CH_PSELN_PSELN_AnalogInput4 (5UL) /*!< AIN4 */
#define SAADC_CH_PSELN_PSELN_AnalogInput5 (6UL) /*!< AIN5 */
#define SAADC_CH_PSELN_PSELN_AnalogInput6 (7UL) /*!< AIN6 */
#define SAADC_CH_PSELN_PSELN_AnalogInput7 (8UL) /*!< AIN7 */
#define SAADC_CH_PSELN_PSELN_ATB0 (9UL) /*!< ATB0 */
#define SAADC_CH_PSELN_PSELN_ATB1 (0xAUL) /*!< ATB1 */
#define SAADC_CH_PSELN_PSELN_VVDD_TEST4 (0xBUL) /*!< Reserved for VDD_PPA_1V6 (Halti only) */
#define SAADC_CH_PSELN_PSELN_VDD_TEST5 (0xCUL) /*!< Reserved for VDD_IO_3V3 */
#define SAADC_CH_PSELN_PSELN_VDD_TEST6 (0xDUL) /*!< Reserved for VDD_AO_5V0 */
#define SAADC_CH_PSELN_PSELN_VDD_TEST7 (0xEUL) /*!< RFU */
#define SAADC_CH_PSELN_PSELN_AVSS (0xFUL) /*!< AVSS */
#define SAADC_CH_PSELN_PSELN_SELREF (0x10UL) /*!< Selected reference, voltage determined by PADC_REFSEL */

/* Register: SAADC_CH_CONFIG */
/* Description: Description cluster: Input configuration for CH[n] */

/* Bits 30..28 : Conversion time. Resulting conversion time is ((TCONV+1) x 250 ns) */
#define SAADC_CH_CONFIG_TCONV_Pos (28UL) /*!< Position of TCONV field. */
#define SAADC_CH_CONFIG_TCONV_Msk (0x7UL << SAADC_CH_CONFIG_TCONV_Pos) /*!< Bit mask of TCONV field. */

/* Bits 24..16 : Acquisition time, the time the ADC uses to sample the input voltage. Resulting acquistion time is ((TACQ+1) x 125 ns) */
#define SAADC_CH_CONFIG_TACQ_Pos (16UL) /*!< Position of TACQ field. */
#define SAADC_CH_CONFIG_TACQ_Msk (0x1FFUL << SAADC_CH_CONFIG_TACQ_Pos) /*!< Bit mask of TACQ field. */

/* Bit 15 : Enable differential mode */
#define SAADC_CH_CONFIG_MODE_Pos (15UL) /*!< Position of MODE field. */
#define SAADC_CH_CONFIG_MODE_Msk (0x1UL << SAADC_CH_CONFIG_MODE_Pos) /*!< Bit mask of MODE field. */
#define SAADC_CH_CONFIG_MODE_SE (0UL) /*!< Single ended, PSELN will be ignored, negative input to ADC shorted to GND */
#define SAADC_CH_CONFIG_MODE_Diff (1UL) /*!< Differential */

/* Bits 13..12 : Reference control */
#define SAADC_CH_CONFIG_REFSEL_Pos (12UL) /*!< Position of REFSEL field. */
#define SAADC_CH_CONFIG_REFSEL_Msk (0x3UL << SAADC_CH_CONFIG_REFSEL_Pos) /*!< Bit mask of REFSEL field. */
#define SAADC_CH_CONFIG_REFSEL_Internal (0UL) /*!< Internal reference (1.024 V) */
#define SAADC_CH_CONFIG_REFSEL_External (1UL) /*!< External reference given at PADC_EXT_REF_1V2 */
#define SAADC_CH_CONFIG_REFSEL_IBPSR_4U_PADC (2UL) /*!< Reference generated by IBPSR_4U_PADC */

/* Bit 11 : Enable burst mode */
#define SAADC_CH_CONFIG_BURST_Pos (11UL) /*!< Position of BURST field. */
#define SAADC_CH_CONFIG_BURST_Msk (0x1UL << SAADC_CH_CONFIG_BURST_Pos) /*!< Bit mask of BURST field. */
#define SAADC_CH_CONFIG_BURST_Disabled (0UL) /*!< Burst mode is disabled (normal operation) */
#define SAADC_CH_CONFIG_BURST_Enabled (1UL) /*!< Burst mode is enabled. SAADC takes 2^OVERSAMPLE number of samples as fast as it can, and sends the average to Data RAM. */

/* Bits 10..8 : Gain control */
#define SAADC_CH_CONFIG_GAIN_Pos (8UL) /*!< Position of GAIN field. */
#define SAADC_CH_CONFIG_GAIN_Msk (0x7UL << SAADC_CH_CONFIG_GAIN_Pos) /*!< Bit mask of GAIN field. */
#define SAADC_CH_CONFIG_GAIN_Gain2_3 (0UL) /*!< 2/3 */
#define SAADC_CH_CONFIG_GAIN_Gain1 (1UL) /*!< 1 */
#define SAADC_CH_CONFIG_GAIN_Gain2 (2UL) /*!< 2 */
#define SAADC_CH_CONFIG_GAIN_Gain4 (3UL) /*!< 4 */

/* Bits 5..4 : Negative channel resistor control */
#define SAADC_CH_CONFIG_RESN_Pos (4UL) /*!< Position of RESN field. */
#define SAADC_CH_CONFIG_RESN_Msk (0x3UL << SAADC_CH_CONFIG_RESN_Pos) /*!< Bit mask of RESN field. */
#define SAADC_CH_CONFIG_RESN_Bypass (0UL) /*!< Bypass resistor ladder */
#define SAADC_CH_CONFIG_RESN_Pulldown (1UL) /*!< Pull-down to GND */
#define SAADC_CH_CONFIG_RESN_Pullup (2UL) /*!< Pull-up to VDD_AO_1V8 */
#define SAADC_CH_CONFIG_RESN_VDD_AO_1V8_2 (3UL) /*!< Set input at VDD_AO_1V8/2 */

/* Bits 1..0 : Positive channel resistor control */
#define SAADC_CH_CONFIG_RESP_Pos (0UL) /*!< Position of RESP field. */
#define SAADC_CH_CONFIG_RESP_Msk (0x3UL << SAADC_CH_CONFIG_RESP_Pos) /*!< Bit mask of RESP field. */
#define SAADC_CH_CONFIG_RESP_Bypass (0UL) /*!< Bypass resistor ladder */
#define SAADC_CH_CONFIG_RESP_Pulldown (1UL) /*!< Pull-down to GND */
#define SAADC_CH_CONFIG_RESP_Pullup (2UL) /*!< Pull-up to VDD_AO_1V8 */
#define SAADC_CH_CONFIG_RESP_VDD_AO_1V8_2 (3UL) /*!< Set input at VDD_AO_1V8/2 */

/* Register: SAADC_CH_LIMIT */
/* Description: Description cluster: High/low limits for event monitoring a channel */

