adamkondraciuk/nrfx/mdk/nrf54lilium_network_bitfields.h
/* Register: SAADC_CALOFFSET */
/* Description: Calibration control for offset error */

/* Bits 5..0 : Sign-magnitude coding */
#define SAADC_CALOFFSET_CALOFFSET_Pos (0UL) /*!< Position of CALOFFSET field. */
#define SAADC_CALOFFSET_CALOFFSET_Msk (0x3FUL << SAADC_CALOFFSET_CALOFFSET_Pos) /*!< Bit mask of CALOFFSET field. */
#define SAADC_CALOFFSET_CALOFFSET_Default (0UL) /*!< Default setting */
#define SAADC_CALOFFSET_CALOFFSET_MaxPos (0x1FUL) /*!< Maximum positive offset */
#define SAADC_CALOFFSET_CALOFFSET_MaxNeg (0x20UL) /*!< maximum negative offset */

/* Register: SAADC_CALGAIN */
/* Description: Calibration control for gain error */

/* Bits 6..0 : Offset binary coding */
#define SAADC_CALGAIN_CALGAIN_Pos (0UL) /*!< Position of CALGAIN field. */
#define SAADC_CALGAIN_CALGAIN_Msk (0x7FUL << SAADC_CALGAIN_CALGAIN_Pos) /*!< Bit mask of CALGAIN field. */
#define SAADC_CALGAIN_CALGAIN_Default (0UL) /*!< Default gain, for +1/2 input (assume full-scale = +-1) the output will be 1024 */
#define SAADC_CALGAIN_CALGAIN_High (0x3FUL) /*!< High gain setting */
#define SAADC_CALGAIN_CALGAIN_Low (0x40UL) /*!< Low gain setting */

/* Register: SAADC_CALVREF */
/* Description: Calibration control for reference voltage */

/* Bits 6..0 : Offset binary coding */
#define SAADC_CALVREF_CALVREF_Pos (0UL) /*!< Position of CALVREF field. */
#define SAADC_CALVREF_CALVREF_Msk (0x7FUL << SAADC_CALVREF_CALVREF_Pos) /*!< Bit mask of CALVREF field. */
#define SAADC_CALVREF_CALVREF_Default (0UL) /*!< Default vref, in typical corner VREF=1.2V */
#define SAADC_CALVREF_CALVREF_High (0x3FUL) /*!< Low output code (high reference voltage) */
#define SAADC_CALVREF_CALVREF_Low (0x40UL) /*!< High output code (low reference voltage) */

/* Register: SAADC_CALIREF */
/* Description: Calibration control for reference current */

/* Bits 3..0 : Calibration control for reference current. See design description for coding */
#define SAADC_CALIREF_CALIREF_Pos (0UL) /*!< Position of CALIREF field. */
#define SAADC_CALIREF_CALIREF_Msk (0xFUL << SAADC_CALIREF_CALIREF_Pos) /*!< Bit mask of CALIREF field. */

/* Register: SAADC_CALVREFTC */
/* Description: Calibration code for reference temperature coefficient */

/* Bits 2..0 : Calibration code for reference temperature coefficient. See design description for coding */
#define SAADC_CALVREFTC_CALVREFTC_Pos (0UL) /*!< Position of CALVREFTC field. */
#define SAADC_CALVREFTC_CALVREFTC_Msk (0x7UL << SAADC_CALVREFTC_CALVREFTC_Pos) /*!< Bit mask of CALVREFTC field. */

/* Register: SAADC_NOISESHAPE */
/* Description: Enable noise shaping */

/* Bits 1..0 : Enable noise shaping */
#define SAADC_NOISESHAPE_NOISESHAPE_Pos (0UL) /*!< Position of NOISESHAPE field. */
#define SAADC_NOISESHAPE_NOISESHAPE_Msk (0x3UL << SAADC_NOISESHAPE_NOISESHAPE_Pos) /*!< Bit mask of NOISESHAPE field. */
#define SAADC_NOISESHAPE_NOISESHAPE_Disable (0UL) /*!< Oversampling based on accumulate and average. Used in high-speed mode (10-bit) */
#define SAADC_NOISESHAPE_NOISESHAPE_Enable (1UL) /*!< Oversampling based on noise shaping. Used in  high-accuracy modes (12-bit and 14-bit) */

/* Register: SAADC_EASYDMAMODE */
/* Description: Configure EasyDMA mode. */

/* Bit 0 : Enable low-power operation, or use low-latency */
#define SAADC_EASYDMAMODE_LPOP_Pos (0UL) /*!< Position of LPOP field. */
#define SAADC_EASYDMAMODE_LPOP_Msk (0x1UL << SAADC_EASYDMAMODE_LPOP_Pos) /*!< Bit mask of LPOP field. */
#define SAADC_EASYDMAMODE_LPOP_LowLat (0UL) /*!< Low-latency operation */
#define SAADC_EASYDMAMODE_LPOP_LowPower (1UL) /*!< Low-power operation */

/* Register: SAADC_TERMINATEONAHBERROR */
/* Description: Enable EasyDMA termination on AHB error */

/* Bit 0 : Enable termination on AHB error */
#define SAADC_TERMINATEONAHBERROR_ENABLE_Pos (0UL) /*!< Position of ENABLE field. */
#define SAADC_TERMINATEONAHBERROR_ENABLE_Msk (0x1UL << SAADC_TERMINATEONAHBERROR_ENABLE_Pos) /*!< Bit mask of ENABLE field. */
#define SAADC_TERMINATEONAHBERROR_ENABLE_Disabled (0UL) /*!< Termination on AHB error disabled */
#define SAADC_TERMINATEONAHBERROR_ENABLE_Enabled (1UL) /*!< Termination on AHB error enabled */

/* Register: SAADC_AHBERRORADDRESS */
/* Description: Address of the last AHB error transaction */

/* Bits 31..0 : Address */
#define SAADC_AHBERRORADDRESS_ADDRESS_Pos (0UL) /*!< Position of ADDRESS field. */
#define SAADC_AHBERRORADDRESS_ADDRESS_Msk (0xFFFFFFFFUL << SAADC_AHBERRORADDRESS_ADDRESS_Pos) /*!< Bit mask of ADDRESS field. */


/* Peripheral: TEMP */
/* Description: Temperature Sensor */

/* Register: TEMP_TASKS_START */
/* Description: Start temperature measurement */

/* Bit 0 : Start temperature measurement */
#define TEMP_TASKS_START_TASKS_START_Pos (0UL) /*!< Position of TASKS_START field. */
#define TEMP_TASKS_START_TASKS_START_Msk (0x1UL << TEMP_TASKS_START_TASKS_START_Pos) /*!< Bit mask of TASKS_START field. */
#define TEMP_TASKS_START_TASKS_START_Trigger (1UL) /*!< Trigger task */

/* Register: TEMP_TASKS_STOP */
/* Description: Stop temperature measurement */

/* Bit 0 : Stop temperature measurement */
#define TEMP_TASKS_STOP_TASKS_STOP_Pos (0UL) /*!< Position of TASKS_STOP field. */
#define TEMP_TASKS_STOP_TASKS_STOP_Msk (0x1UL << TEMP_TASKS_STOP_TASKS_STOP_Pos) /*!< Bit mask of TASKS_STOP field. */
#define TEMP_TASKS_STOP_TASKS_STOP_Trigger (1UL) /*!< Trigger task */

/* Register: TEMP_SUBSCRIBE_START */
/* Description: Subscribe configuration for task START */

/* Bit 31 :   */
#define TEMP_SUBSCRIBE_START_EN_Pos (31UL) /*!< Position of EN field. */
#define TEMP_SUBSCRIBE_START_EN_Msk (0x1UL << TEMP_SUBSCRIBE_START_EN_Pos) /*!< Bit mask of EN field. */
#define TEMP_SUBSCRIBE_START_EN_Disabled (0UL) /*!< Disable subscription */
#define TEMP_SUBSCRIBE_START_EN_Enabled (1UL) /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task START will subscribe to */
#define TEMP_SUBSCRIBE_START_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define TEMP_SUBSCRIBE_START_CHIDX_Msk (0xFFUL << TEMP_SUBSCRIBE_START_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: TEMP_SUBSCRIBE_STOP */
/* Description: Subscribe configuration for task STOP */

/* Bit 31 :   */
#define TEMP_SUBSCRIBE_STOP_EN_Pos (31UL) /*!< Position of EN field. */
#define TEMP_SUBSCRIBE_STOP_EN_Msk (0x1UL << TEMP_SUBSCRIBE_STOP_EN_Pos) /*!< Bit mask of EN field. */
#define TEMP_SUBSCRIBE_STOP_EN_Disabled (0UL) /*!< Disable subscription */
#define TEMP_SUBSCRIBE_STOP_EN_Enabled (1UL) /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task STOP will subscribe to */
#define TEMP_SUBSCRIBE_STOP_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define TEMP_SUBSCRIBE_STOP_CHIDX_Msk (0xFFUL << TEMP_SUBSCRIBE_STOP_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: TEMP_EVENTS_DATARDY */
/* Description: Temperature measurement complete, data ready */

